[{"id":1,"title":"The use of child performers should be banned"},{"id":2,"title":"Celebrities should be exempt from National Service (in South Korea)"},{"id":3,"title":"Trade is better than aid"},{"id":4,"title":"It should be allowed to have military recruitment in schools"},{"id":5,"title":"Rupert Murdoch is not a fit person to run an international media corporation"},{"id":6,"title":"Smoking should further be restricted"},{"id":7,"title":"Animals have rights."},{"id":8,"title":"Proportional representation is necessary."},{"id":9,"title":"There must be a child curfews"},{"id":10,"title":"It is important to use a graduated response to combat unauthorised file-sharing of copyrighted material"},{"id":11,"title":"Internet access is a human right"},{"id":12,"title":"It is important to use foreign aid funds to research and distribute software that allows bloggers and journalists in non-democratic countries to evade censorship and conceal their online activities."},{"id":13,"title":"Ratify the Anti-Counterfeiting Trade Agreement (ACTA)."},{"id":14,"title":"Governments be allowed to disrupt Internet service on grounds of national security."},{"id":15,"title":"A new global body, the United Nations Committee for Internet Related Policies, take over internet governance."},{"id":16,"title":"The net neutrality legislation has to be supported."},{"id":17,"title":"There should be a presumption in favour of publication for information held by public bodies"},{"id":18,"title":"Goal line technology has to be adopted in football"},{"id":19,"title":"permit the use of performance enhancing drugs in professional sports"},{"id":20,"title":"All nations should ban bullfighting"},{"id":21,"title":"Instant Replay Should Be Used in Major League Baseball"},{"id":22,"title":"The music that glorifies violence against women should be banned"},{"id":23,"title":"It is crucial to explore the universe"},{"id":24,"title":"Gay couples should be allowed to marry"},{"id":25,"title":"The Catholic Church is justified in forbidding the use of barrier methods of contraception"},{"id":26,"title":"Atheism is the only way"},{"id":27,"title":"Anarchism is a valuable political ideology"},{"id":28,"title":"Democracy has to be imposed, if needed"},{"id":29,"title":"Capitalism is better than socialism"},{"id":30,"title":"The International Criminal Court is a force for good"},{"id":31,"title":"A common EU foreign policy should be favored"},{"id":32,"title":"The United Nations Security Council should be expanded"},{"id":33,"title":"Smokers should be denied access to state healthcare"},{"id":34,"title":"Smoking in public spaces should be banned"},{"id":35,"title":"Cannabis should be legalised"},{"id":37,"title":"Music containing lyrics that glorify violent and criminal lifestyles should be banned"},{"id":38,"title":"The leaking of military documents by Anat Kamm was justified"},{"id":39,"title":"Users of extremist websites should be punished"},{"id":40,"title":"India’s Ban on the Satanic Verses is justified"},{"id":41,"title":"Corporations’ Use of IP Laws in Relation to Event Sponsorship Poses a Threat to Freedom of Expression"},{"id":42,"title":"We should fear the power of government over the Internet"},{"id":43,"title":"Religious freedom abroad should be one of the primary foreign policy concerns for any country"},{"id":44,"title":"The BBC should be free to blaspheme"},{"id":45,"title":"It makes sense to drive to an out of town to a shopping centre"},{"id":46,"title":"Nuclear technology must be adopted"},{"id":47,"title":"Performing tests on animals must be banned"},{"id":48,"title":"Private universities in the UK must be encouraged"},{"id":49,"title":"History has no place in the classroom"},{"id":50,"title":"We must bring back corporal punishment"},{"id":51,"title":"Hosting the Olympics is a good investment"},{"id":52,"title":"There should be a legally mandated ceiling on weekly working hours"},{"id":53,"title":"Gambling must be banned"},{"id":54,"title":"The sale of violent video games\/censor violent video games should be illegal"},{"id":55,"title":"Danish newspapers should not have published cartoons depicting the Prophet Mohammed"},{"id":56,"title":"We should force feed sufferers of Anorexia Nervosa"},{"id":57,"title":"English has to become the official language of the United States"},{"id":58,"title":"Cultural property residing in museums must be returned to its place of origin"},{"id":59,"title":"Wikipedia is a force for good"},{"id":60,"title":"We must support public service broadcasters"},{"id":61,"title":"We should restrict violent video games"},{"id":62,"title":"Advertising is harmful"},{"id":63,"title":"Newspapers belong to the past"},{"id":64,"title":" Aboriginal culture must be protected"},{"id":65,"title":"Sexist advertising must be banned"},{"id":66,"title":"Access to the websites that deny the Holocaust must be blocked"},{"id":67,"title":"The full financial history of all candidates for political office must be posted online"},{"id":68,"title":"Transparency is necessary for security"},{"id":69,"title":"Western democracies should openly try to circumvent Internet censorship in oppressive regimes"},{"id":70,"title":"Major league baseball should continue to allow collisions at home plate"},{"id":71,"title":"The 2022 Football World Cup must be moved to the winter"},{"id":72,"title":"Professional sportsmen must be required to represent their countries at the international level"},{"id":73,"title":"Positive discrimination must be used to put more women in parliament"},{"id":74,"title":"Force has to be used to protect human rights abroad"},{"id":75,"title":"Affirmative action is necessary"},{"id":76,"title":"Illegal immigrants must be given drivers licenses"},{"id":77,"title":"The people's republic of China should abandon the one-child policy"},{"id":78,"title":"That Zero Tolerance Policing is a Good Tactic for Fighting Crime"},{"id":79,"title":"South Ossetia should be independent"},{"id":80,"title":"The Republika Srpska must be allowed to secede from Bosnia & Herzegovina"},{"id":81,"title":"The feminist movement should seek a ban on pornography"},{"id":82,"title":"Developing nations should place restrictions on rural-urban migration"},{"id":83,"title":"Gender quotas in the EU are advantageous for the economies of member states"},{"id":84,"title":"Governments should prioritise spending money on youth"},{"id":85,"title":"The EU should offer asylum to women from countries which have legislation that discriminates against women"},{"id":86,"title":"Tteachers should be armed"},{"id":87,"title":"Women should be allowed to take part in combat"},{"id":88,"title":"Arranged marriages in EU countries should be banned."},{"id":89,"title":"The Reproductive Health Bill will undermine families and values"},{"id":90,"title":"Human Cloning has to be banned"},{"id":91,"title":"Israel should recognise the Palestinian right of return"},{"id":92,"title":"Sexual orientation should be considered grounds for asylum"},{"id":93,"title":"Prostitution has to be legalised"},{"id":94,"title":"The right to asylum should not be absolute"},{"id":95,"title":"Anti-Social Behaviour Orders (UK) must be scraped"},{"id":96,"title":"Positive discrimination has to be used to increase diversity in university"},{"id":97,"title":"require the ICC to allow a defence of “cultural relativism” to the crime of recruiting and using child soldiers"},{"id":98,"title":"An amnesty to illegal immigrants has to be granted"},{"id":99,"title":"The sale of children’s toys as part of fast food meals must be prohobited."},{"id":100,"title":"Nations of the world should increase protection of the economic and social rights of migrants"},{"id":101,"title":"Children in developing countries should be sponsored"},{"id":102,"title":"You should never have children"},{"id":103,"title":"Housewives should be paid for their work"},{"id":104,"title":"The USA's social security schemes should be privatized"},{"id":105,"title":"Security profiling at airports is justified"},{"id":106,"title":"Cohabiting couples who wish to end their relationships should be allowed to request that the courts supervise the division of their property"},{"id":107,"title":"Hate crime 'enhancements' are unjust"},{"id":108,"title":"The age of consent laws should be lowered"},{"id":109,"title":"Partial birth abortions should be banned"},{"id":110,"title":"Marriage is an outdated institution"},{"id":111,"title":"It is be ok to use racial profiling as part of airport security checks"},{"id":112,"title":"Feminism Is Still Needed"},{"id":113,"title":"Countries with an imbalanced male\/female ratio skewed towards males should encourage parents to produce girls"},{"id":114,"title":"Parents should be allowed to genetically screen foetuses for heritable diseases"},{"id":115,"title":"Hate speech on campus has to censored"},{"id":116,"title":"Parents should be able to choose the sex of their children"},{"id":117,"title":"It should be allowed to patent genes"},{"id":118,"title":"Homosexuals should be able to adopt"},{"id":119,"title":"All illegal immigrants must be repatriated"},{"id":120,"title":"Racial quotas must be set in South African rugby"},{"id":121,"title":"South Africa should host an Olympics"},{"id":122,"title":"Gabon hosting the Africa Cup of Nations was a good thing"},{"id":123,"title":"Restrictions must be imposed on overseas players in football"},{"id":124,"title":"Playoffs must be implemented in collegiate level american football"},{"id":125,"title":"Boycott the Euro 2012 in Ukraine unless Yulia Timoshenko is released from prison"},{"id":126,"title":"Ban countries with very harsh training methods from participating in international competitions"},{"id":127,"title":"Force the media to display, promote and report women’s sport equally to men’s sport."},{"id":128,"title":"Chess must be at the Olympics"},{"id":129,"title":"Allow women to compete in the same leagues as men"},{"id":130,"title":"Subsidise the translation of academic work in the languages of developing countries"},{"id":131,"title":"Any work that is not released under a creative commons license shouldn't be funded"},{"id":132,"title":"Force think tanks to reveal all of their sources of funding"},{"id":133,"title":"Ban all anonymous posting and commenting on the Internet"},{"id":134,"title":"You have nothing to worry about surveillance if you have done nothing wrong"},{"id":135,"title":"Indiscriminate NSA surveillance of the rest of the world hurts the United States"},{"id":136,"title":"You should join Facebook"},{"id":137,"title":"I believe in the Right to be forgotten"},{"id":138,"title":"During riots it might make sense to block access to social messaging networks"},{"id":139,"title":"Western companies have to incentivised to build software that provides anonymity to those involved in uprisings"},{"id":140,"title":"State funding to universities have to be conditioned upon all academic work being made available to the general public"},{"id":141,"title":"Online gambling has to be banned"},{"id":142,"title":"Universities should make all academic work they produce, including scholarly articles, course handbooks and recorded lectures, available to the general public"},{"id":143,"title":"Actively circumventing Internet censorship is a legitimate foreign policy tool"},{"id":144,"title":"Targeted sanctions have to be used to respond to cyber-attacks"},{"id":145,"title":"Parents have to be allowed to monitor their children's online and mobile communications"},{"id":146,"title":"Private lives of public figures should be open to press scrutiny."},{"id":147,"title":"politicians have no right to privacy"},{"id":148,"title":"We have to offer amnesty to bloggers currently prosecuted by their native states"},{"id":149,"title":"We have to cut the length of copyright protection"},{"id":150,"title":"It is important to ban the sale of surveillance technology to non-democratic countries"},{"id":151,"title":"Targeted online advertising on the basis of user profiles and demographics must be banned"},{"id":152,"title":"The state should provide broadband internet through nationalized companies"},{"id":153,"title":"Internet service providers should be allowed to block access to extremist websites"},{"id":154,"title":"Do not allow companies to collect\/sell the personal data of their clients"},{"id":155,"title":"All literature, art, photography, film and music should be released under Creative Commons licenses"},{"id":156,"title":"States should stimulate (or subsidise) mother tongue education for large immigrant groups."},{"id":157,"title":"Forced evictions are necessary for African cities to become global players."},{"id":158,"title":"We have to follow countries such as Senegal that have quotas for women in politics"},{"id":159,"title":"The government of Uganda has failed its citizens over LGBT rights"},{"id":160,"title":"We have to teach creationism in schools"},{"id":161,"title":"Domestic intelligence agencies have a legitimate role to play in democracy"},{"id":162,"title":"Wire-tapped and ‘intercepted’ evidence must be allowed as admissible in court"},{"id":163,"title":"The right to anonymous posting on the internet should be protected by law"},{"id":164,"title":"There must be a ban the sale of 3D printers to households"},{"id":165,"title":"The new technologies will make entrepreneurs of Africa’s youth"},{"id":166,"title":"We have to consider a large scale cyber attack an act of war"},{"id":167,"title":"Male infant circumcision is tantamount to child abuse"},{"id":168,"title":"Keep the Sabbath as a Day of Rest"},{"id":169,"title":"The niqab and other face coverings in schools must be banned"},{"id":170,"title":"Religion does more harm than good"},{"id":171,"title":"Religious symbols in public buildings must be banned"},{"id":172,"title":"Belief in God is irrational"},{"id":173,"title":"Religious beliefs should override government laws"},{"id":174,"title":"The Church of England should be separated from the British state."},{"id":175,"title":"It is fine to kill one to save many"},{"id":176,"title":"Make all museums free of charge"},{"id":177,"title":"Remove the requirement for Catholic Priests to take a vow of celibacy"},{"id":178,"title":"Remove the words \"under God\" from the American Pledge of Allegiance"},{"id":179,"title":"(as a Christian Church) allow the ordination of gay and lesbian priests"},{"id":180,"title":"Traditional university has to be replaced by online learning"},{"id":181,"title":"Tanzania’s taxation on mobile phones is a good model"},{"id":182,"title":"We have to produce high quality generic drugs for Africa"},{"id":183,"title":"German prosecutors should investigate NSA surveillance of Angela Merkel"},{"id":184,"title":"Ban animal testing"},{"id":185,"title":"Every child should have a mobile phone."},{"id":186,"title":"We must colonize moon"},{"id":187,"title":"We must legalize the use of cell phones in cars"},{"id":188,"title":"We must grant those diagnosed with terminal illnesses the right to access treatments that have not completed clinical testing"},{"id":189,"title":"It is crucial to support the development of a missile defence system"},{"id":190,"title":"Downloading music without permission is morally equivalent to theft"},{"id":191,"title":"Teachers must be banned from interacting with students via social networking websites."},{"id":192,"title":"governments should choose open source software in order to encourage its use"},{"id":193,"title":"The Internet must be censored"},{"id":194,"title":"I believe in manned space flight"},{"id":195,"title":"Intellectual property rights have to be abolished"},{"id":196,"title":"The development of genetically modified organisms have to be banned"},{"id":197,"title":"Evolution has Disproved Creationism"},{"id":198,"title":"Google shouldn’t censor its search results in China"},{"id":199,"title":"It is necessary to offer increased aid to developing world countries that encourage and accept large influxes of immigrants"},{"id":200,"title":"The Gulf States should take in more Syrian refugees"},{"id":201,"title":"Cyberbullies must be punished with prison even if under 18"},{"id":202,"title":"Intellectual migration (brain drain) is caused by a lack of belonging rather than a lack of opportunities"},{"id":203,"title":"Cut aid to African states that criminalise homosexuality"},{"id":204,"title":"We must enable free movement of labour across Africa to alleviate poverty disparities."},{"id":205,"title":"African cities need to invest more in housing to replace slums"},{"id":206,"title":"The feminisation of Africa’s labour force is empowering women"},{"id":207,"title":"Poverty is the most important security issue facing Africa"},{"id":208,"title":"Civil society should be granted a wider participation in Africa’s political life"},{"id":209,"title":"Legal empowerment is provided for women through land titling"},{"id":210,"title":"We must hold a referendum on UK membership in the EU"},{"id":211,"title":"The Arab Spring revolutions can create stable democracies."},{"id":212,"title":"All nations have a right to nuclear weapons"},{"id":213,"title":"The House of Lords should be reformed"},{"id":214,"title":"We have to employ mercenaries"},{"id":215,"title":"We should use torture to obtain information from suspected terrorists"},{"id":216,"title":"We should limit the right to bear arms"},{"id":217,"title":"We must disband NATO"},{"id":218,"title":"Government must be Big and Beefy"},{"id":219,"title":"Turkey should be let join the European Union"},{"id":220,"title":"Faith schools must be banned"},{"id":221,"title":"Handguns must be banned in Washington D.C."},{"id":222,"title":"We must use Unmanned Aerial Vehicles to strike terrorist targets"},{"id":223,"title":"Does campaign finance in the United States need to be fixed?"},{"id":224,"title":"Should the United States scale back the War on Drugs?"},{"id":225,"title":"Should the United States increase the foreign aid budget?"},{"id":226,"title":"Film stars, music stars and other popular entertainers should not be participating in party-political campaigns"},{"id":227,"title":"Should the U.S. Government continue to spend at current levels even if it means raising taxes"},{"id":228,"title":"We must let Catalan hold an independence referendum"},{"id":229,"title":"It is worth voting"},{"id":231,"title":"Greece should default on its debt and return to the Drachma"},{"id":232,"title":"We support the New START Treaty"},{"id":233,"title":"The Dalai Lama’s ‘third way’ in Tibet"},{"id":234,"title":"Puerto Rico should seek American statehood"},{"id":235,"title":"We should directly elect city mayors"},{"id":236,"title":"Abolish the Superdelegate System for Democratic Party Conventions"},{"id":237,"title":"Quebec should secede from Canada"},{"id":238,"title":"Opinion polls harm the democratic process"},{"id":239,"title":"Recognise Kosovo as an independent state"},{"id":240,"title":"The EU, USA and other western donors should not fund any Palestinian government in which terrorist organisations participate"},{"id":241,"title":"University education should be free"},{"id":242,"title":"Grant politicians immunity from prosecution"},{"id":243,"title":"The UN should recognize a Palestinian state"},{"id":244,"title":"Restrict the right to Habeas Corpus as part of efforts to combat terrorism"},{"id":245,"title":"Abandon the timetable for withdrawal from Afghanistan"},{"id":246,"title":"The northern Ireland would be better off if united with the Republic of Ireland"},{"id":247,"title":"Abolish all collective bargaining rights claimed by trades unions"},{"id":248,"title":"We must support the use of truth and reconciliation commissions"},{"id":249,"title":"We must ban negative advertising in political campaigns"},{"id":250,"title":"We should encourage increased use of referendums"},{"id":252,"title":"We must hold all U.S. presidential primaries on the same day"},{"id":253,"title":"We oppose the U.S. hegemonic military power"},{"id":254,"title":"The US intervention in Libya, lacking congressional approval, was illegal"},{"id":255,"title":"Socialism is Dead"},{"id":256,"title":"The use of atomic bombs against Hiroshima and Nagasaki was justified"},{"id":257,"title":"The republican party has lost its way"},{"id":258,"title":"Abolish the monarchy."},{"id":259,"title":"The United States’ individual health insurance mandate is unconstitutional"},{"id":260,"title":"Abolish the US Electoral College"},{"id":261,"title":"We must support the Scottish Independence"},{"id":262,"title":"There must be compulsory identity cards"},{"id":263,"title":"The War in Iraq was Worth the Cost"},{"id":264,"title":"Bribery is sometimes acceptable"},{"id":265,"title":"We must extend NATO membership to Georgia and Ukraine"},{"id":266,"title":"We must invade and forcibly reunify the Korean peninsula"},{"id":267,"title":"The U.S. Should Ban The Use of Cluster Bombs"},{"id":268,"title":"USA must sign the Ottawa Convention banning landmines"},{"id":269,"title":"We must be a libertarian; right or left, right or wrong"},{"id":270,"title":"The US is Justified in Using Force to Prevent States From Acquiring Nuclear Weapons"},{"id":271,"title":"Open primaries are the most effective method of selecting candidates for elections"},{"id":272,"title":"Russia needs strong leadership"},{"id":273,"title":"Abolish congressional earmarks"},{"id":274,"title":"Terrorists Should Be Subject to the Geneva Conventions"},{"id":275,"title":"Israel's 2008-2009 military operations against Gaza were justified"},{"id":276,"title":"There must be a single European Union army"},{"id":277,"title":"The West should invade Syria"},{"id":278,"title":"There can be such a thing as a Just War"},{"id":279,"title":"Terrorism can be justified"},{"id":280,"title":"There must be referendums held on any new EU treaty"},{"id":281,"title":"There is a need for developing tactical nuclear weapons"},{"id":282,"title":"Abolish nuclear weapons"},{"id":283,"title":"We can trust Republicans with the economy"},{"id":284,"title":"Britain should join the Euro currency"},{"id":285,"title":"We must enforce term limits on the legislative branch of government"},{"id":286,"title":"Voting should become compulsory"},{"id":287,"title":"Self-determination of peoples is a human right"},{"id":288,"title":"Federal States are better than unitary nations"},{"id":289,"title":"Create a UN standing army"},{"id":290,"title":"We should support enforcing term limits on the executive branch of government"},{"id":291,"title":"We should detain terror suspects without trial"},{"id":292,"title":"The world has to ignore North Korean provocations"},{"id":293,"title":"Allow voting at 16 in European Parliament elections"},{"id":294,"title":"Have no elections rather than sham elections"},{"id":295,"title":"US must help in fighting terrorist organisations in Africa"},{"id":296,"title":"The Western intervention in Libya has been a success"},{"id":297,"title":"Lesotho should be annexed by South Africa"},{"id":298,"title":"A move to the left is good for Labour"},{"id":299,"title":"Islamic State\/Daesh is the most significant threat to the west"},{"id":300,"title":"Death penalty is justified"},{"id":301,"title":"We must believe in the woman's right to choose"},{"id":302,"title":"It is sometimes right for the government to restrict freedom of speech"},{"id":303,"title":"It is a good idea to have a system of  participatory democracy"},{"id":304,"title":"People should have the right to die"},{"id":305,"title":"Allow donations of vital organs even at the expense of the donor's life"},{"id":306,"title":"Important decisions about children’s health should be made by medical professionals and not by their parents"},{"id":307,"title":"Kill One to Save Many"},{"id":308,"title":"Capital punishment should be abolished in Africa"},{"id":309,"title":"Neo-functionalism explains the integration of the European Union"},{"id":310,"title":"We must all believe in fundamental human rights"},{"id":311,"title":"Everyone should go vegetarian"},{"id":312,"title":"Governments should introduce a flat tax"},{"id":313,"title":"Suicide should be a criminal offence"},{"id":314,"title":"Remove Bush tax cuts for the wealthy"},{"id":315,"title":"Governments should unleash the free market"},{"id":316,"title":"Assisted suicide should be legalized"},{"id":317,"title":"Civil liberties should be sacrificed for the greater good"},{"id":318,"title":"The right to trial can be limited by jury in some criminal cases"},{"id":319,"title":"UK would have more influence outside the EU"},{"id":320,"title":"Leaving the EU would increase British security"},{"id":321,"title":"UK should have a second Brexit referendum before leaving the EU"},{"id":322,"title":"We must have weapons inspectors leave Syria"},{"id":323,"title":"African leaders should be transparent about their health"},{"id":324,"title":"Launching a military coup against a democratic government can be justified"},{"id":325,"title":"Russia has the right to send troops into Crimea"},{"id":326,"title":"Throw Russia out of the G8"},{"id":327,"title":"It is a good idea to lease Crimea to Russia"},{"id":328,"title":"The African Union can meet its pledge to end all war on the continent by 2020"},{"id":329,"title":"Ariel Sharon was not tried for war crimes by an international court"},{"id":330,"title":"Eritrea is responsible for its isolation"},{"id":331,"title":"The Mo Ibrahim prize encourages good governance"},{"id":332,"title":"The Egyptian army was right to depose Morsi"},{"id":333,"title":"Put taxes\/revenue from oil into a trust fund independent of politicians influence"},{"id":334,"title":"The prevalence of ‘African mercenaries’ is decreasing"},{"id":335,"title":"We must negotiate with terrorists"},{"id":336,"title":"Individuals who have committed atrocities in the Syrian Civil War should be investigated by the ICC"},{"id":337,"title":"European Parliament elections should involve only one voting district: all of Europe and not separate country seats"},{"id":338,"title":"The best way to protect Scottish interests in the EU is to vote for independence"},{"id":339,"title":"Turkey is not a democracy"},{"id":340,"title":"NATO has succeeded in Afghanistan"},{"id":341,"title":"France is right to intervene in Mali"},{"id":342,"title":"The world has to intervene in Syria to prevent, or respond to, the use of chemical weapons"},{"id":343,"title":"We must limit anonymous contributions from corporations and individuals to super PACs"},{"id":344,"title":"Governments should lower the voting age to 16"},{"id":345,"title":"We must have a criminal DNA database"},{"id":346,"title":"US must get rid of the double jeopardy rule"},{"id":347,"title":"We should legalize drugs"},{"id":348,"title":"Mandatory sentencing is fine."},{"id":349,"title":"Hold students legally responsible for bullying if it resulted in the victim's death"},{"id":350,"title":"Limit prison to violent offenders"},{"id":351,"title":"Fund needle exchanges"},{"id":352,"title":"Cede control of the Falkland (Malvinas) Islands to Argentina"},{"id":353,"title":"Criminal justice should focus more on rehabilitation"},{"id":354,"title":"Disclose previous convictions in court"},{"id":355,"title":"Treat the desecration and destruction of high-value sites and property of cultural heritage as a crime against humanity"},{"id":356,"title":"Military action to intervene during atrocities without United Nations Security Council approval can be legal"},{"id":357,"title":"Create an African Criminal Court"},{"id":358,"title":"Guinea-Bissau should not let itself be turned in to a front of the US’ \"war on drugs\""},{"id":359,"title":"Send Yanukovych to The Hague"},{"id":360,"title":"The ICC is not an effective deterrent"},{"id":361,"title":"The ICC is biased against Africa"},{"id":362,"title":"The Uhuru Kenyatta indictment was an unwelcome interference by the ICC"},{"id":363,"title":"Prosecutions help the healing process"},{"id":364,"title":"Post conflict peace cannot be sustained without impartial justice"},{"id":365,"title":"African states should withdraw from the ICC"},{"id":366,"title":"The death penalty for the worst of the worst"},{"id":367,"title":"Government should be required to obtain warrants to access data that can be used to track an individual"},{"id":368,"title":"Immunity for head of state is a good idea"},{"id":369,"title":"Criminal trials should not be televised, and the ICC is no exception"},{"id":370,"title":"The United States should ban assault weapons"},{"id":371,"title":"We should pull out of the Article 98 Agreements that prevent US soldiers from being sent to the ICC for trial"},{"id":372,"title":"The ICC should have its own enforcement arm"},{"id":373,"title":"The United States is responsible for Mexico’s drugs war"},{"id":374,"title":"Media reporting on violent crimes should be restricted"},{"id":375,"title":"Fines should be made relative to income"},{"id":376,"title":"Social disgust is legitimate grounds for restriction of artistic expression"},{"id":377,"title":"Social deprivation causes crime"},{"id":378,"title":"A legal qualification is worth the cost"},{"id":379,"title":"It is fine to do random drug-testing in schools"},{"id":380,"title":"The European Union should lift its ban on member states selling arms to China"},{"id":381,"title":"We should ban the depiction of smoking in films"},{"id":382,"title":"We should legalise the growing of coca leaf"},{"id":383,"title":"Beauty contests should be banned"},{"id":384,"title":"War criminals should be prosecuted"},{"id":385,"title":"The Schengen Agreement must be dissolved"},{"id":386,"title":"The US should have done more for Darfur"},{"id":387,"title":"The Guantanamo Bay detention centre should be closed"},{"id":388,"title":"Sadomasochism must be decriminalized"},{"id":389,"title":"That Israel’s West Bank Settlements are an Obstacle to Peace"},{"id":390,"title":"The ttibet should be an independent state"},{"id":391,"title":"We should believe in corporal punishment for adult offenders"},{"id":392,"title":"Attorney-client privilege should be abolished"},{"id":393,"title":"Arming the police is a good idea"},{"id":394,"title":"Place Cameras in Courtrooms to Televise Court Cases"},{"id":395,"title":"The United Nations has a responsibility to protect."},{"id":396,"title":"Sanctions should be used to promote democracy"},{"id":397,"title":"Abolish the security council veto"},{"id":398,"title":"Long term cooperation between Russia and the United States is possible."},{"id":399,"title":"NATO countries and the government of Afghanistan should negotiate a power-sharing deal with the Taliban"},{"id":400,"title":"The world should re-engage with Myanmar"},{"id":401,"title":"Obama was right to agree to meet rogue leaders without preconditions"},{"id":402,"title":"Europe should be federal"},{"id":403,"title":"We should end western states' control over the International Monetary Fund"},{"id":404,"title":"We should support the creation of a Free Trade Area of the Americas"},{"id":405,"title":"The Palestinian Statehood should be recognised by the United Nations General Assembly"},{"id":406,"title":"The integration of Africa through the African Union can succeed"},{"id":407,"title":"We should give cash to the poor to reduce poverty"},{"id":408,"title":"Take a visit the Yasukuni Shrine"},{"id":409,"title":"Dictatorship is the best path to development"},{"id":410,"title":"Build the Grand Inga Dam"},{"id":411,"title":"The African Union should create a standing army"},{"id":412,"title":"Ethiopia is right to build a dam on the River Nile"},{"id":413,"title":"Africa is really rising"},{"id":414,"title":"Create an international treaty\/ban on cyber-attacks"},{"id":415,"title":"The US and Israel should join the International Criminal Court"},{"id":416,"title":"The EU should abandon the Common Agricultural Policy"},{"id":417,"title":"All veto powers of individual EU member states must be lifted"},{"id":418,"title":"The European Union should be a trade bloc rather than a political union"},{"id":419,"title":"Stop sending development aid to India"},{"id":420,"title":"The world must arm the Syrian rebels"},{"id":421,"title":"News organisations should be free to exclude news of homosexuality where it causes offence to their viewers"},{"id":422,"title":"We must support the admission of Turkey to the EU"},{"id":423,"title":"The EU should engage in further enlargement"},{"id":424,"title":"Israel should return to its pre-1967 borders"},{"id":425,"title":"The world should intervene to prevent the collapse of the state in other countries"},{"id":426,"title":"The United Nations has failed"},{"id":427,"title":"Former colonial powers should pay reparations to former colonies"},{"id":428,"title":"We should expand NATO"},{"id":429,"title":"Europe still needs a constitution"},{"id":430,"title":"We believe in world government"},{"id":431,"title":"Jerusalem should be divided"},{"id":432,"title":"Offshoring is a good idea"},{"id":433,"title":"It is a good idea to build the Keystone XL pipeline"},{"id":434,"title":"We should drop the sanctions against Cuba."},{"id":435,"title":"Britain should give up its EU rebate"},{"id":436,"title":"Switzerland and Norway should apply to join the EU"},{"id":437,"title":"The European Union should adopt a single working language through which to operate."},{"id":438,"title":"The European Parliament should be the sovereign law-making body of Eurozone states"},{"id":439,"title":"In the conflict between Israel and Palestine, a two-state solution is better justified than a one-state solution"},{"id":440,"title":"You should always suspend directly delivered foreign development aid"},{"id":441,"title":"The United States is a ‘benign’ hegemon"},{"id":442,"title":"The United Nations budget must be frozen"},{"id":443,"title":"Grant the EU a permanent seat on the UN Security Council"},{"id":444,"title":"As the developed world, we must fund African climate adaptation"},{"id":445,"title":"Private sector involvement is necessary to improve healthcare in Africa"},{"id":446,"title":"We should provide access to microfinance for the ‘unbanked’"},{"id":447,"title":"The UN intervention in the Democratic Republic of Congo has been a success"},{"id":448,"title":"Men are the key to family planning in Uganda"},{"id":449,"title":"Governments must be encouraged to implement an ‘open sky’ agreement within Africa"},{"id":450,"title":"Ghana’s ban on smoking in public places is a model for Africa"},{"id":451,"title":"The outcome of the Paris Climate Conference needs to be an international treaty with binding emission cuts"},{"id":452,"title":"Deny Organs to Non-Donors"},{"id":453,"title":"Promote safe sex through education at schools"},{"id":454,"title":"Require the provision of cannabis in any state funded medical program"},{"id":455,"title":"Labels on food must be mandated to encourage people to eat better"},{"id":456,"title":"Introduce a “fat tax”"},{"id":457,"title":"Provide breakfast for all school students"},{"id":458,"title":"Airbrushing of women’s bodies in the media be banned"},{"id":459,"title":"New York City has the right to regulate the size of sodas bought on the market"},{"id":460,"title":"We must ban the promotion of diets"},{"id":461,"title":"Alternative medicine poses a threat to public health"},{"id":462,"title":"There mut be a system of universal healthcare"},{"id":463,"title":"Ban the use of trans fats in food stuffs"},{"id":464,"title":"Allow pharmaceutical companies to advertise directly to consumers"},{"id":465,"title":"Employees Should Be Compelled To Disclose Their HIV Status to Employers"},{"id":466,"title":"Multiple Vaccines Safe"},{"id":467,"title":"Ban alcohol"},{"id":468,"title":"Lmplement A Fat Tax"},{"id":469,"title":"Ban junk food from schools"},{"id":470,"title":"A ‘wall’ on the shared USA and Mexico border would be ineffective"},{"id":471,"title":"African nations should ban the sale of skin whitening creams, and similar products"},{"id":472,"title":"Women are the key to Africa’s economic future"},{"id":473,"title":"Cape Verde’s regional future lies with Europe, not Africa"},{"id":474,"title":"The Seychelles should buy territory and relocate due to climate change"},{"id":475,"title":"Limited press and speech freedom will hinder progress in Rwanda"},{"id":476,"title":"Sao Tome would drop relations with Taiwan in favour of Mainland China"},{"id":477,"title":"Widen the East African Community"},{"id":478,"title":"Spain should cede Ceuta and Melilla to Morocco"},{"id":479,"title":"Implent the Virtual Doctor Project in Zambia"},{"id":480,"title":"Tunisia should not rely on tourism for economic growth"},{"id":481,"title":"The Chagos Islands must be returned to Mauritius"},{"id":482,"title":"The lack of investment in teachers is the greatest barrier to achieving universal primary education"},{"id":483,"title":"Nollywood could be an effective instrument to change perceptions of Africa"},{"id":484,"title":"African governments must implement tougher protections for animals"},{"id":485,"title":"Africans are worse off due to natural resources"},{"id":486,"title":"African borders must be redefined to reflect ethnic groups"},{"id":487,"title":"A permanent UNSC seat with veto power must be reserved to an African country"},{"id":488,"title":"Legalize sex work in order to make controls more feasible and effective to combat HIV\/AIDS"},{"id":489,"title":"Julian Assange is a journalist"},{"id":490,"title":"Freedom of expression is more important than religious sensitivities"},{"id":491,"title":"A nation's history and mythology is part of its national security"},{"id":492,"title":"The expenditure of money should be protected as speech"},{"id":493,"title":"Store nuclear waste underground"},{"id":494,"title":"A cap-and-trade system is preferable to a carbon tax in reducing carbon emissions"},{"id":495,"title":"The EU should abandon nuclear energy"},{"id":496,"title":"Adaptation should be the most urgent response to Climate Change"},{"id":497,"title":"School uniforms must be banned"},{"id":498,"title":"The payment of welfare benefits to parents should be tied to their children's school attendance records"},{"id":499,"title":"Vaccination must be made compulsory"},{"id":500,"title":"Introduce year round schooling"},{"id":501,"title":"Abolish standardized tests for University Admission"},{"id":502,"title":"Degrees in the creative arts are luxuries society can no longer afford"},{"id":503,"title":"Raise the school leaving age to 18"},{"id":504,"title":"Encourage fewer people to go to university"},{"id":506,"title":"Homework is a waste of time"},{"id":507,"title":"Poetry should not be taught in schools"},{"id":508,"title":"Provision of higher education must be funded by taxing graduates"},{"id":509,"title":"Fund education using a voucher scheme"},{"id":510,"title":"Parents should be held responsible for their school-going children's discipline problems"},{"id":511,"title":"Make lessons in a foreign language compulsory for school pupils"},{"id":512,"title":"People should have a right to private education"},{"id":513,"title":"Raise The School Leaving Age To 18"},{"id":514,"title":"Make sex education mandatory in schools"},{"id":515,"title":"Ban homework"},{"id":516,"title":"Build a third Heathrow runway to maintain its position as a hub airport"},{"id":517,"title":"Ban the slaughter of animals which have not been stunned first"},{"id":518,"title":"Cease the exploitation of the Arctic Region"},{"id":519,"title":"Ban the use of animals as objects of sport and entertainment"},{"id":520,"title":"Build hydroelectric dams"},{"id":521,"title":"Wind power should be a primary focus of future energy supply."},{"id":522,"title":"Store nuclear waste underground"},{"id":523,"title":"Invest in Renewable Technologies rather than Nuclear Power"},{"id":524,"title":"Endangered species should be protected"},{"id":525,"title":"Community radio is good for democracy"},{"id":526,"title":"‘The Spear’ should have remained on public display."},{"id":527,"title":"Tennessee is correct to protect teachers who wish to explore the merits of creationism"},{"id":528,"title":"Allow biased versions of history to be taught in schools"},{"id":529,"title":"Show the darker side of the formation of the nation"},{"id":530,"title":"Rumours about politicians should not be reported"},{"id":531,"title":"The imprisoned members of Pussy Riot should be considered political prisoners"},{"id":532,"title":"Limit the free speech rights of corporations that are granted legal personhood"},{"id":533,"title":"Western universities should only place satellites in states that respect free speech"},{"id":534,"title":"The decision of the state of Bavaria to publish Mein Kampf"},{"id":535,"title":"Protect braille out of respect for free speech"},{"id":536,"title":"Penalise religious hate speech"},{"id":537,"title":"Allow celebrities to switch off the limelight"},{"id":538,"title":"Defending the enemies of one's nation is legitimate free speech"},{"id":539,"title":"We believe in the right to reply"},{"id":540,"title":"Blasphemy has no place on the statute books"},{"id":541,"title":"Christians should be allowed to wear the Cross at work"},{"id":542,"title":"University education should be free"},{"id":543,"title":"Prohibit retailers from selling certain items at a loss as a marketing device."},{"id":544,"title":"Pay state school teachers based on merit"},{"id":545,"title":"Prioritize eliminating the budget deficit over increasing domestic spending"},{"id":546,"title":"Institute a mandatory retirement age"},{"id":547,"title":"Abolish collective bargaining rights for unions"},{"id":548,"title":"Replace aid with remittances"},{"id":549,"title":"EU member states should guarantee people under 25 a temporary workplace when they have been unemployed for six months"},{"id":550,"title":"The UK would be better off economically outside the European Union"},{"id":551,"title":"Make the raising of business and labour standards a prerequisite for developmental aid"},{"id":552,"title":"We should encourage building the Hyperloop"},{"id":553,"title":"Subsidize poor communities"},{"id":554,"title":"Any society must have a national minimum wage"},{"id":555,"title":"Pass the American Jobs Act"},{"id":556,"title":"Create a National High Speed Rail System in the U.S."},{"id":557,"title":"Act to regulate the activities of Sovereign Wealth Funds"},{"id":558,"title":"There must be a progressive tax rate"},{"id":559,"title":"Allow retailers to import for resale \"grey\" goods from abroad."},{"id":560,"title":"We should make education compulsory to degree level"},{"id":561,"title":"Compensation should be paid for those who have had their culture appropriated"},{"id":562,"title":"Violent Video Games Contribute to Youth Violence"},{"id":563,"title":"Golf is a Sport"},{"id":564,"title":"The United States should continue Its use of drone strikes abroad"},{"id":565,"title":"Abortion should be legal"},{"id":566,"title":"Any vaccines should be required for children"},{"id":567,"title":"Social Security should be privatized "},{"id":568,"title":"Gay marriage should be legal"},{"id":569,"title":"The D.A.R.E. program is good for America's kids (K-12) "},{"id":570,"title":"It is appropriate to build a muslim community center (aka the ''Ground Zero Mosque'') near the World Trade Center site "},{"id":571,"title":"Teachers should get tenure"},{"id":572,"title":"Prescription drugs should be advertised directly to consumers"},{"id":573,"title":"Ronald Reagan was a good president"},{"id":574,"title":"All Americans should have the right (be entitled) to health care"},{"id":575,"title":"Obesity is a disease"},{"id":576,"title":"The federal minimum wage should be increased"},{"id":577,"title":"Lowering the federal corporate income tax rate does create jobs"},{"id":578,"title":" College education is worth it"},{"id":579,"title":"Animals should be used for scientific or commercial testing"},{"id":580,"title":"Adults should have the right to carry a concealed handgun"},{"id":581,"title":"People should become vegetarian"},{"id":582,"title":"Churches should (defined as churches, temples, mosques, synagogues, etc.) remain tax-exempt"},{"id":583,"title":"The use of standardized tests is improving education in America"},{"id":584,"title":"Tablets should replace textbooks in K-12 schools"},{"id":585,"title":"Social networking sites are good for our society"},{"id":586,"title":"Students should have to wear school uniforms"},{"id":587,"title":"Recreational marijuana should be legal"},{"id":588,"title":"Bill Clinton was a good president"},{"id":589,"title":"More gun control laws should be enacted"},{"id":590,"title":"The United States return to a gold standard"},{"id":591,"title":"The drinking age should be lowered from 21 to a younger age"},{"id":592,"title":"College football should replace the bowl championship series (BCS)"},{"id":593,"title":"The United States should maintain its embargo against Cuba"},{"id":594,"title":"Human activity is primarily responsible for global climate change"},{"id":595,"title":"Cell phone radiation is safe"},{"id":596,"title":"We should support universal basic income"},{"id":597,"title":"Student loan debt should be easier to discharge in bankruptcy"},{"id":598,"title":"School vouchers should be encouraged"},{"id":599,"title":"The penny should stay in circulation"},{"id":600,"title":"Net neutrality should be restored"},{"id":601,"title":"Homework is beneficial"},{"id":602,"title":"Bottled water should be banned"},{"id":603,"title":"Sanctuary cities are beneficial"},{"id":604,"title":"Police body cameras should be allowed"},{"id":605,"title":"Hosting the Olympic Games is beneficial"},{"id":606,"title":"Refusing to stand for the National Anthem is an appropriate form of protest."},{"id":607,"title":"Fighting should be allowed in hockey."},{"id":608,"title":"The United States should use the electoral college in presidential elections."},{"id":609,"title":"The United States should keep daylight saving time."},{"id":610,"title":"Corporal punishment be used in K-12 schools."},{"id":611,"title":"Parents or other adults should be able to ban books from schools and libraries."},{"id":612,"title":"There Should be a Minimum Weight Limit For Professional Models"},{"id":613,"title":"Commercialization of Festivals and Holidays Has Eroded Their Real Significance"},{"id":614,"title":"The money we spend on our Olympic medal count is money well spent"},{"id":615,"title":"Google is the extremely reliable source of information"},{"id":616,"title":"Companies should provide alternative interview methods"},{"id":617,"title":"Use and Misuse of Internet"},{"id":618,"title":"The balance of power in Europe in the eighteenth century was destroying itself"},{"id":619,"title":"Women should be allowed on the front line"},{"id":620,"title":"Genetics is a defence to murder"},{"id":621,"title":"A government has the obligation to lessen the economic gap between its rich and poor citizens"},{"id":622,"title":"Hillary Clinton would make a better president for America"},{"id":623,"title":"Public Transport Should Be Free"},{"id":624,"title":"The health benefits of genetically modified foods outweigh their risks"},{"id":625,"title":"Affirmative Action in South Africa does more harm than good"},{"id":626,"title":"1-child policy for every single country in the world!"},{"id":627,"title":"It is morally permissible for victims to use deadly force as a deliberate response to repeated domestic violence"},{"id":628,"title":"We should build new nuclear power plants"},{"id":629,"title":"All patents should be removed on anti-retroviral drugs to fight AIDS"},{"id":630,"title":"University education needs to be capped and more selective"},{"id":631,"title":"Civil Disobedience Can Be Justified"},{"id":632,"title":"The Falklands should be given back to Argentina"},{"id":633,"title":"States ought not possess nuclear weapons"},{"id":634,"title":"The voting age should be lowered to 16"},{"id":635,"title":"Should Turkey Be Accepted In The EU"},{"id":636,"title":"Persistent Bullies Should be Expelled"},{"id":637,"title":"Strict parenting works best"},{"id":638,"title":"Should the Cell Phones Be Allowed in Schools"},{"id":639,"title":"The Prohibition of drugs doesn’t work"},{"id":640,"title":"Examinations are a fair way of testing our knowledge"},{"id":641,"title":"School Uniforms Should Be Mandatory"},{"id":642,"title":"People should lose their jobs for saying the wrong thing"},{"id":643,"title":"Wikileaks is not and has never been a non-profit organization"},{"id":644,"title":"Baby ear piercing should be banned"},{"id":645,"title":"Japan needs US military bases"},{"id":647,"title":"We should be investing in public transport"},{"id":648,"title":"Power only has two dimensions"},{"id":649,"title":"Same sex relationships should have the same legal status as heterosexual relationships under EU law"},{"id":650,"title":"The Spread of Nuclear Weapons: More may be better"},{"id":651,"title":"We should abolish speed cameras"},{"id":652,"title":"16 year olds should be able to vote at presidental elections"},{"id":653,"title":"Mossad should carry out extrajudicial killings"},{"id":655,"title":"Google knows too much about us"},{"id":656,"title":"Positive Discrimination Towards Women in Society Is Justified"},{"id":657,"title":"Gorbachev Was Responsible for The Collapse Of The USSR"},{"id":658,"title":"Hacking Can Be Justified"},{"id":659,"title":"Less time outdoors is severely detrimental to the physical and emotional wellbeing of children"},{"id":660,"title":"China should be allowed more control over its own seas"},{"id":661,"title":"The breeding of white tigers in captivity should be banned"},{"id":662,"title":"Children should be allowed to have facebook accounts"},{"id":663,"title":"Animals should be kept in zoos"},{"id":664,"title":"Military recruiting in schools"},{"id":665,"title":"International students are charged unfairly high tuition fees at UK universities"},{"id":666,"title":"Science can determine human values"},{"id":667,"title":"All evidence gathered by intelligence agencies should be admissible in courts of law"},{"id":668,"title":"Historical Artefacts Should Be Repatriated to Their Country of Origin"},{"id":669,"title":"Music should be free for all"},{"id":670,"title":"The teaching of Shakespeare should be compulsory"},{"id":672,"title":"Books should have content warnings"},{"id":673,"title":"Mexican culture was incurably damaged by the introduction of Christianity"},{"id":674,"title":"The Death Penalty Should Be Imposed For Acts Of Terror That Cause Death"},{"id":675,"title":"Housewives Are More Responsible Mothers Than Working Women"},{"id":676,"title":"Public high school students in the United States ought not be required to pass standardized exit exams to graduate"},{"id":677,"title":"Prescription drugs are overpriced"},{"id":678,"title":"Terrorists should be subject to the Geneva Conventions"},{"id":679,"title":"Mixed Martial Arts (UFC) is a form of human cockfighting"},{"id":680,"title":"Socialism is a failed government subdomain"},{"id":682,"title":"Inheritance tax should be raised to 100% for everyone born in the UK"},{"id":683,"title":"British atrocities: The Blood Never Dried"},{"id":684,"title":"America should have universal healthcare"},{"id":685,"title":"Reality TV has gone too far"},{"id":686,"title":"Parents should have the right to do background checks on those looking after their children"},{"id":687,"title":"Unilateral nuclear disarmament is the best way to create a safer world"},{"id":688,"title":"Any job is better than no job"},{"id":689,"title":"The world should go vegan"},{"id":690,"title":"Capitalism is creating an expanding gap between the rich and the poor"},{"id":691,"title":"Maths should be a compulsory subject at GCSE"},{"id":692,"title":"There should be video replays for refs in football"},{"id":693,"title":"Aid is killing Africa"},{"id":694,"title":"It is time to stop buying bottled water"},{"id":695,"title":"Money Is the Root of All Evil"},{"id":696,"title":"The civil procedure rules allow for a ‘fair trial’"},{"id":697,"title":"Illegal downloaders should be cut off from the internet"},{"id":698,"title":"A celebrity would make a good minister"},{"id":699,"title":"Children should be banned from watching shows that contain violence and other adult contents"},{"id":700,"title":"Voting should be compulsory in the UK"},{"id":701,"title":"The Catholic Church needs reform"},{"id":702,"title":"Books vs TV. TV wins."},{"id":703,"title":"Cheap Flights Do more Harm Than Good"},{"id":704,"title":"Accessing your spouse’s email account hacking"},{"id":705,"title":"Animals have a right to privacy"},{"id":706,"title":"People who plea guilty early should receive more lenient sentences"},{"id":707,"title":"Man made climate change is a myth"},{"id":708,"title":"Swearing should be illegal"},{"id":709,"title":"Everyone Should Automatically Be Opted into an Organ Donation Scheme"},{"id":710,"title":"Sports initiations should be banned"},{"id":711,"title":"Britain should scrap the monarchy"},{"id":712,"title":"Improving access to contraception will lower the number of teenage pregnancies"},{"id":713,"title":"Too much importance is placed upon correct spelling and grammar"},{"id":714,"title":"Liberal democracies are better at providing people’s needs than non-democracies."},{"id":715,"title":"Does Mother Nature rule the world"},{"id":716,"title":"We should ban the church of scientology"},{"id":717,"title":"The US and its allies were justified in taking military action against Iraq following Iraq’s invasion of Kuwait"},{"id":718,"title":"This House Would Arrest Batman"},{"id":719,"title":"G20 protests – at best a waste of time, at worst a dangerous disruption"},{"id":720,"title":"It is selfish to have more than two children"},{"id":721,"title":"Only buildings that are historically important should be preserved"},{"id":722,"title":"Tuition Fees Should Be Increased"},{"id":724,"title":"The EU should return power to national governments"},{"id":725,"title":"The United States was correct in going to war against North Korea in support of their territory of South Korea."},{"id":726,"title":"Discipline In Schools Needs To Be Improved"},{"id":728,"title":"The United States’ role in the Vietnam War was an unnecessary step in the fight against communism."},{"id":729,"title":"Children should be seen and not heard"},{"id":730,"title":"Rail travel is the best mode of transport for the future"},{"id":731,"title":"The national curriculum should be scrapped"},{"id":732,"title":"Should The Burning Of Holy Books Be Banned"},{"id":733,"title":"Wind farms are a good solution to the energy crisis"},{"id":734,"title":"All our actions are determined in some way"},{"id":735,"title":"It should be compulsory for all mothers to breastfeed for the first six months of their babies lives"},{"id":736,"title":"The grammar school system should be reintroduced in the UK"},{"id":737,"title":"Slang prevent young people from being able to communicate properly"},{"id":738,"title":"The EU should significantly reduce the amount it spends on agricultural production subsidies"},{"id":739,"title":"Sikh school pupils should be allowed to carry ceremonial daggers"},{"id":740,"title":"Joe Calzaghe deserves to be recognized as one of the greatest boxers of all time"},{"id":741,"title":"PHILOSOPHY – Utilitarianism isn’t as fair as it initially seems"},{"id":742,"title":"“Specialists are overrated and too ubiquitous presently; we need more generalists”"},{"id":743,"title":"National service should be re-introduced"},{"id":744,"title":"The glass ceiling still exists"},{"id":745,"title":"Religion is not necessary"},{"id":746,"title":"Parents of obese children be prosecuted with neglect"},{"id":747,"title":"Romeo and Juliet do promote knife crime"},{"id":748,"title":"The use of mobile phones has lowered active social life and has become an addiction"},{"id":749,"title":"Winning the Champions League Is Better Than Winning the Premier League"},{"id":750,"title":"Books will be replaced at some point"},{"id":751,"title":"Parents should not allow young people to live at home again after graduating"},{"id":752,"title":"A Ban on Shark Fin Soup Is Necessary to Protect the Shark from Extinction"},{"id":753,"title":"We should show more compassion to drug addicts"},{"id":754,"title":"Working from home is better for companies than maintaining an office"},{"id":755,"title":"Celebrities who commit drug-related offences should be punished more harshly than non-celebrities."},{"id":756,"title":"Global Warming is not an issue"},{"id":757,"title":"Personality is more important than ability"},{"id":758,"title":"World War III is inevitable"},{"id":759,"title":"Football does unify us"},{"id":760,"title":"Adding artificial happy endings to a story completely ruins it"},{"id":761,"title":"Atheist countries are more benevolent"},{"id":762,"title":"We should ban the muslim veil"},{"id":763,"title":"Most people are a little bit gay"},{"id":764,"title":"Universities should support graduates in getting a job"},{"id":766,"title":"People should be allowed to sell their own organs"},{"id":767,"title":"The People’s Republic of China should invade North Korea"},{"id":768,"title":"Increased taxes are good for America"},{"id":769,"title":"Healthy eating should be made mandatory"},{"id":770,"title":"Game strategies: Cooperation vs Competition"},{"id":771,"title":"High taxes are necessary for an effective state"},{"id":772,"title":"Corporations are a threat to Democracy and society."},{"id":773,"title":"Make-up is bad for us"},{"id":774,"title":"We should be trying to avoid contact with aliens."},{"id":775,"title":"The welfare system should be replaced with a negative income-tax model"},{"id":776,"title":"We should give money to beggars"},{"id":777,"title":"Sunbeds should be banned"},{"id":778,"title":"Governments Should Put Wealth Redistribution Ahead Of Wealth Creation"},{"id":779,"title":"physical fitness is better than mental fitness"},{"id":780,"title":"Speed limits should be reduced"},{"id":781,"title":"It is wrong to tolerate unjust laws"},{"id":782,"title":"Representative Democracy Is a Better Form of Government Than Direct Democracy"},{"id":783,"title":"Hosting the world cup is beneficial"},{"id":784,"title":"Those affected by climate change should get compensation"},{"id":785,"title":"Neil Armstrong did actually walk on the Moon"},{"id":786,"title":"Music That Glorifies Crime Should Be Banned"},{"id":787,"title":"The UK is truly a democracy"},{"id":788,"title":"Taking food thrown out by supermarkets should not be illegal"},{"id":789,"title":"Forced marriage should be banned"},{"id":790,"title":"Anti-social behaviour orders are effective"},{"id":791,"title":"The media’s selective coverage of certain issues works to worsen problems in society and create problems"},{"id":792,"title":"Teachers Should Have The Right To Punish Pupils Physically If The Parents Consent"},{"id":793,"title":"Female Children Are More Useful at Home"},{"id":794,"title":"Sports Have Became More About Making Money Than Playing Well"},{"id":795,"title":"Junk Food Should Be Banned"},{"id":796,"title":"Lack of Parental Guidance Is Mainly Responsible for Children Being Violent and Aggressive in School"},{"id":797,"title":"Fast Food Advertising Should Be Banned"},{"id":798,"title":"Using Rewards to Motivate Students"},{"id":799,"title":"Religious education Should be a part of the School curriculum"},{"id":800,"title":"There shouldn’t be an option to dropout of highschool"},{"id":801,"title":"Reality TV shows are an important part of popular culture today."},{"id":802,"title":"Developed Countries Should Accept More Refugees"},{"id":803,"title":"There is a world Water crisis"},{"id":804,"title":"Competition in the long run is healthy rather than harmful for the community: GRE issue"},{"id":806,"title":"Wikileaks is a threat to national security"},{"id":807,"title":"The iPhone is better than the Blackberry"},{"id":808,"title":"Television is one of the most effective mediums through which to teach and inspire youngsters"},{"id":809,"title":"DNA testing is worth the money"},{"id":810,"title":"Social Media should be part of the curriculum"},{"id":811,"title":"Individuals have a moral obligation to assist people in need"},{"id":812,"title":"Chocolate is good for you"},{"id":813,"title":"Britain should become a republic"},{"id":814,"title":"People should be allowed to do what they want to their own bodies"},{"id":815,"title":"We should still be concerned about the ozone layer"},{"id":816,"title":"We have lost the true meaning of Christmas"},{"id":817,"title":"Electronic tags are a good idea"},{"id":818,"title":"The law on self defence should cover ‘grossly disproportionate’ actions"},{"id":819,"title":"Gender equality will not happen anytime soon"},{"id":820,"title":"Use of goal line technology in football is overdue, and can only lead to benefits."},{"id":821,"title":"German unification has been a success"},{"id":822,"title":"Reheat tea in the microwave"},{"id":823,"title":"The UN should impose sanctions on countries that destroy their rainforests"},{"id":824,"title":"Children should be taught politics at school"},{"id":825,"title":"All countries should have the right to pursue a nuclear defence"},{"id":826,"title":"Stop the Olympic Games"},{"id":827,"title":"ID cards and the National Identity Register should be scrapped"},{"id":828,"title":"Governments Should Try To Reduce The Gap Between Their Richest And Poorest Citizens"},{"id":829,"title":"Governments Should Actively Promote Multiculturalism"},{"id":830,"title":"University Fees Should Be Scrapped"},{"id":831,"title":"The Private Education System Should Be Abolished"},{"id":832,"title":"The United States is justified in using private military firms abroad to pursue its military objectives"},{"id":833,"title":"Eliminate All Nuclear Weapons"},{"id":834,"title":"Constitutions Should Not Give Special Recognition To Minority Groups"},{"id":835,"title":"Co2 Does Not Cause Global Warming"},{"id":836,"title":"The Minimum Driving Age Should Be Raised to 18"},{"id":837,"title":"Cars Should Be Banned From City Centres"},{"id":838,"title":"Prostitution should be legalised to protect sex workers from HIV\/AIDS"},{"id":839,"title":"Governments Should Pay Compensation For Terrorist Atrocities Carried Out By Their Citizens"},{"id":840,"title":"The ‘war on terror’ is winnable"},{"id":841,"title":"Violent video games cause violent crime"},{"id":842,"title":"Prostitution Should Be Legal"},{"id":843,"title":"There should be no permanent members of the UN Security Council"},{"id":844,"title":"Physical Chastisement of Children Should Be Illegal"},{"id":845,"title":"The human genome should be patented"},{"id":846,"title":"Britain should adopt Sharia law"},{"id":847,"title":"Smoking should be banned in public places"},{"id":848,"title":"The USA Legal Drinking Age Should Be Lowered to 18 From 21"},{"id":849,"title":"There Should be an English Parliament"},{"id":850,"title":"Christianity is the greatest deception of today"},{"id":851,"title":"Resources have a negative influence on foreign policy in the Middle East"},{"id":852,"title":"Governments should ban the media from reporting hostage-taking"},{"id":853,"title":"Terrorism should not be allowed publicity"},{"id":854,"title":"Physical Education In Schools Should Be Compulsory"},{"id":855,"title":"Plastic Bags should be banned"},{"id":856,"title":"Basic income tax should be abolished"},{"id":857,"title":"The UK Should Leave the European Union"},{"id":858,"title":"Remotely Controlled Weapons Systems Should Not Be Used In Combat"},{"id":859,"title":"Smoking should be made Illegal"},{"id":860,"title":"Creationism should be discussed in school science lessons"},{"id":861,"title":"Religion In Itself Is A Purely Positive Force In The World"},{"id":862,"title":"Free press is vital in democracy"},{"id":863,"title":"All third world debt should be dropped"},{"id":864,"title":"HIV\/AIDS: There Should Be Compulsory Testing and Labeling of People with HIV"},{"id":865,"title":"India should give up Kashmir"},{"id":867,"title":"People on job seekers allowance who refuse a job should lose their benefits"},{"id":868,"title":"Democracy Is the Best Form of Government"},{"id":869,"title":"Children Should Have The Right To Vote In Elections"},{"id":870,"title":"CCTV is a threat to freedom"},{"id":871,"title":"Boys should go to boys only schools"},{"id":872,"title":"Parents should introduce children to alcohol (in moderation) at an early age"},{"id":873,"title":"We Should Question Authorities"},{"id":874,"title":"Space should not be used for military purposes"},{"id":875,"title":"Ten Commandments:  Display in Schools"},{"id":876,"title":"Visitors to museums should be “encouraged” to pay a voluntary entrance fee"},{"id":877,"title":"Causing Religious Offence Should Be A Civil Offence"},{"id":878,"title":"Newspapers Are a Thing of the Past"},{"id":879,"title":"Governments should spend their way out of the recession"},{"id":880,"title":"Christmas is a scam"},{"id":881,"title":"Russia is a land of democracy (not autocracy)"},{"id":882,"title":"Money undermines sport’s values"},{"id":884,"title":"Rain Man is such a bad image of autism"},{"id":885,"title":"Post Office Should Be Privatized"},{"id":886,"title":"Taxes on smoothies and fruit juices should be reduced"},{"id":887,"title":"Schizophrenia is caused by environmental not genetic factors"},{"id":888,"title":"We should make new years resolutions"},{"id":889,"title":"Prisoners Should Have The Right To Vote"},{"id":890,"title":"Online education does more good than harm"},{"id":891,"title":"Police Service Should Be Armed (UK)"},{"id":892,"title":"the teacher is always right, even when s\/he is not."},{"id":893,"title":"Experience is the key success for entrepreneurship."},{"id":894,"title":"Mind Sports Such as Chess, Quizzing and Debating Should Be Olympic Sports"},{"id":895,"title":"Obama did any of the things he promised"},{"id":896,"title":"Summer Holidays Should Be Shortened"},{"id":897,"title":"Children should not be allowed to inherit vast wealth as this damages them and society"},{"id":898,"title":"The UK should undergo radical constitutional reform"},{"id":899,"title":"Privacy and Freedom Is More Important Than Security"},{"id":900,"title":"Valentines Day is just a Hallmark ploy"},{"id":901,"title":"Catcher in the Rye is a bad book"},{"id":902,"title":"The Illegality Of Recreational Drugs Does More Harm Than Good"},{"id":903,"title":"We Should Be Concerned About Population Growth"},{"id":904,"title":"The threat of Climate Change is exaggerated"},{"id":905,"title":"The EU does have a future"},{"id":906,"title":"Technological advancement promotes materialistic society"},{"id":907,"title":"Barbie Dolls are affecting the mental image we create for ourselves"},{"id":908,"title":"Governments of resource-rich nations should impose high taxes on mining and extraction"},{"id":909,"title":"Scotland should cede from the union."},{"id":910,"title":"Euthanasia or mercy killing is justified"},{"id":911,"title":"Patents on life-saving drugs should be bypassed"},{"id":912,"title":"Deregulation and tax cuts should be embraced to lead the world out of economic crisis."},{"id":913,"title":"Anti-Bribery Laws On Corporations Should Be Abolished"},{"id":914,"title":"All taxes on inherited wealth should be abolished"},{"id":915,"title":"There is life on other planets"},{"id":916,"title":"Unemployment benefit should be paid in the form of vouchers for food, shelter and the basics of life"},{"id":917,"title":"Prisoners Should Be Used For Medical Experiments Without Consent"},{"id":918,"title":"The Police Should Use Racial Profiling To Tackle The Problems Of Illegal Immigration."},{"id":919,"title":"The UN Human Rights Council should be abolished"},{"id":920,"title":"Financial Assistance for the Poor Should Be the Responsibility of Charities, Not Government"},{"id":921,"title":"Animal testing for medical research"},{"id":922,"title":"Macs are better than PCs"},{"id":923,"title":"Minors Should Be Able to Obtain Abortions Without Parental Consent"},{"id":924,"title":"We should dramatically increase the rate of income tax paid by the rich"},{"id":925,"title":"The EU should impose a special Europe-wide tax on meat consumption to help save the planet"},{"id":926,"title":"The agreement between Russia and Great Britain in 1907 was inevitable"},{"id":927,"title":"Homework should have a limit"},{"id":928,"title":"Martin Luther King’s dream ha come true"},{"id":929,"title":"We should be free to express our religion as we wish"},{"id":930,"title":"Climate Change is the end of the world"},{"id":931,"title":"Aid Should Be Tied To Human Rights"},{"id":932,"title":"In a democracy all votes should be equal."},{"id":933,"title":"History as a subject in school is needed"},{"id":934,"title":"The internet’s anonymity is beneficial"},{"id":935,"title":"It is good to gossip"},{"id":936,"title":"There is life after death"},{"id":937,"title":"Painting represents mankind better than Photography"},{"id":938,"title":"Obese people, in countries with a national health service, should face higher taxes"},{"id":939,"title":"Cramming before exams is a bad idea"},{"id":940,"title":"The media portrays youths in a negative way"},{"id":941,"title":"Romeo and Juliet is unsuccessful as a tragedy"},{"id":942,"title":"Children should do part time and summer work"},{"id":943,"title":"School Day Should Be Extended"},{"id":944,"title":"punishment should fit the criminal"},{"id":945,"title":"Privacy Online is Important"},{"id":946,"title":"There is such thing as a glorious defeat"},{"id":947,"title":"Teachers should get merit pay"},{"id":948,"title":"social networking sites should be banned at the workplaces"},{"id":950,"title":"The Civil War was justified for the north to fight"},{"id":951,"title":"Polls are accurate predictors of election results"},{"id":952,"title":"Online Shopping Is Better Than Offline Shopping"},{"id":953,"title":"Genetic Engineering in Humans is Bad"},{"id":954,"title":"Lady Macbeth is the real driving force behind King Duncan’s murder in Shakespeare’s Macbeth"},{"id":955,"title":"Gorbachev was a key player in the fall of the Berlin Wall"},{"id":956,"title":"Gender Equality is Treating Men and Women in the Same Way"},{"id":957,"title":"Paparazzi and press intrude too much into celebrities lives"},{"id":958,"title":"Language does control thought"},{"id":959,"title":"There Is a Mathematical Miracle in the Quran That Proves It Is the Word of God"},{"id":960,"title":"Space Exploration Is a Waste of Money"},{"id":961,"title":"Oil Companies Should Not Be Allowed To Drill Offshore"},{"id":962,"title":"Antarctica Should Be Opened Up For Resource Exploitation"},{"id":963,"title":"Humans should eat meat"},{"id":964,"title":"Workers in the Transport Sectors Should Be Banned From Going On Strike"},{"id":965,"title":"Polygamous Marriage Should Be Recognised"},{"id":966,"title":"Music that glorifies violence against women should be banned"},{"id":967,"title":"Foreign workers should be given the right to vote in local elections where they work"},{"id":968,"title":"In Parliamentary Democracies, A Change Of Prime Minister Should Automatically Trigger A General Election."},{"id":969,"title":"An international ban should be placed on the export of nuclear reactor technology"},{"id":970,"title":"Adolf Hitler Does Not Deserve His Reputation as Evil"},{"id":971,"title":"The US should immediately close Guantanamo Bay."},{"id":972,"title":"Water Should Be Owned And Supplied By The State"},{"id":973,"title":"Individuals should be able to legally bypass copyright protection technologies for fair use reasons."},{"id":974,"title":"Pensions should be privatised"},{"id":975,"title":"A Doping Cheat’s Entire Olympic Team Should Be Stripped Of Their Medals"},{"id":976,"title":"Corporal Punishment Should Be Reintroduced"},{"id":978,"title":"Co-Educational Schools Should Be Supported"},{"id":979,"title":"The UN should be reformed or replaced"},{"id":980,"title":"The environment is being sacrificed for the economy"},{"id":981,"title":"The government should provide more money to fund science"},{"id":982,"title":"New prisons need to be built to ease overcrowding"},{"id":983,"title":"It does matter where you go to university or college"},{"id":984,"title":"Schools are doing enough to prevent illegal drug abuse by teenagers"},{"id":985,"title":"Job applicants should have to disclose their spent criminal convictions"},{"id":986,"title":"Deregulation is good for society"},{"id":988,"title":"Roger Federer Is Not the Greatest Tennis Player of All Time"},{"id":989,"title":"Home Schooling Should Be Banned"},{"id":990,"title":"Interest rates on personal lending should be capped by law at 20%"},{"id":991,"title":"Democracies should ban the display of communist and Nazi symbols"},{"id":992,"title":"We should prize freedom over security and abolish anti-terrorism legislation"},{"id":993,"title":"All drugs should be decriminalised"},{"id":994,"title":"Poorer Countries Should Abandon Free Trade Agreements"},{"id":995,"title":"Heavy drinkers should be denied liver transplants"},{"id":996,"title":"There is a good case for stating that there is a God"},{"id":997,"title":"Pre-nuptial agreements should not be recognised in divorce courts"},{"id":998,"title":"Same-Sex Marriage Should Be Legal"},{"id":999,"title":"Leaders of countries that use extra-territorial rendition should be tried for war crimes"},{"id":1000,"title":"Public health concerns justify compulsory immunization"},{"id":1001,"title":"Rich countries should actively recruit medical personnel from poorer countries"},{"id":1002,"title":"Dictatorship Is the Best Path to Development"},{"id":1003,"title":"Religions Should Not Qualify as Charities"},{"id":1004,"title":"Net Neutrality – All Internet Traffic Should Be Treated Equally"},{"id":1005,"title":"Drones Should Be Used to Take Out Enemy Combatants"},{"id":1006,"title":"We Should Have a Quota for Women on Corporate Boards"}]