[{"id":1,"source":"idebate","title":"Being a performer limits a child’s formal education"},{"id":2,"source":"idebate","title":"performers are at risk of exploitation"},{"id":3,"source":"idebate","title":"It is unethical to expose children to the pressures of performing"},{"id":4,"source":"idebate","title":"Being a performer can make the child physically vulnerable"},{"id":5,"source":"idebate","title":"Allowing children to perform pushes them to grow up too soon"},{"id":7,"source":"idebate","title":"Child performers are necessary for roles in some films, television shows, etc., and for the survival of some sports"},{"id":8,"source":"idebate","title":"If child performers were banned, many children would find a way to perform illegally, now without legal protection."},{"id":9,"source":"idebate","title":"The government has no right to prevent children from doing what they enjoy and are good at"},{"id":10,"source":"idebate","title":"Celebrities, like athletes, enhance the nation’s image and generate revenue"},{"id":14,"source":"idebate","title":"One of the great strengths of national service is that it demonstrates that everyone is equal"},{"id":18,"source":"idebate","title":"Trade provides developing countries with an important basis for their own improvement."},{"id":20,"source":"idebate","title":"Systemic aid' is detrimental to African society"},{"id":21,"source":"idebate","title":"Trade may not help those most in need."},{"id":24,"source":"idebate","title":"Trade does not allocate resources effectively"},{"id":26,"source":"idebate","title":"Young people should hear of the opportunities available in the armed services whilst in school"},{"id":27,"source":"idebate","title":"All high schools accepting state funding should accept military recruiters once a year"},{"id":28,"source":"idebate","title":"The purpose of the military entering schools is not solely recruitment but awareness"},{"id":29,"source":"idebate","title":"Young people are aware of the risks of military service and therefore would not be easily misled by military personnel"},{"id":30,"source":"idebate","title":"The military is an all-volunteer force and needs a percentage of school-age recruits each year"},{"id":31,"source":"idebate","title":"School children are too young to target for military service"},{"id":32,"source":"idebate","title":"Military recruiters downplay the risks of a military career, tempting schoolchildren into a career they would not have chosen with honest information."},{"id":33,"source":"idebate","title":"Military recruitment in schools is less education than propaganda"},{"id":34,"source":"idebate","title":"Military recruitment in schools is illegal"},{"id":35,"source":"idebate","title":"Murdoch is morally unfit to run a powerful media company."},{"id":38,"source":"idebate","title":"Murdoch is effective at selling news"},{"id":41,"source":"idebate","title":"Restrictions benefit the health of third parties"},{"id":43,"source":"idebate","title":"The state has to take measures to protect the health of its citizens"},{"id":44,"source":"idebate","title":"Regulation harms safety and the poor population"},{"id":45,"source":"idebate","title":"Democratic systems should educate on smoking rather than restrict it"},{"id":46,"source":"idebate","title":"Smoking is a choice of lifestyle the government should not intervene with"},{"id":48,"source":"idebate","title":"Animals are intrinsically worthy of rights because they are sentient"},{"id":50,"source":"idebate","title":"Animals are equal to human beings."},{"id":51,"source":"idebate","title":"Even if it matters whether or not humans and animals are similar, humans and animals are in fact similar enough that both should be granted rights."},{"id":52,"source":"idebate","title":"Even if we did think that animals were less intelligent than humans beings they should be protected by rights"},{"id":56,"source":"idebate","title":"Animals have no interests or rationality"},{"id":57,"source":"idebate","title":"Most rights have no bearing for animals"},{"id":58,"source":"idebate","title":"PR produces fairer results"},{"id":60,"source":"idebate","title":"PR increases political engagement which benefits society."},{"id":62,"source":"idebate","title":"PR leads to weaker government."},{"id":63,"source":"idebate","title":"PR creates an unfair balance of power."},{"id":66,"source":"idebate","title":"Extremist parties will rise under PR. "},{"id":68,"source":"idebate","title":"Curfews also have an important role in the protection of vulnerable children"},{"id":69,"source":"idebate","title":"A curfew is practical."},{"id":71,"source":"idebate","title":"It is best for children to be at home in the evening."},{"id":72,"source":"idebate","title":"Curfews are ineffective."},{"id":73,"source":"idebate","title":"Curfews compromise children's rights."},{"id":74,"source":"idebate","title":"Curfews are counter-productive."},{"id":75,"source":"idebate","title":"Positive engagement would be more effective than curfews."},{"id":77,"source":"idebate","title":"A graduated response will be an effective deterrent"},{"id":78,"source":"idebate","title":"A graduated response is the fairest way to enforce copyright legislation"},{"id":79,"source":"idebate","title":"The graduate response policy constitutes an invasion of privacy by the state"},{"id":80,"source":"idebate","title":"ISP will not cooperate with a graduated response policy"},{"id":81,"source":"idebate","title":"The graduated response is a violation of the basic right to due process"},{"id":83,"source":"idebate","title":"The right to internet access fills a gap in traditional human rights."},{"id":84,"source":"idebate","title":" Internet access is a necessary part of the right to freedom of information and expression."},{"id":86,"source":"idebate","title":"Internet access is a commodity not a human right."},{"id":87,"source":"idebate","title":"Internet access is an enabler of rights not a right in itself."},{"id":88,"source":"idebate","title":"Internet access cannot be a human right when it is not available to all."},{"id":89,"source":"idebate","title":"We all have an obligation to help maintain freedom of speech."},{"id":90,"source":"idebate","title":"Providing secure channels is the easiest way to help dissidents and democracy activists"},{"id":91,"source":"idebate","title":"Funding technologies to evade censorship could have immense benefits for very little cost"},{"id":92,"source":"idebate","title":"Violation of Sovereignty "},{"id":93,"source":"idebate","title":"Funds could be better spent on helping development"},{"id":94,"source":"idebate","title":"Evading censorship is already possible and censorship does not prevent the use of the internet."},{"id":95,"source":"idebate","title":"This will needlessly antagonise non-democratic countries"},{"id":97,"source":"idebate","title":"ACTA promotes medical research"},{"id":98,"source":"idebate","title":"ACTA is needed to protect brands"},{"id":99,"source":"idebate","title":"ACTA is anti-democratic"},{"id":100,"source":"idebate","title":"Creativity will suffer if ACTA is brought in"},{"id":101,"source":"idebate","title":"ACTA attacks free software and privatises data"},{"id":104,"source":"idebate","title":"The internet as a threat to public safety."},{"id":105,"source":"idebate","title":"The right to internet access as a fundamental right. "},{"id":106,"source":"idebate","title":"Disrupting internet service is a form of repression. "},{"id":108,"source":"idebate","title":"Internet governance must be multinational"},{"id":109,"source":"idebate","title":"Governments not ‘civil society’ must be in control of internet governance"},{"id":111,"source":"idebate","title":"The internet should be governed in the interests of freedom"},{"id":112,"source":"idebate","title":"CIRP would place power in the hands of authoritarian governments"},{"id":113,"source":"idebate","title":"The status quo has been very successful; don’t fix something that is not broken."},{"id":115,"source":"idebate","title":"Risk of a two-tier Internet"},{"id":117,"source":"idebate","title":"Incentivise ISPs to provide more data capacity"},{"id":118,"source":"idebate","title":"Allow ISPs to monitor and remove illegal or unwanted data"},{"id":124,"source":"idebate","title":"Considering the amount of data governments produce, compelling them to publish all of it would be counterproductive as citizens would be swamped. "},{"id":127,"source":"idebate","title":"The introduction of technology is inevitable"},{"id":128,"source":"idebate","title":"Technology is available"},{"id":129,"source":"idebate","title":"GLT is used across a range of other sports"},{"id":130,"source":"idebate","title":"Technology is more reliable than human judgement"},{"id":132,"source":"idebate","title":"The cost would not match FIFA's aim of opening football to the world"},{"id":133,"source":"idebate","title":"Controversy and debate are a part of the game"},{"id":134,"source":"idebate","title":"The cost of GLT is unjustified for a relatively rare scenario"},{"id":135,"source":"idebate","title":"Athletes should be free to take risks when training and competing"},{"id":136,"source":"idebate","title":"There is no distinction between \"natural\" and synthetic methods of performance enhancement"},{"id":137,"source":"idebate","title":"Controlling, rather than ignoring, performance enhancing substances will improve competitive standards in sport"},{"id":138,"source":"idebate","title":"Improving safety standards in sport"},{"id":139,"source":"idebate","title":"Drugs will undermine the central philosophy of sport"},{"id":140,"source":"idebate","title":"Permitting the use of performace enhancers would have a coercive effect on athletes who would otherwise avoid drug use"},{"id":143,"source":"idebate","title":"Bullfighting is a form of animal torture"},{"id":144,"source":"idebate","title":"Harming animals for entertainment is immoral"},{"id":145,"source":"idebate","title":"Bullfighting is too dangerous to humans to justify"},{"id":146,"source":"idebate","title":"Bullfighting is an art-form and an important cultural tradition"},{"id":147,"source":"idebate","title":"Bullfighting is no more harmful than the alternatives for bulls and cows"},{"id":148,"source":"idebate","title":"Bullfighting is economically important for some regions"},{"id":149,"source":"idebate","title":"Accurate calls should be the top priority, and instant replay helps provide them"},{"id":150,"source":"idebate","title":"It’s not possible to get every call right, so instant replay is a necessary supplement to umpires’ skill"},{"id":151,"source":"idebate","title":"Instant replay will actually enhance umpires’ stature"},{"id":152,"source":"idebate","title":"Instant replay will place the focus of the game where it belongs—on the players, not the umpires"},{"id":153,"source":"idebate","title":"With more accurate calls come more legitimate outcomes to games"},{"id":154,"source":"idebate","title":"Instant replay will take too long"},{"id":155,"source":"idebate","title":"Instant replay will take the human element out of baseball"},{"id":156,"source":"idebate","title":"Tradition demands that this instant replay not be used"},{"id":157,"source":"idebate","title":"Many plays don’t lend themselves to video review"},{"id":158,"source":"idebate","title":"Instant replay might be deceptive or inconclusive"},{"id":159,"source":"idebate","title":"This type of music is degrading to everyone, not just women."},{"id":160,"source":"idebate","title":"Music depicting violence to women causes and sustains the cycle of violence."},{"id":162,"source":"idebate","title":"Music depicting violence against women encourages men (and women) not to respect women."},{"id":163,"source":"idebate","title":"It would be highly impractical to ban this music glorifying violence."},{"id":164,"source":"idebate","title":"To ban this type of music encourages the viewing of women as helpless, victim figures."},{"id":166,"source":"idebate","title":"The 'Slippery-Slope' Argument"},{"id":168,"source":"idebate","title":"Space exploration has improved communications on Earth"},{"id":169,"source":"idebate","title":"Space exploration leads to technological advancement"},{"id":170,"source":"idebate","title":"It is a moral imperative to constantly seek to expand the boundaries of knowledge"},{"id":171,"source":"idebate","title":"The 'space race' fuels nationalistic sentiment and antagonism"},{"id":172,"source":"idebate","title":"The cost of space exploration exceeds the positive benefits"},{"id":173,"source":"idebate","title":"Space exploration takes resources away from more worthy causes"},{"id":174,"source":"idebate","title":"Marriage is about more than procreation, therefore gay couples should not be denied the right to marry due to their biology."},{"id":175,"source":"idebate","title":"Gay couples should be able to take advantage of the fiscal and legal benefits of marriage"},{"id":177,"source":"idebate","title":"Gay marriage is good for society"},{"id":178,"source":"idebate","title":"It is discriminatory to refuse gay couples the right to marry"},{"id":179,"source":"idebate","title":"Gay marriage undermines the institution of marriage, leading to an increase in out of wedlock births and divorce rates"},{"id":181,"source":"idebate","title":"Marriage should be between a man and a woman"},{"id":182,"source":"idebate","title":"Marriage is a religious institution, and the major world religions frown upon homosexuality"},{"id":186,"source":"idebate","title":"The Catholic Church believes that any limitation of procreation is against God."},{"id":187,"source":"idebate","title":"Protects people from spending eternity in Hell."},{"id":191,"source":"idebate","title":"Promotes image of Catholic Church as uncaring and stubborn."},{"id":193,"source":"idebate","title":"Entirely natural theories can adequately explain the existence and development of the Universe and all it contains, making God irrelevant to the discussion of reality:"},{"id":194,"source":"idebate","title":"If there is a benevolent deity, then there should not be the kinds of evil observable in the world and He would likely show more interest in His creation than He appears to have done so far:"},{"id":195,"source":"idebate","title":"If there were a God there would be irrefutable evidence of His existence and people would feel compelled to belief by the fact of it:"},{"id":196,"source":"idebate","title":"The nature of God as it is conventionally described is logically contradictory:"},{"id":200,"source":"idebate","title":"In the absence of positive evidence for the existence of God the rational position is agnosticism, not atheism:"},{"id":201,"source":"idebate","title":"The complexity of the universe and of life cannot be explained by atheism:"},{"id":203,"source":"idebate","title":"Even in societies with a state, anarchist groups provide a voice for the oppressed."},{"id":209,"source":"idebate","title":"Anarchy has nothing to contribute but violence."},{"id":210,"source":"idebate","title":"Anarchist Communities have a very poor track record."},{"id":212,"source":"idebate","title":"Imposing democracy can be a way to support individuals unable to fight for democracy themselves."},{"id":213,"source":"idebate","title":"Promoting democracy promotes peace."},{"id":214,"source":"idebate","title":"Because democracy is the best form of government, it is not wrong-- and indeed may even be our obligation-- to bring it to those who do not have it."},{"id":215,"source":"idebate","title":"Democracy by its very nature cannot be imposed."},{"id":218,"source":"idebate","title":"The imposition of democracy violates national sovereignty"},{"id":219,"source":"idebate","title":"Attempting to impose democracy may escalate conflict."},{"id":222,"source":"idebate","title":"The capitalist society enhances personal freedom"},{"id":224,"source":"idebate","title":"Socialism leads to a more humane equal society"},{"id":225,"source":"idebate","title":"Socialism provides a more sustainable way of living"},{"id":226,"source":"idebate","title":"Socialism is a more secure system than the free market in Capitalism"},{"id":227,"source":"idebate","title":"The ICC is the best way to prosecute serious crimes because of its permanence; individual tribunals are not enough."},{"id":228,"source":"idebate","title":"If supported, the ICC will set a precedent and deter leaders from committing crimes against humanity."},{"id":229,"source":"idebate","title":"The ICC will prosecute leaders who commit the most severe crimes and give them their due."},{"id":230,"source":"idebate","title":"The ICC is the most suited towards the rising nature of crimes in a globalizing world."},{"id":231,"source":"idebate","title":"Efforts to strengthen the ICC will promote global cooperation, norms against crimes, and international stability."},{"id":232,"source":"idebate","title":"The ICC interferes with national operations (both military and humanitarian) because of how loosely the Rome Statue can be interpreted."},{"id":233,"source":"idebate","title":"The ICC does not have enough checks on prosecutorial powers, inviting prosecutorial abuse."},{"id":234,"source":"idebate","title":"The ICC has no real enforcement mechanism and cannot be a force for good if it has no way of ensuring prosecution."},{"id":235,"source":"idebate","title":"The ICC is not democratic in nature and is likely to be used as a political tool by powerful nations."},{"id":236,"source":"idebate","title":"The ICC infringes upon national sovereignty by inherently implying that there is a higher court nations must answer to."},{"id":237,"source":"idebate","title":"The EU has already been unifying on multiple fronts, this is just a step in the same direction."},{"id":238,"source":"idebate","title":"The fact that it is a Representative highlights the fact that the EU is based on consultation and consensus, and that is a positive thing."},{"id":241,"source":"idebate","title":"The post of a High Representative is merely a shadow of what it should have been, and its failure shows the EU's inability to consolidate foreign policy."},{"id":242,"source":"idebate","title":"The previous arrangement of having two foreign policy centers (in the Commission and in the Council) was arguably inefficient, but consolidating these into a single office-holder has created more complexity and at significantly greater expense."},{"id":243,"source":"idebate","title":"There have been tests on the EU's ability to create a common foreign policy that it has failed."},{"id":246,"source":"idebate","title":"A rise in UN membership should be reflected also in an increase in Security Council members."},{"id":250,"source":"idebate","title":"A UNSC reform is very hard to achieve due to the many different interests and demands."},{"id":254,"source":"idebate","title":"Smokers are a drain on economic resources"},{"id":256,"source":"idebate","title":"Denying access to healthcare for smokers would act as a deterrent, discouraging smokers"},{"id":257,"source":"idebate","title":"As smokers have a higher chance of harm from surgery due to complications arising from their habit, it is more efficient to prioritize non-smokers"},{"id":258,"source":"idebate","title":"Denying healthcare to smokers is impractical"},{"id":259,"source":"idebate","title":"Denying access to healthcare for smokers will lead to thousands of people being turned away and potentially dying from preventable illnesses"},{"id":260,"source":"idebate","title":"Denying access to healthcare for smokers will hurt the economy"},{"id":261,"source":"idebate","title":"Denying healthcare to smokers alone is victimization"},{"id":262,"source":"idebate","title":"Denying healthcare to smokers is a restriction on people's liberties"},{"id":263,"source":"idebate","title":"Exposing non-smokers to second-hand smoke goes against their rights."},{"id":264,"source":"idebate","title":"This ban would lower healthcare costs."},{"id":265,"source":"idebate","title":"This ban would encourage smokers to smoke less or give up smoking altogether."},{"id":266,"source":"idebate","title":"This ban would be easy to introduce."},{"id":267,"source":"idebate","title":"This ban would be difficult to enforce."},{"id":268,"source":"idebate","title":"Smokers have a right to enjoy themselves."},{"id":269,"source":"idebate","title":"This ban would put many pubs, clubs, etc. out of business."},{"id":270,"source":"idebate","title":"People should be allowed to do whatever they want to their own bodies"},{"id":271,"source":"idebate","title":"Alcohol and tobacco are more harmful drugs, yet remain legal."},{"id":272,"source":"idebate","title":"If cannabis was legalized, it could be regulated"},{"id":273,"source":"idebate","title":"Cannabis opens the mind in a positive and beneficial manner"},{"id":274,"source":"idebate","title":"Cannabis is a gateway drug"},{"id":275,"source":"idebate","title":"Uncertainty over the effects of cannabis means it is best to be prudent"},{"id":277,"source":"idebate","title":"Cannabis is harmful"},{"id":282,"source":"idebate","title":"Classification, not censorship"},{"id":284,"source":"idebate","title":"Defending hip hop artists’ right to free speech"},{"id":286,"source":"idebate","title":"A ban will be ineffective"},{"id":288,"source":"idebate","title":"It is right that illegal acts by the state be exposed"},{"id":289,"source":"idebate","title":"The public have a right to know what is committed in their name"},{"id":290,"source":"idebate","title":"The military can only be held to account if there is transparency"},{"id":291,"source":"idebate","title":"Leaking military secrets puts lives in danger"},{"id":294,"source":"idebate","title":"There needs to be a deterrent against those thinking of visiting extremist websites"},{"id":295,"source":"idebate","title":"The internet is an echo chamber that will confirm extremists in their views if not stopped"},{"id":297,"source":"idebate","title":"Criminalisation will not stop radicalisation"},{"id":300,"source":"idebate","title":"Freedom of expression is a fundamental human right."},{"id":301,"source":"idebate","title":"People have a right to choose their cultural values"},{"id":303,"source":"idebate","title":"Freedom of Speech is a Universal Right"},{"id":310,"source":"idebate","title":"Regulating the Internet is a means for governments to spy on their citizens"},{"id":312,"source":"idebate","title":"Internet regulation is an attempt by big interest groups to regulate the internet in their favour"},{"id":313,"source":"idebate","title":"Internet regulation is necessary to ensure a safe internet"},{"id":315,"source":"idebate","title":"Internet regulation is necessary to ensure a working economy on the internet"},{"id":322,"source":"idebate","title":"This was a piece of art, advertised and described as such, those likely to be offended were quite welcome not to watch it."},{"id":327,"source":"idebate","title":"Tens of thousands of licence fee payers objected to this, ultimately they are the BBC’s key stakeholder and that view is worthy of respect."},{"id":329,"source":"idebate","title":"Malls promote competition and serve consumers well"},{"id":331,"source":"idebate","title":"Out of town shopping malls offer a better shopping experience"},{"id":332,"source":"idebate","title":"Out of town retail developments are bad for the environment"},{"id":333,"source":"idebate","title":"Out of town malls damage town centres"},{"id":334,"source":"idebate","title":"Out of town centres damage local communities' identities"},{"id":336,"source":"idebate","title":"Energy demands are increasing exponentially and nuclear power is the only renewable source capable of matching it"},{"id":337,"source":"idebate","title":"Nuclear power is clean and emits significantly less CO2 than other renewable energy sources"},{"id":338,"source":"idebate","title":"Nuclear power gives countries energy security and self-sufficiency"},{"id":339,"source":"idebate","title":"Nuclear power is very expensive"},{"id":340,"source":"idebate","title":"Promoting continued nuclear research is against our security interests"},{"id":341,"source":"idebate","title":"The supply of uranium needed for nuclear power is not actually unlimited, renewable or sustainable"},{"id":342,"source":"idebate","title":"Nuclear power is potentially extremely unsafe"},{"id":343,"source":"idebate","title":"Animals have a right not to be harmed"},{"id":344,"source":"idebate","title":"Animal research necessitates significant harm to the animals involved"},{"id":345,"source":"idebate","title":"Research can be done effectively without experimenting on living creature"},{"id":348,"source":"idebate","title":"Animals' rights are of less moral worth than human rights"},{"id":349,"source":"idebate","title":"People would die and suffer needlessly under such a policy"},{"id":350,"source":"idebate","title":"Animal research is necessary for the development of truly novel substances"},{"id":351,"source":"idebate","title":"Animal research is only used where other research methods are not suitable"},{"id":352,"source":"idebate","title":"Animals involved in animal research are mostly well treated."},{"id":353,"source":"idebate","title":"Private universities are needed to increase the number of places for students."},{"id":354,"source":"idebate","title":"The introduction of more private universities would increase the quality of education by allowing open competition"},{"id":355,"source":"idebate","title":"The privatisation of universities encourages course-diversity and provides for students are individuals, not cattle"},{"id":357,"source":"idebate","title":"Allowing universities to be guided by an invisible hand does more harm than good"},{"id":358,"source":"idebate","title":"Private Universities would risk reducing the quality of university degrees."},{"id":359,"source":"idebate","title":"This will increase the perception that universities are just for the rich"},{"id":360,"source":"idebate","title":"Private universities would increase the divide between the rich and poor"},{"id":361,"source":"idebate","title":"History should be left for those intellectual capable of understanding its limitations, and therefore not taught at school"},{"id":362,"source":"idebate","title":"History teaching will reflect the erroneous preconceptions and aims of those who set the curriculum"},{"id":363,"source":"idebate","title":"History lessons can be used as state-sponsored propaganda, distorting the events of the past"},{"id":364,"source":"idebate","title":"Teaching history ensures that events of the past are not forgotten, and lessons are learned"},{"id":365,"source":"idebate","title":"Historical facts can be established to a sufficient degree to be taught to schoolchildren"},{"id":366,"source":"idebate","title":"History should be taught to school-children, they form an integral part of understanding oneself and one's nation"},{"id":367,"source":"idebate","title":"History teaches useful skills applicable in other areas of education and life"},{"id":372,"source":"idebate","title":"States' duty to avoid the use of force when solving social problems"},{"id":373,"source":"idebate","title":"Flogging will be over-utilised, rehabilitation will be under-utilised"},{"id":375,"source":"idebate","title":"Hosting creates a 'feel-good' factor"},{"id":376,"source":"idebate","title":"Hosting stimulates regeneration in local areas"},{"id":378,"source":"idebate","title":"Hosting has wide-reaching economic benefits"},{"id":380,"source":"idebate","title":"The bidding process is too long, tying up funds and land"},{"id":381,"source":"idebate","title":"Hosting is very expensive"},{"id":382,"source":"idebate","title":"There must be a maximum amount of performance that people are capable of, given rest and reward. To work people too long is to waste their potential."},{"id":383,"source":"idebate","title":"There should be a legally mandated ceiling on weekly working hours, because it creates employment."},{"id":384,"source":"idebate","title":"Introducing a cap on working hours would reduce unemployment."},{"id":385,"source":"idebate","title":"A maximum working week provides protection for workers."},{"id":386,"source":"idebate","title":"Policing such a policy creates its own set of problems for the society and costs for the economy"},{"id":387,"source":"idebate","title":"The market already limits worker hours when left to its own devices, no intrusion is required."},{"id":388,"source":"idebate","title":"There should be no legally mandated ceiling on weekly working hours as it limits economic growth."},{"id":389,"source":"idebate","title":"Small and mid sized businesses cannot afford the extra costs involved in complying with such a policy."},{"id":390,"source":"idebate","title":"Gambling is addictive and psychologically harmful"},{"id":391,"source":"idebate","title":"Gambling leads to the disintegration of families"},{"id":392,"source":"idebate","title":"Online gambling has increased the incidence of gambling addiction"},{"id":393,"source":"idebate","title":"Casinos are often used to mask criminal activity"},{"id":394,"source":"idebate","title":"Gambling affects poor people disproportionately"},{"id":395,"source":"idebate","title":"Gambling is associated with other forms of addiction and harmful behaviour"},{"id":397,"source":"idebate","title":"It is impossible to effectively ban gambling"},{"id":398,"source":"idebate","title":"Casinos create positive economic effects in the communities that host them"},{"id":401,"source":"idebate","title":"Violent Video Games Cause Social Interaction Problems"},{"id":402,"source":"idebate","title":"Violent Video Games cause Violent Behaviour"},{"id":403,"source":"idebate","title":"The Responsibility Lies With Parents"},{"id":405,"source":"idebate","title":"Violent Video Games Prevent Violent Behaviour"},{"id":406,"source":"idebate","title":"The cartoons constitute a religiously motivated hate crime"},{"id":407,"source":"idebate","title":"Violent reactions to the cartoons could have been predicted and should have been avoided"},{"id":408,"source":"idebate","title":"Radical and anti western voices in Islamic communities gained authority and legitimacy as a result of the newspapers' actions"},{"id":410,"source":"idebate","title":"Free expression and journalistic integrity"},{"id":412,"source":"idebate","title":"Citizens of western liberal democracies should never be required to adhere to religious norms that they do not hold"},{"id":414,"source":"idebate","title":"Life is more important than dignity"},{"id":415,"source":"idebate","title":"Anorectic patients are not able to make the decision for themselves."},{"id":416,"source":"idebate","title":"Force feeding can help psychologically."},{"id":418,"source":"idebate","title":"Compulsory treatment is not a long term solution."},{"id":420,"source":"idebate","title":"Force feeding strategies may cause physical harm"},{"id":422,"source":"idebate","title":"The Identity and History of the United States are intrinsically linked to the English Language"},{"id":423,"source":"idebate","title":"Bilingual Education is expensive and encourages balkanization"},{"id":425,"source":"idebate","title":"Bilingual education hurts students"},{"id":427,"source":"idebate","title":"It specifically denies a rich cultural heritage which is uniquely American of groups that spoke English but not as a first language"},{"id":428,"source":"idebate","title":"Even within the United States people speak English differently"},{"id":429,"source":"idebate","title":"The US has a long tradition of multiple languages"},{"id":434,"source":"idebate","title":"Scholars will have better access to artefacts, and more opportunities for study and collaboration, if they are stored in the west"},{"id":437,"source":"idebate","title":"In many cases, returning an artefact may prove to be unreasonably expensive"},{"id":438,"source":"idebate","title":"Wikipedia provides free, open access to knowledge"},{"id":439,"source":"idebate","title":"Collaboration in editing encourages democratic principles"},{"id":440,"source":"idebate","title":"Wikipedia is an excellent starting point for enquiries"},{"id":441,"source":"idebate","title":"Wikipedia enshrines the principle of freedom of information"},{"id":443,"source":"idebate","title":"The information is not accurate and sometimes undermined by poor writing"},{"id":444,"source":"idebate","title":"Entries are too easily manipulated"},{"id":445,"source":"idebate","title":"Wikipedia is driving high-quality encyclopaedias out of business, without offering a better service."},{"id":446,"source":"idebate","title":"Wikipedia lacks the necessary coverage"},{"id":447,"source":"idebate","title":"Wikipedia threatens the academic enterprise."},{"id":449,"source":"idebate","title":"PSBs bring nations and people together and are an actively positive force within the mediasphere"},{"id":450,"source":"idebate","title":"PSB are better equipped than private broadcasters to air accurate, objective and impartial information and programming"},{"id":453,"source":"idebate","title":"PSBs funding sources give them an unfair advantage in the broadcasting market, harming competition."},{"id":454,"source":"idebate","title":"Violent video games desensitise users"},{"id":455,"source":"idebate","title":"Research has shown violent video games encourage criminal and anti-social behaviour"},{"id":456,"source":"idebate","title":"Violent video games can cause psychological disturbances"},{"id":457,"source":"idebate","title":"The government has a right to restrict the sale of violent video games, in order to protect law and order."},{"id":458,"source":"idebate","title":"There is no causal link between violent video games and aggressive behaviour"},{"id":460,"source":"idebate","title":"Restrictions would be ineffective"},{"id":461,"source":"idebate","title":"There are too many advertisements in everyday life."},{"id":462,"source":"idebate","title":"People are given too much choice, which makes them less happy."},{"id":463,"source":"idebate","title":"Advertisements are an attempt to brainwash customers."},{"id":464,"source":"idebate","title":"Advertisements try to make people feel bad about not having the product"},{"id":466,"source":"idebate","title":"Small businesses need advertisements to make their products known."},{"id":468,"source":"idebate","title":"Advertisements promote healthy products and lifestyles."},{"id":471,"source":"idebate","title":"In the internet age immediacy is everything, newspapers can often contain out of date information by the time they hit the shelves."},{"id":472,"source":"idebate","title":"Newspapers cannot be environmentally sustained."},{"id":475,"source":"idebate","title":"Newspapers provide higher quality journalism than other media"},{"id":476,"source":"idebate","title":"Newspapers are a more trustworthy source of information than independent bloggers"},{"id":479,"source":"idebate","title":"All of society benefits from protection of indigenous culture"},{"id":480,"source":"idebate","title":"Existing states are responsible for the destruction of indigenous populations and their societies, and thereby have an obligation to help reverse the effects of their actions"},{"id":481,"source":"idebate","title":"The preservation of displaced cultures is important in preventing future oppression."},{"id":487,"source":"idebate","title":"Sexist advertising is harmful to society, especially women."},{"id":488,"source":"idebate","title":"Women have a right to be free of stereotyping."},{"id":490,"source":"idebate","title":"Policies should be established which ban the promotion of sexist attitudes in advertising."},{"id":492,"source":"idebate","title":"Sexist advertising is subjective so would be too difficult to codify."},{"id":493,"source":"idebate","title":"Any changes in advertising should come from businesses themselves rather than through banning."},{"id":495,"source":"idebate","title":"Governments should not allow forums for hate speech to flourish"},{"id":496,"source":"idebate","title":"Holocaust denial sites are an attack on group identities"},{"id":497,"source":"idebate","title":"The freedom of Holocaust deniers to use to the internet legitimizes their organization and message in eyes of consumers"},{"id":498,"source":"idebate","title":"A ban would stop Holocaust deniers from engaging in effective real world actions"},{"id":499,"source":"idebate","title":"Everyone has a right to freedom of expression"},{"id":503,"source":"idebate","title":"Voters have a right to know the background of their would-be representatives, including financial background"},{"id":504,"source":"idebate","title":"Financial dealings can indicate candidates’ willingness to circumvent the system\/play by the rules"},{"id":505,"source":"idebate","title":"This information offers valuable texture to the financial proposals candidates offer as potential policy"},{"id":506,"source":"idebate","title":"Individuals have a right to privacy, including to their own financial records"},{"id":507,"source":"idebate","title":"Fixating on candidates’ financial records fuels the fire of class war"},{"id":508,"source":"idebate","title":"The focus of elections should be on policy, not personal issues like financial records"},{"id":511,"source":"idebate","title":"Transparency helps reduce international tension"},{"id":512,"source":"idebate","title":"Transparency prevents, or corrects, mistakes"},{"id":513,"source":"idebate","title":"Transparency prevents public relations disasters"},{"id":517,"source":"idebate","title":"Transparency can lead to conflict"},{"id":518,"source":"idebate","title":"In security too much transparency endangers lives"},{"id":519,"source":"idebate","title":"Repressive governments rely on internet censorship to stifle dissent and entrench their power"},{"id":520,"source":"idebate","title":"Western democracies have a moral duty to aid the liberation of oppressed people where it can effectively do so"},{"id":521,"source":"idebate","title":"This would make a powerful statement in favour of freedom of expression and against repression"},{"id":524,"source":"idebate","title":"It results in Western companies getting kicked out of the countries, damaging significant Western businesses"},{"id":525,"source":"idebate","title":"Collisions are exciting and fun to watch.  "},{"id":526,"source":"idebate","title":"Collisions are a part of the game.  "},{"id":527,"source":"idebate","title":"Collisions are not as dangerous as they’re feared to be.  "},{"id":528,"source":"idebate","title":"Without collisions, either the catcher or the runner would have an enormous and unfair advantage.  "},{"id":529,"source":"idebate","title":"Collisions are dangerous and lead to injury.  "},{"id":530,"source":"idebate","title":"Collisions are an example of violence that has no place in baseball.  "},{"id":531,"source":"idebate","title":"Collisions are unnecessary.  "},{"id":533,"source":"idebate","title":"Heat will damage player's health"},{"id":534,"source":"idebate","title":"A sporting event in the heat of a desert summer will not be a pleasant experience for the fans"},{"id":536,"source":"idebate","title":"Moving now would be unfair to the other bidders"},{"id":537,"source":"idebate","title":"A winter cup would harm media revenue"},{"id":538,"source":"idebate","title":"It would Interfere with other competitions"},{"id":539,"source":"idebate","title":"A moral duty to play for your country"},{"id":545,"source":"idebate","title":"Female role models are needed urgently to raise aspirations among young women and change parliamentary practices"},{"id":546,"source":"idebate","title":"Women must gain positions in Parliament quickly as they would raise awareness about 'less important' issues such as family and employment rights"},{"id":547,"source":"idebate","title":"Parliament must be representative of our society and that requires a substantial increase in the number of women which only positive discrimination can achieve"},{"id":548,"source":"idebate","title":"All-women shortlists or quotas restrict a constituent's freedom of choice"},{"id":549,"source":"idebate","title":"Artificial increases in numbers of women are not necessary, as there are other, less intrusive, alternatives to increase visibility of women in politics"},{"id":550,"source":"idebate","title":"Positive discrimination for women is discrimination"},{"id":551,"source":"idebate","title":"THIS HOUSE WOULD INTRODUCE POSITIVE DISCRIMINATION TO PUT MORE WOMEN IN PARLIAMENT Women are vastly underrepresented in democratic legislatures across the world. Until 20 years ago women had never been more than 5% of MPs in UK Parliament1. Even today wom"},{"id":552,"source":"idebate","title":"Interventions can be small and successful."},{"id":555,"source":"idebate","title":"Foreign intervention fragments the conflict."},{"id":556,"source":"idebate","title":"Force does more harm than good."},{"id":557,"source":"idebate","title":"This is an illegitimate violation of national sovereignty."},{"id":558,"source":"idebate","title":"There is a moral obligation to provide affirmative action programs"},{"id":559,"source":"idebate","title":"Affirmative action removes the cyclical disadvantages of discrimination"},{"id":560,"source":"idebate","title":"Affirmative action reduces social prejudice"},{"id":562,"source":"idebate","title":"Affirmative action creates bad workplaces for all minorities"},{"id":563,"source":"idebate","title":"Affirmative action perpetuates prejudice"},{"id":564,"source":"idebate","title":"The provision of driver’s licenses makes the streets safer."},{"id":565,"source":"idebate","title":"This allows illegal immigrants to get drivers insurance, which makes safer and fairer roads."},{"id":567,"source":"idebate","title":"This rewards law-breaking."},{"id":568,"source":"idebate","title":"This will foster further resentment of the Hispanic community in America. "},{"id":569,"source":"idebate","title":"This allows illegals to masquerade as normal immigrants."},{"id":570,"source":"idebate","title":"The one child policy skews gender demographics"},{"id":574,"source":"idebate","title":"One child benefits women"},{"id":576,"source":"idebate","title":"Zero tolerance policing provides a powerful deterrent to criminals."},{"id":577,"source":"idebate","title":"Zero tolerance also allows for a sound rehabilitative role"},{"id":578,"source":"idebate","title":"Zero tolerance improves the standard of policing"},{"id":580,"source":"idebate","title":"Zero tolerance policing is enormously expensive"},{"id":582,"source":"idebate","title":"South Ossetia has a right to self-determination "},{"id":584,"source":"idebate","title":"South Ossetian independence will help prevent future conflict "},{"id":586,"source":"idebate","title":"A South Ossetian state is unviable "},{"id":588,"source":"idebate","title":"Serbs have a right to Self-Determination."},{"id":589,"source":"idebate","title":"There is legitimate precedent."},{"id":590,"source":"idebate","title":"The present state structure does not work."},{"id":593,"source":"idebate","title":"Secession strengthen Nationalism in the new states"},{"id":594,"source":"idebate","title":"Secession will hurt minorities in the new state"},{"id":595,"source":"idebate","title":"Secession will lead to renewed conflict."},{"id":597,"source":"idebate","title":"Republika Srpska  cannot survive economically as an independent state."},{"id":598,"source":"idebate","title":"The feminist movement should not allow women to sell themselves"},{"id":599,"source":"idebate","title":"Porn is inherently dehumanising"},{"id":600,"source":"idebate","title":"Pornography fuels unreachable ideals "},{"id":601,"source":"idebate","title":"Pornography eroticises violence"},{"id":602,"source":"idebate","title":"Freedom of expression is essential for women"},{"id":603,"source":"idebate","title":"Pornography liberates women"},{"id":604,"source":"idebate","title":"Attempting to ban it would only cause further problems"},{"id":605,"source":"idebate","title":"The feminist movement cannot afford to alienate itself from society"},{"id":606,"source":"idebate","title":"The government has a right to make decisions in the best interest of the people"},{"id":607,"source":"idebate","title":"Restrictions on migration would benefit people in the cities economically and socially"},{"id":608,"source":"idebate","title":"Restrictions would benefit rural areas"},{"id":609,"source":"idebate","title":"Poor, uneducated people are lured into cities"},{"id":610,"source":"idebate","title":"Freedom of movement is an intrinsic human right"},{"id":611,"source":"idebate","title":"It is practically impossible to control people's movement"},{"id":612,"source":"idebate","title":"Rural life is miserable and has higher mortality rates than cities"},{"id":613,"source":"idebate","title":"Restrictions cause an incredible loss of potential"},{"id":615,"source":"idebate","title":"More women in the labour market leads to higher GDP "},{"id":616,"source":"idebate","title":"Quotas encourage women to pursue education and professional job positions "},{"id":617,"source":"idebate","title":"Quota-led gender equality in executive boards will help shape a gender sensitive and highly performing business environment."},{"id":618,"source":"idebate","title":"There is no clear link between gender quota and economic growth"},{"id":619,"source":"idebate","title":"Public and private institutions should hire people based on skills not gender to achieve positive economic impact "},{"id":620,"source":"idebate","title":"There are other policy options that are less distortive and more advantageous for the economy. "},{"id":622,"source":"idebate","title":"Spending on youth is best for the economy"},{"id":624,"source":"idebate","title":"Leaving large numbers of young people unemployed could be dangerous"},{"id":625,"source":"idebate","title":"The government should not prioritise one age group over another"},{"id":628,"source":"idebate","title":"The youth already have a lot of spending focused on them"},{"id":629,"source":"idebate","title":"The EU needs to help those suffering from human rights abuses"},{"id":630,"source":"idebate","title":"Asylum is the only way to protect women"},{"id":632,"source":"idebate","title":"The EU’s reputation can only benefit from a strong policy on women’s rights "},{"id":633,"source":"idebate","title":"We would allow discriminated women to reach their full potential "},{"id":634,"source":"idebate","title":"The situation in these countries is improving, no need for a new policy. "},{"id":636,"source":"idebate","title":"Offering asylum for women will be seen as a case of cultural imperialism"},{"id":637,"source":"idebate","title":"Allowing women asylum will damage feminist movements "},{"id":638,"source":"idebate","title":"Arming teachers would mean safer schools"},{"id":639,"source":"idebate","title":"Not all schools have police available to protect them."},{"id":643,"source":"idebate","title":"Guns in schools might be used in circumstances other than defense."},{"id":644,"source":"idebate","title":"Children would be caught in the crossfire"},{"id":646,"source":"idebate","title":"Differences in physical strength can be overcome"},{"id":648,"source":"idebate","title":"Allowing women to serve in combat increases the pool for recruits"},{"id":650,"source":"idebate","title":"There should be equality between men and women. "},{"id":651,"source":"idebate","title":"Integrating women into male combat units can cause men to behave badly"},{"id":652,"source":"idebate","title":"There is a relatively higher female Injury rate"},{"id":653,"source":"idebate","title":"Pregnancy affects military readiness"},{"id":654,"source":"idebate","title":"Female P.O.W.s (prisoners of war) are a liability"},{"id":655,"source":"idebate","title":"Battlefield Rape is a concern"},{"id":657,"source":"idebate","title":"Integration and the acceptance of Western values are important"},{"id":658,"source":"idebate","title":"Women in arranged marriages in Europe are disproportionately likely to suffer abuse"},{"id":659,"source":"idebate","title":"It’s impossible to police such a law."},{"id":660,"source":"idebate","title":"It will cause resentment and make certain communities feel targeted. "},{"id":661,"source":"idebate","title":"The state should not be allowed to intrude in such personal matters"},{"id":668,"source":"idebate","title":"Cloning is unsafe"},{"id":670,"source":"idebate","title":"Cloning harms families"},{"id":671,"source":"idebate","title":"Cloning violates human dignity"},{"id":672,"source":"idebate","title":"Cloning treats children as objects"},{"id":673,"source":"idebate","title":"Will allow the elimination of diseases "},{"id":674,"source":"idebate","title":"Clones will still be individuals"},{"id":675,"source":"idebate","title":"Cloning should be allowed for those who can’t otherwise have a child"},{"id":676,"source":"idebate","title":"A Palestinians were forced to leave and so have a right to return"},{"id":677,"source":"idebate","title":"Palestinians have a right to return under international law"},{"id":678,"source":"idebate","title":"Denying the right to return harms Palestinians"},{"id":679,"source":"idebate","title":"A Palestinian right of return would destroy the 'Jewish State' in Israel"},{"id":681,"source":"idebate","title":"No real 'right of return' exists in international law"},{"id":682,"source":"idebate","title":"The LGBT community fulfills the basic principles and purposes of asylum"},{"id":683,"source":"idebate","title":"This policy of asylum pressures governments to reform discriminatory laws"},{"id":684,"source":"idebate","title":"This policy of asylum helps manufacture global consensus on the protection of the LGBT community"},{"id":685,"source":"idebate","title":"This policy is an illegitimate breach of national sovereignty"},{"id":687,"source":"idebate","title":"This policy undermines the grassroots movements that are necessary for full and sustained protection of the LGBT community"},{"id":690,"source":"idebate","title":"Markets in sexual services can serve legitimate needs"},{"id":691,"source":"idebate","title":"Markets in sexual services can respect sexual autonomy"},{"id":692,"source":"idebate","title":"Legalization has benefits for society"},{"id":693,"source":"idebate","title":"Legalization would free up resources that could be devoted to eliminating sex trafficking"},{"id":695,"source":"idebate","title":"Markets in sexual services undermine the values of commitment and loyalty "},{"id":696,"source":"idebate","title":"Moral sex requires more than informed consent, and society should uphold moral values"},{"id":697,"source":"idebate","title":"Markets in sex would corrupt non-market sexual relations, turning women and girls into commodities "},{"id":704,"source":"idebate","title":"ASBOs do not address the real problem"},{"id":705,"source":"idebate","title":"ASBOS encourage antisocial behavour"},{"id":706,"source":"idebate","title":"ASBOS breach basic principles of justice"},{"id":707,"source":"idebate","title":"There is no respect among the population for ASBOS"},{"id":711,"source":"idebate","title":"Equality of opportunity"},{"id":713,"source":"idebate","title":"Changes negative perceptions of university life"},{"id":714,"source":"idebate","title":"Increase the number of Minorities"},{"id":715,"source":"idebate","title":"Achievements should be earned not given"},{"id":716,"source":"idebate","title":"Affirmative action can create social tensions"},{"id":717,"source":"idebate","title":"Affirmative action will not work"},{"id":718,"source":"idebate","title":"Cultural relativism and adapting to conflict"},{"id":722,"source":"idebate","title":"Making children military targets"},{"id":725,"source":"idebate","title":"Amnesties are the only long term solution"},{"id":726,"source":"idebate","title":"Migrants benefit the economy"},{"id":727,"source":"idebate","title":"Immigrants are needed to make up for aging populations"},{"id":728,"source":"idebate","title":"An amnesty rewards law breakers"},{"id":729,"source":"idebate","title":"Amnesties are unpopular; governments need to get tougher if they want to be reelected."},{"id":730,"source":"idebate","title":"An amnesty would encourage rather than reduce immigration"},{"id":731,"source":"idebate","title":"Marketing aimed at children should be subject to strict regulations."},{"id":735,"source":"idebate","title":"This ban constitutes serious governmental intrusion into parental responsibilities and private choices.  "},{"id":736,"source":"idebate","title":"The ban is ineffective in addressing the problem of obesity. "},{"id":737,"source":"idebate","title":"Such bans are easy to side step. "},{"id":738,"source":"idebate","title":"Further protections are required to grant migrants full human rights."},{"id":739,"source":"idebate","title":"Migrants ought to have a right to family reunification."},{"id":740,"source":"idebate","title":"An international regulatory body should exist for global migration."},{"id":741,"source":"idebate","title":"Protections would benefit the economies of receiving as well as source countries."},{"id":742,"source":"idebate","title":"Economic and social protections prevent the exploitation of migrants."},{"id":745,"source":"idebate","title":"Receiving countries should not and cannot afford to further protect migrants because they often free ride on health, education, and welfare systems."},{"id":746,"source":"idebate","title":"Protections of migrants will hurt the economies of receiving countries by overcrowding them and taking away jobs from citizens."},{"id":747,"source":"idebate","title":"Protection of migrants causes “brain drain,” which further damages the economies of source countries."},{"id":748,"source":"idebate","title":"Sponsorship is better than other kinds of charity because it is a long term commitment."},{"id":749,"source":"idebate","title":"Child sponsorship brings about greater understanding between people from different countries and cultures."},{"id":750,"source":"idebate","title":"Sponsorship also contributes to all aspects of life."},{"id":751,"source":"idebate","title":"Sponsorship is a good way of getting people who otherwise wouldn't give to charity to donate their money."},{"id":752,"source":"idebate","title":"Sponsorship is an inefficient way of giving to charity."},{"id":755,"source":"idebate","title":"Having children has a devastating effect on lives of parents"},{"id":756,"source":"idebate","title":"Having children is emotionally draining for parents"},{"id":757,"source":"idebate","title":"Having children is extraordinarily expensive"},{"id":758,"source":"idebate","title":"It is morally wrong to bring children to this cruel and miserable world."},{"id":759,"source":"idebate","title":"Not having children is environmentally friendly"},{"id":760,"source":"idebate","title":"Not having children promotes gender equality"},{"id":761,"source":"idebate","title":"Having children is our duty and responsibility"},{"id":762,"source":"idebate","title":"Having children is the essence of existence for every creature"},{"id":763,"source":"idebate","title":"Having children guarantees support for parents"},{"id":764,"source":"idebate","title":"The act of having children makes people more desirable citizens."},{"id":765,"source":"idebate","title":"Housewives are entitled to pay"},{"id":766,"source":"idebate","title":"Paying housewives promotes more positive images of women and family life"},{"id":767,"source":"idebate","title":"Paying housewives for their work is an important form of economic empowerment."},{"id":769,"source":"idebate","title":"Paying housewives reduces social mobility"},{"id":770,"source":"idebate","title":"Paying housewives is financially impractical."},{"id":771,"source":"idebate","title":"Privatising social security would improve economic growth"},{"id":772,"source":"idebate","title":"Privatising social security will increase the amount of money that reitrees can draw on"},{"id":774,"source":"idebate","title":"Privatising social security will harm retirees"},{"id":775,"source":"idebate","title":"Privatising the social security system would harm economic growth"},{"id":776,"source":"idebate","title":"The problems with the social security are systemic, not inherent"},{"id":777,"source":"idebate","title":"Profiling is effective and necessary: "},{"id":778,"source":"idebate","title":"Profiling is consistent with individual rights: "},{"id":779,"source":"idebate","title":"Profiling is preferable to the alternatives: "},{"id":780,"source":"idebate","title":"Profiling is ineffective at increasing security: "},{"id":781,"source":"idebate","title":"Profiling is racist: "},{"id":782,"source":"idebate","title":"Profiling will increase terrorism not combat it: "},{"id":784,"source":"idebate","title":"The courts have a duty to develop services that will meet the needs of society"},{"id":785,"source":"idebate","title":"Property rights for cohabiting couples will undermine the institution of marriage"},{"id":786,"source":"idebate","title":"Legal supervision will discourage independent planning"},{"id":789,"source":"idebate","title":"Hate crime enhancements unfairly punish equal offences differently"},{"id":791,"source":"idebate","title":"Hate crime enhancements cause inter-community tensions"},{"id":792,"source":"idebate","title":"Hate crimes uniquely harm through terror"},{"id":793,"source":"idebate","title":"Hate crime enhancements help prevent hate crimes"},{"id":796,"source":"idebate","title":"Consent Laws are discriminatory. "},{"id":798,"source":"idebate","title":"Age of consent laws prevent the most vulnerable receiving contraceptives. "},{"id":801,"source":"idebate","title":"Lowering the age of consent will cause criminal dangers. "},{"id":802,"source":"idebate","title":"The foetus feels pain"},{"id":803,"source":"idebate","title":"If personhood accrues at birth, then abortion after inducing birth is wrong"},{"id":804,"source":"idebate","title":"Abortion is wrong per se when there are alternatives such as adoption"},{"id":805,"source":"idebate","title":"Banning partial birth abortions is in line with popular and accepted moral standards"},{"id":806,"source":"idebate","title":"The concept of \"foetal rights\" is an attack on the autonomy of women"},{"id":808,"source":"idebate","title":"Partial birth abortions are safer than any available alternative"},{"id":809,"source":"idebate","title":"Does not provide any more of a stable environment for child rearing than a regular monogamous relationship"},{"id":810,"source":"idebate","title":"Unreasonable commitment to expect of people"},{"id":813,"source":"idebate","title":"Undermines same-sex couples and single parent families as legitimate ways of raising children"},{"id":814,"source":"idebate","title":"Removes the transient and casual aspects of a monogamous relationship, thus giving a child a far more stable environment. "},{"id":815,"source":"idebate","title":"Remarriage rate shows that even people who go through failed marriages retain faith in the institution of marriage"},{"id":816,"source":"idebate","title":"Marriage represents a legal bond which protects both parties in a relationship"},{"id":817,"source":"idebate","title":"Marriage is an important institution to religious people"},{"id":818,"source":"idebate","title":"Marriage promotes a better way to raise children"},{"id":819,"source":"idebate","title":"When you know terrorists are likely to be members of particular national and ethnic groups, it is simply more practical to focus searches on those groups."},{"id":820,"source":"idebate","title":"Profiling would have caught many of the perpetrators of terrorism in recent years."},{"id":821,"source":"idebate","title":"The experience of Israel proves that profiling works "},{"id":822,"source":"idebate","title":"Profiling is simply institutionalizing racism an reduces minorities to the status of second class citizens "},{"id":824,"source":"idebate","title":"Profiling exacerbates terrorism as it reinforces the perception that Muslims and marginalised ethnic groups face prejudice."},{"id":825,"source":"idebate","title":"Feminism Has Plenty More To Achieve"},{"id":826,"source":"idebate","title":"Males Still Dominate the Top Positions"},{"id":829,"source":"idebate","title":"The Feminist Cause No Longer Appeals to Women"},{"id":831,"source":"idebate","title":"Gender equality"},{"id":832,"source":"idebate","title":"The policy will help alleviate the social problems arising from the imbalance"},{"id":836,"source":"idebate","title":"Commodifying women. "},{"id":838,"source":"idebate","title":"Financial incentives do not break down cultural bias"},{"id":840,"source":"idebate","title":"Genetic testing ensures the best quality of life for children vulnerable to heritable diseases"},{"id":841,"source":"idebate","title":"Parents have a right to acquire and act upon medical information"},{"id":842,"source":"idebate","title":"Liberal societies have a duty to minimise avoidable suffering that might affect their members"},{"id":843,"source":"idebate","title":"Genetic screening may lead the marginalisation of those living with genetic disorders"},{"id":844,"source":"idebate","title":"A screening culture may lead to the value of human life becoming distorted"},{"id":848,"source":"idebate","title":"Reduced dialogue"},{"id":852,"source":"idebate","title":"Universities are bastions of free expression"},{"id":853,"source":"idebate","title":"Freedom of expression is a means to education"},{"id":854,"source":"idebate","title":"Freedom of expression is a political right"},{"id":855,"source":"idebate","title":"Gender selection will prevent incidents of infanticide"},{"id":857,"source":"idebate","title":"Parents should have freedom of choice"},{"id":858,"source":"idebate","title":"Sex-specific, generic diseases can be avoided"},{"id":859,"source":"idebate","title":"Pre-selection of gender uses expensive medical care for frivolous purposes"},{"id":860,"source":"idebate","title":"Children should not be designed to specifications"},{"id":861,"source":"idebate","title":"The lottery of childbirth should not be interfered with"},{"id":863,"source":"idebate","title":"Patenting enables knowledge sharing"},{"id":865,"source":"idebate","title":"Patenting inhibits research and therapeutics"},{"id":868,"source":"idebate","title":"Where same-sex households exist, they should have equal rights as opposite-sex households."},{"id":869,"source":"idebate","title":"There is no fact-based evidence for this exclusion."},{"id":870,"source":"idebate","title":"Gay adoption bans amount to state sponsored discrimination against gay people."},{"id":873,"source":"idebate","title":"The government's interest in protecting traditional families."},{"id":876,"source":"idebate","title":"Illegal immigration is facilitated by criminal networks"},{"id":879,"source":"idebate","title":"States have the sovereign right to control their own borders."},{"id":882,"source":"idebate","title":"Repatriation poses a danger for illegal immigrants"},{"id":883,"source":"idebate","title":"Repatriation is immoral"},{"id":893,"source":"idebate","title":"National “feel-good factor”"},{"id":898,"source":"idebate","title":"Legacy of infrastructure"},{"id":900,"source":"idebate","title":"Helps small businesses"},{"id":903,"source":"idebate","title":"Showcasing countries with poor human rights records"},{"id":904,"source":"idebate","title":"It is good for the development of home-grown players and therefore, the quality of domestic leagues "},{"id":905,"source":"idebate","title":"It will improve the quality of the national team"},{"id":906,"source":"idebate","title":"It will encourage fans to support their local clubs"},{"id":910,"source":"idebate","title":"Restrictions are unnecessary"},{"id":914,"source":"idebate","title":"Playoffs Lead To More Exposure"},{"id":916,"source":"idebate","title":"Playoffs Result in More Injuries and Hurt Academics"},{"id":917,"source":"idebate","title":"Playoffs Would Not Benefit Fans"},{"id":920,"source":"idebate","title":"Boycotting Euro 2012 is proportional"},{"id":926,"source":"idebate","title":"Banning countries with harsh training measures from competing would be a strong deterrent"},{"id":927,"source":"idebate","title":"The suffering of those who are treated to harsh training outweighs banning the team"},{"id":929,"source":"idebate","title":"The IAAF and the Athletics commission have the highest burden to protect their athletes."},{"id":930,"source":"idebate","title":"Harsh training methods aren’t necessarily abusive."},{"id":935,"source":"idebate","title":"Increased media coverage creates more role models for young girls to engage in sport."},{"id":936,"source":"idebate","title":"Increased media coverage will lead to increased funding towards women’s sport"},{"id":937,"source":"idebate","title":"Men’s sports are more popular than women’s and so should receive more media coverage."},{"id":938,"source":"idebate","title":"Women’s sports do not provide the same economic incentives for media coverage as men’s."},{"id":940,"source":"idebate","title":"Chess ought to qualify as an Olympic sport"},{"id":942,"source":"idebate","title":"Chess is proven to have great cognitive benefits: increasing its support is objectively good"},{"id":943,"source":"idebate","title":"Chess is highly popular and should be represented"},{"id":948,"source":"idebate","title":"Athletes should decide for themselves."},{"id":949,"source":"idebate","title":"Preventing discrimination in sport"},{"id":950,"source":"idebate","title":"Encouraging future female athletes"},{"id":952,"source":"idebate","title":"There will be a negative effect on women’s leagues"},{"id":955,"source":"idebate","title":"Translation allows greater participation by academics in global academia and global marketplace of ideas"},{"id":956,"source":"idebate","title":"Translation gives access to students to learn valuable information and develop their human capital and to become academically and economically competitive"},{"id":957,"source":"idebate","title":"Translation expands the knowledge base of citizens to help solve local problems"},{"id":958,"source":"idebate","title":"It is better to have fewer languages in common use in global academic and economic interrelations"},{"id":959,"source":"idebate","title":"The West has no particular obligation to undergo such a sweeping policy"},{"id":960,"source":"idebate","title":"It is prohibitively expensive to translate everything and difficult to prioritize what to translate"},{"id":961,"source":"idebate","title":"If the public funds a product it belongs to them"},{"id":963,"source":"idebate","title":"Creative commons allows existing work to be used as a building block by others"},{"id":964,"source":"idebate","title":"Government, like everyone else, should be able to profit from its work, that profit benefits its citizens rather than harming them"},{"id":965,"source":"idebate","title":"Creative commons is not a good option for many government works"},{"id":967,"source":"idebate","title":"People have a right to know where their information comes from"},{"id":970,"source":"idebate","title":"Legally requiring disclosure from all benefits think tanks"},{"id":971,"source":"idebate","title":"Think tanks may become smoke screens for criminal groups"},{"id":972,"source":"idebate","title":"Think tanks should be able to choose not to know who funds them"},{"id":973,"source":"idebate","title":"Overregulating think tanks sets a dangerous precedent"},{"id":974,"source":"idebate","title":"Being subject to scrutiny discourages investors from supporting good projects"},{"id":975,"source":"idebate","title":"Think tanks should be assessed by the value of their ideas, not by who funds them"},{"id":976,"source":"idebate","title":"Private investors have a right to privacy"},{"id":978,"source":"idebate","title":"Reducing hate speech."},{"id":979,"source":"idebate","title":"Reducing currently illegal activity."},{"id":980,"source":"idebate","title":"Reducing fraud using fake identities."},{"id":981,"source":"idebate","title":"Damaging to freedom of speech. "},{"id":986,"source":"idebate","title":"You are not going to be arrested because the government has access to your communications"},{"id":991,"source":"idebate","title":"Abuse of information and power by intelligence agencies"},{"id":993,"source":"idebate","title":"Loss of Privacy"},{"id":995,"source":"idebate","title":"Damages diplomatic relations with allies"},{"id":1001,"source":"idebate","title":"Facebook encourages socialisation"},{"id":1002,"source":"idebate","title":"Facebook provides an information point"},{"id":1003,"source":"idebate","title":"Facebook is good for democracy"},{"id":1004,"source":"idebate","title":"Facebook is bad for life satisfaction"},{"id":1005,"source":"idebate","title":"Facebook has some dangerous consequences"},{"id":1006,"source":"idebate","title":"Facebook has a negative impact on learning"},{"id":1007,"source":"idebate","title":"It is unfair for people to suffer for silly past mistakes"},{"id":1009,"source":"idebate","title":"People suffer disproportional consequences on the internet"},{"id":1011,"source":"idebate","title":"This right relieves people of the need to act responsibility online"},{"id":1013,"source":"idebate","title":"Free speech is not useful in this context, as riot is never legitimate in a free society"},{"id":1015,"source":"idebate","title":"Would stop riots from spreading"},{"id":1018,"source":"idebate","title":"Blocking social networks denies people the ability to mobilize on genuine social issues"},{"id":1019,"source":"idebate","title":"Police should not block the communications and freedom of expression of law-abiding citizens"},{"id":1021,"source":"idebate","title":"It is better to monitor riots through the social media rioters are using"},{"id":1022,"source":"idebate","title":"Anonymity software helps to guarantee protection for people involved in uprisings"},{"id":1028,"source":"idebate","title":"Aiding of the agents of chaos will allow the government to discredit the uprisings as being instigated and abetted by the West"},{"id":1030,"source":"idebate","title":"Academic work produced by means of public funds belongs to the public"},{"id":1031,"source":"idebate","title":"Research produced with public funding is too important to be left in the hands of universities alone"},{"id":1032,"source":"idebate","title":"The opening up of information to the public encourages further research and development"},{"id":1033,"source":"idebate","title":"A publicly-funded inventor or researcher still deserves to profit from their efforts"},{"id":1034,"source":"idebate","title":"It reduces the ability of universities to be self-sufficient and to fund other less potentially profitable pursuits"},{"id":1035,"source":"idebate","title":"The disincentive to take public funding will stifle advancement in valuable fields that rely on the university infrastructure"},{"id":1036,"source":"idebate","title":"Gambling is bad for you."},{"id":1037,"source":"idebate","title":"Online gambling affects families"},{"id":1038,"source":"idebate","title":"Gambling is addictive."},{"id":1039,"source":"idebate","title":"Online gambling encourages crime"},{"id":1040,"source":"idebate","title":"Personal freedom"},{"id":1041,"source":"idebate","title":"Cant enforce an online gambling ban"},{"id":1044,"source":"idebate","title":"Government only objects to online gambling because they dont benefit"},{"id":1045,"source":"idebate","title":"Opens up education"},{"id":1046,"source":"idebate","title":"Most universities are publically funded so should have to be open with their materials."},{"id":1047,"source":"idebate","title":"Openness benefits research and the economy"},{"id":1048,"source":"idebate","title":"Students would be able to benefit from being able to use resources at other universities"},{"id":1049,"source":"idebate","title":"Universities deserve to profit from their work"},{"id":1050,"source":"idebate","title":"Making everything free to access will damage universities ability to tap private funding"},{"id":1051,"source":"idebate","title":"Less incentive to study at university"},{"id":1054,"source":"idebate","title":"It is legitimate to undermine illegitimate governments to promote human rights"},{"id":1056,"source":"idebate","title":"It is legitimate to enable freedom"},{"id":1058,"source":"idebate","title":"Governments enable censorship to protect their citizens"},{"id":1060,"source":"idebate","title":"Aggressive foreign policy is not legitimate foreign policy"},{"id":1061,"source":"idebate","title":"Sanctions are a proportionate response"},{"id":1062,"source":"idebate","title":"Sanctions can be targeted"},{"id":1063,"source":"idebate","title":"There needs to be action to deter more cyber attacks"},{"id":1064,"source":"idebate","title":"Sanctions will prevent escalation in cyber conflict"},{"id":1067,"source":"idebate","title":"Sanctions won't work"},{"id":1068,"source":"idebate","title":"Sanctions won't harm the hackers"},{"id":1069,"source":"idebate","title":"Monitoring prevents cyberbullying."},{"id":1070,"source":"idebate","title":"Monitoring allows parents to correct children who are wasting their time. "},{"id":1071,"source":"idebate","title":"Monitoring decreases children’s involvement with pornography. "},{"id":1072,"source":"idebate","title":"Monitoring raises digital awareness among parents."},{"id":1073,"source":"idebate","title":"This proposal is simply an invasion of privacy. "},{"id":1074,"source":"idebate","title":"Monitoring is lazy parenting. "},{"id":1076,"source":"idebate","title":"Monitoring is a hindrance to forming relationships both outside and inside the family."},{"id":1077,"source":"idebate","title":"Those in power need to be held to account"},{"id":1078,"source":"idebate","title":"It’s what the public want to know about"},{"id":1080,"source":"idebate","title":"Those in public positions deserve the same privacy rights as the general public"},{"id":1081,"source":"idebate","title":"Unrestricted scrutiny into private lives could be a detriment to democracy"},{"id":1082,"source":"idebate","title":"The media could be endangering peoples’ mental and physical health."},{"id":1083,"source":"idebate","title":"The right to privacy is not absolute and is sacrificed in standing for public office"},{"id":1084,"source":"idebate","title":"Citizens have a right to know who is being elected to represent them"},{"id":1085,"source":"idebate","title":"Heavy scrutiny forces politicians to dedicate themselves fully to their public service"},{"id":1086,"source":"idebate","title":"Heavy scrutiny serves to challenge existing power structures"},{"id":1087,"source":"idebate","title":"All individuals have a legitimate right to privacy"},{"id":1088,"source":"idebate","title":"Fixating on personal lives results in infringing the rights of more than just the politicians themselves"},{"id":1089,"source":"idebate","title":"The private lives of politicians are a harmful distraction for the media"},{"id":1091,"source":"idebate","title":"These people are under serious threat for their pursuit of justice"},{"id":1092,"source":"idebate","title":"Democracies have an obligation to shield these people and to encourage further dissent"},{"id":1093,"source":"idebate","title":"This offer of amnesty serves as a powerful public statement in favour of free speech and rule of law"},{"id":1094,"source":"idebate","title":"An amnesty policy will serve only to alienate regimes, shutting down the possibility of discourse or reform"},{"id":1096,"source":"idebate","title":"The offer of amnesty allows home governments to discredit bloggers and paint them as foreign agents of disruption"},{"id":1097,"source":"idebate","title":"Democracies should be wary of meddling in the internal affairs of other countries"},{"id":1099,"source":"idebate","title":"Lengthy copyright protection is extremely inefficient for the dissemination of works"},{"id":1100,"source":"idebate","title":"Long copyrights serve to severely limit access by the public to creative works"},{"id":1101,"source":"idebate","title":"Long copyright stifles creative responses to and re-workings of the original work"},{"id":1103,"source":"idebate","title":"Control of an artistic work and its interaction in the public sphere is the just province of the creator and his or her designated successors"},{"id":1104,"source":"idebate","title":"Artists often rely on copyright protection to support dependents and family after, including after they are dead"},{"id":1109,"source":"idebate","title":"This ban would have a powerful signalling effect expressing disapproval of non-democracies' system of government"},{"id":1111,"source":"idebate","title":"It is hypocritical for democratic governments to utilize surveillance technology to watch their own people while denying that technology to others"},{"id":1112,"source":"idebate","title":"This ban will alienate non-democracies from discourse and stifle reform efforts"},{"id":1113,"source":"idebate","title":"The inability to use advanced technologies merely forces non-democracies to utilize more unsavoury methods to achieve their aims"},{"id":1114,"source":"idebate","title":"This advertising strategy undermines people’s right to personal privacy"},{"id":1117,"source":"idebate","title":"Individual targeting undermines market and political fairness"},{"id":1119,"source":"idebate","title":"It is legitimate to utilize this sort of information for advertising "},{"id":1120,"source":"idebate","title":"This advertising strategy provides benefits by making marketing more efficient and allows smaller markets to develop"},{"id":1121,"source":"idebate","title":"The information age demands a right to broadband access"},{"id":1122,"source":"idebate","title":"It would provide an efficient service for everyone"},{"id":1123,"source":"idebate","title":"Broad-based access to broadband is essential for countries to be competitive and to excel"},{"id":1125,"source":"idebate","title":"State intervention would crowd out private firms"},{"id":1126,"source":"idebate","title":"The state can work more effectively through the private sector"},{"id":1130,"source":"idebate","title":"It makes it more difficult for extremists to organize and spread their message when blocked"},{"id":1131,"source":"idebate","title":"Blocking these sites makes it more difficult for extremist groups to coordinate extremist action in the real world"},{"id":1133,"source":"idebate","title":"Everyone, even extremists, deserve their freedom of expression protected"},{"id":1134,"source":"idebate","title":"ISPs should be required to maintain Net Neutrality"},{"id":1136,"source":"idebate","title":"Blocking extremists will make anti-terrorism surveillance more difficult as the organizations go underground"},{"id":1138,"source":"idebate","title":"Collecting and selling personal information is a major violation of privacy"},{"id":1139,"source":"idebate","title":"Consumers tend to feel alienated by spreading of their personal information for profit"},{"id":1141,"source":"idebate","title":"The sale of personal data makes for better advertising that benefits consumers"},{"id":1142,"source":"idebate","title":"The sort of information being kept and sold is legitimate for firms to utilize in this fashion"},{"id":1143,"source":"idebate","title":"The storing and sale of personal data aids companies by making marketing more efficient and allows niche markets to thrive"},{"id":1145,"source":"idebate","title":"The default of total copyright is harmful to the spreading of information and experience"},{"id":1146,"source":"idebate","title":"The creative commons is a more effective means for artists to build and expand their reach and markets than traditional copyright licensing arrangements"},{"id":1147,"source":"idebate","title":"The costs of monitoring copyright by states, artists, and lawyers far outweigh the benefits, and is often simply ineffective"},{"id":1148,"source":"idebate","title":"Artists have a fundamental property right over their creative output"},{"id":1149,"source":"idebate","title":"Artists should retain the right to control their work’s interaction with the public space even if their work is publicly funded"},{"id":1151,"source":"idebate","title":"Artists often rely on copyright protection to financially support themselves and their families"},{"id":1153,"source":"idebate","title":"Educating in their mother tongue is the best option for children’s education "},{"id":1157,"source":"idebate","title":"Services offered the government cannot be used if the user does not know the language "},{"id":1159,"source":"idebate","title":"Forced evictions are necessary to change perceptions."},{"id":1160,"source":"idebate","title":"Forced evictions are a natural path of development."},{"id":1161,"source":"idebate","title":"Forced evictions are a means to control rapid urbanisation and gain global city status."},{"id":1162,"source":"idebate","title":"Forced evictions will create cities without slums in the long-run. "},{"id":1163,"source":"idebate","title":"Forced evictions pave the road for African cities to set a trend towards Eco-Cities."},{"id":1164,"source":"idebate","title":"African cities should not aim for ‘global city’ status."},{"id":1165,"source":"idebate","title":"Forced evictions are political land grabbing. "},{"id":1166,"source":"idebate","title":"Forced evictions are inhumane, and make state violence an increasing reality in African cities."},{"id":1168,"source":"idebate","title":"The housing crisis is unresolved by forced evictions. "},{"id":1169,"source":"idebate","title":"Democracy must be representative"},{"id":1170,"source":"idebate","title":"Feminising the state: women helping women"},{"id":1182,"source":"idebate","title":"There is a very real controversy regarding the origin and development of life, and children deserve to hear both sides."},{"id":1184,"source":"idebate","title":"Much of the complexity of life cannot be explained by evolution, but is perfectly explained by Creationism."},{"id":1185,"source":"idebate","title":"Creationism is as valid a scientific theory as those of evolution and abiogenesis, and should therefore be given equal time in the classroom."},{"id":1186,"source":"idebate","title":"Communities should have a say in what is taught in schools, and many communities want to teach creationism."},{"id":1187,"source":"idebate","title":"The scientific community as a whole overwhelmingly rejects Creationism."},{"id":1188,"source":"idebate","title":"Education should be about truth and facts, not dogma and faith."},{"id":1189,"source":"idebate","title":"There is no empirical evidence supporting Creationism, whereas all evidence supports abiogenesis and evolution."},{"id":1191,"source":"idebate","title":"Intelligence is necessary for the safety of the public."},{"id":1192,"source":"idebate","title":"Domestic intelligence operates just like the police do."},{"id":1193,"source":"idebate","title":"There is sufficient political and judicial control over intelligence service"},{"id":1194,"source":"idebate","title":"Domestic intelligence services are the only organization that is capable of performing counterintelligence"},{"id":1195,"source":"idebate","title":"The government does not have the right to spy on its citizens"},{"id":1196,"source":"idebate","title":"Domestic intelligence agencies cannot be controlled"},{"id":1197,"source":"idebate","title":"Intelligence agencies inflate threats."},{"id":1198,"source":"idebate","title":"Wiretapping is a highly effective method which helps to prevent serious crime and secure convictions for criminals."},{"id":1199,"source":"idebate","title":"Intercepted evidence could be incredibly useful for both prosecution and defence cases in many trials."},{"id":1200,"source":"idebate","title":"Countries which do not allow intercept evidence have created a contradictory, rather than transparent, set of legal boundaries."},{"id":1201,"source":"idebate","title":"Intercept evidence deals particularly well with cases of conspiracy and criminal gangs which have a widespread network."},{"id":1203,"source":"idebate","title":"Wiretapping can actually threaten the success of intelligence services in preventing crime and helping to prove criminals guilty."},{"id":1204,"source":"idebate","title":"Intercept evidence is simply not reliable enough to be effective evidence in court."},{"id":1206,"source":"idebate","title":"Internet anonymity enables citizens to exercise their right to free speech"},{"id":1207,"source":"idebate","title":"Internet anonymity allows people to speak the truth without fearing harm to their careers"},{"id":1208,"source":"idebate","title":"Internet anonymity allows people to experiment and construct with new social identities"},{"id":1209,"source":"idebate","title":"Internet anonymity allows internet users to engage in illegal activities "},{"id":1210,"source":"idebate","title":"Internet anonymity leads to spam"},{"id":1211,"source":"idebate","title":"Internet anonymity increases cyberbullying and trolling"},{"id":1212,"source":"idebate","title":"3D printers promote uncontrolled consumerism"},{"id":1213,"source":"idebate","title":"Private 3D printers make it impossible to regulate illegal products"},{"id":1214,"source":"idebate","title":"Technology should not circumvent consumer protection laws"},{"id":1215,"source":"idebate","title":"Household 3D printing can, in the short term, destroy developing economies"},{"id":1216,"source":"idebate","title":"Solid piracy will become as problematic as virtual piracy"},{"id":1217,"source":"idebate","title":"Democratising manufacturing gives people more freedom"},{"id":1218,"source":"idebate","title":"Banning 3D printers wastes a chance for innovation"},{"id":1219,"source":"idebate","title":"Household 3D printers would reduce the environmental harms of consuming"},{"id":1220,"source":"idebate","title":"3D printing opens the doors to a post-scarcity society"},{"id":1221,"source":"idebate","title":"The state should refrain from imposing bans"},{"id":1222,"source":"idebate","title":"Technology will lead job growth for youths."},{"id":1223,"source":"idebate","title":"Technology has driven youths to identify new markets"},{"id":1224,"source":"idebate","title":"Technology is building a platform for sharing ideas."},{"id":1226,"source":"idebate","title":"Technology has enabled Africa’s cultural industries to grow. "},{"id":1227,"source":"idebate","title":"Technology will not result in entrepreneurialism without providing a foundational basis. "},{"id":1228,"source":"idebate","title":"The technological revolution has been hyped."},{"id":1229,"source":"idebate","title":"Technology remains insecure and a security risk."},{"id":1230,"source":"idebate","title":"Technology has only benefited private companies."},{"id":1231,"source":"idebate","title":"Cyber attacks are no different from traditional attacks "},{"id":1232,"source":"idebate","title":"Cyber attacks can do serious damage to the state"},{"id":1235,"source":"idebate","title":"Cyber attacks are difficult to trace "},{"id":1236,"source":"idebate","title":"Definition of a large scale cyber attack is extremely vague "},{"id":1237,"source":"idebate","title":"Cutting off bit of children’s  bodies for no apparent reason is simply wrong "},{"id":1238,"source":"idebate","title":"There is always a risk associated with surgery and taking such a risk for no particular reason is irresponsible "},{"id":1239,"source":"idebate","title":"In any other situation involving minors a precautionary principle would be applied "},{"id":1240,"source":"idebate","title":"There is no proven cause of harm and parents routinely make medical decisions for children to give their consent or otherwise"},{"id":1241,"source":"idebate","title":"A practice that is thousands of years old and has not been found to cause harm during that time is unlikely to now "},{"id":1242,"source":"idebate","title":"Parents have the right to use their best judgment, in the light of medical advice, as to what is in the best interest of their child "},{"id":1243,"source":"idebate","title":"Peoples’ rights to freedom of worship would be undermined if they were compelled to work on a Sunday"},{"id":1244,"source":"idebate","title":"A shared day when there is no commercial activity encourages family life and recreation "},{"id":1245,"source":"idebate","title":"Compelling employers to close for a day is the only way to ensure that marginalised groups are not forced to work a seven day week "},{"id":1246,"source":"idebate","title":"People should be allowed to take their leisure at their own convenience and not on the basis of religious decree "},{"id":1247,"source":"idebate","title":"It is prejudicial to other religions to give Sunday a significance not ascribed to the holy days of other traditions "},{"id":1248,"source":"idebate","title":"It is simply unfair to force low-paid workers to lose a day’s work if they do not choose to do so "},{"id":1249,"source":"idebate","title":"The veil is a symbol of oppression on women"},{"id":1252,"source":"idebate","title":"A ban would be easy to enforce"},{"id":1253,"source":"idebate","title":"A ban on the veil is just a way of targeting Muslims"},{"id":1254,"source":"idebate","title":"It’s a personal matter – it doesn’t concern others"},{"id":1255,"source":"idebate","title":"If you ban it, you have to ban everything else"},{"id":1256,"source":"idebate","title":"It’s their culture and religion"},{"id":1258,"source":"idebate","title":"Because religion combines dogmatic certainty with the existence of the afterlife, violence and death is all too easy to justify"},{"id":1259,"source":"idebate","title":"Regardless of the protestations of some there is no major religion that has not been involved in persecuting non-believers at some point in its history and most still are"},{"id":1260,"source":"idebate","title":"Religious organisations remind societies and the world that there are other important things in life beyond economics and that moral and other concerns should be taken into account in public life"},{"id":1261,"source":"idebate","title":"Religious ceremonies and organisations provide solace and celebration for the great changes in life such as birth, marriage and death, there is democratic support for this around the world"},{"id":1262,"source":"idebate","title":"Religious organisations are by far the largest providers of charity in the world"},{"id":1263,"source":"idebate","title":"Many symbols are seen as a symbol of oppression on women."},{"id":1264,"source":"idebate","title":"Religious symbols cause problems in schools."},{"id":1265,"source":"idebate","title":"Religious symbols cause division within Western society."},{"id":1266,"source":"idebate","title":"A ban would be simple to enforce."},{"id":1268,"source":"idebate","title":"Banning religious symbols is just a way of unfairly targeting people."},{"id":1269,"source":"idebate","title":"Religious symbols are personal, therefore, they should not matter to others."},{"id":1270,"source":"idebate","title":"If you ban one thing, you have to ban lots of things."},{"id":1272,"source":"idebate","title":"Religious belief is completely irrational"},{"id":1274,"source":"idebate","title":"The God hypothesis is unnecessary "},{"id":1275,"source":"idebate","title":"Religions have no true claim to special moral knowledge"},{"id":1280,"source":"idebate","title":"People have a right to freedom of religion. "},{"id":1286,"source":"idebate","title":"Causes divisions in society. "},{"id":1287,"source":"idebate","title":"The church’s involvement undermines the role of the state. "},{"id":1288,"source":"idebate","title":"Separation would show acceptance of other religions. "},{"id":1289,"source":"idebate","title":"Separation would show non-religious people that their contributions to the state are valued. "},{"id":1291,"source":"idebate","title":"Separating Church and State in England would be harmful to national identity. "},{"id":1292,"source":"idebate","title":"Separation would create animosity towards immigrants and non-Christians. "},{"id":1296,"source":"idebate","title":"A utilitarian approach will result in a decision that saves the largest number of lives possible."},{"id":1297,"source":"idebate","title":"Give a choice, all rational individuals would prefer to live in a world in which behaviour prefered the choice to sacrifice one to save many"},{"id":1298,"source":"idebate","title":"The harms related to a death extend beyond the loss of life"},{"id":1299,"source":"idebate","title":"It is worse to actively participate in a death then to simply allow an individual to die"},{"id":1300,"source":"idebate","title":"We cannot make value judgments as to who should and should not be marked for death or for salvation"},{"id":1301,"source":"idebate","title":"Intuitively, it is possible to understand that participating in a decision to kill is a priori wrong"},{"id":1303,"source":"idebate","title":"The act of killing can wreak immense psychological damage upon rational individuals"},{"id":1305,"source":"idebate","title":"Museums preserve and display our heritage and therefore should be accessible to all of the public free of charge"},{"id":1307,"source":"idebate","title":"Free museums encourage attendance"},{"id":1309,"source":"idebate","title":"If state-funded, there is little incentive to increase numbers of visitors"},{"id":1311,"source":"idebate","title":"State funding should be used elsewhere"},{"id":1313,"source":"idebate","title":"Celibacy reduces the pool of people wanting to become priests"},{"id":1319,"source":"idebate","title":"Separation of state and religion"},{"id":1321,"source":"idebate","title":"Removing under god would promote religious tolerance"},{"id":1322,"source":"idebate","title":"Prevents the marginalisation of non-believers"},{"id":1323,"source":"idebate","title":"Prevents the coercion of school children"},{"id":1324,"source":"idebate","title":"“Under God” is part of American tradition and history"},{"id":1325,"source":"idebate","title":"Associates change and, by extension, anti-nationalism with atheism"},{"id":1326,"source":"idebate","title":"Likely to be seen as a state sanctioned condemnation of religion"},{"id":1327,"source":"idebate","title":"The American people would be against the change"},{"id":1329,"source":"idebate","title":"Homosexuality exists in nature and is therefore part of God’s plan"},{"id":1332,"source":"idebate","title":"The Church has adapted before, it can adapt now"},{"id":1333,"source":"idebate","title":"Homosexuality is a sin in the Bible"},{"id":1334,"source":"idebate","title":"The Church condemns all sex outside of marriage, hetero or homosexual in nature"},{"id":1335,"source":"idebate","title":"Ordination is not a right. "},{"id":1336,"source":"idebate","title":"Online courses are more convenient for students than traditional university"},{"id":1337,"source":"idebate","title":"Online courses broadens access to education"},{"id":1338,"source":"idebate","title":"Online courses are a way to higher academic excellence"},{"id":1339,"source":"idebate","title":"Online courses would allow universities to use more resources on teaching and research"},{"id":1340,"source":"idebate","title":"Online courses encourage sharing of academic information"},{"id":1341,"source":"idebate","title":"Financial model of online courses is unsustainable "},{"id":1342,"source":"idebate","title":"Online courses make it impossible to ensure academic honesty"},{"id":1343,"source":"idebate","title":"Online courses undermine live communication with professors and other students"},{"id":1344,"source":"idebate","title":"Online courses undermine society life of the university"},{"id":1347,"source":"idebate","title":"Building productive capacity through increasing revenue "},{"id":1348,"source":"idebate","title":"A fair tax"},{"id":1349,"source":"idebate","title":"Halting the technological revolution"},{"id":1350,"source":"idebate","title":"Taxes cannot be justified while the network is poor"},{"id":1351,"source":"idebate","title":"Quick-fix policies: a failing model of implementation"},{"id":1352,"source":"idebate","title":"Easily affordable drugs will mean greater access"},{"id":1353,"source":"idebate","title":"Savings can be used in other sections of medical care"},{"id":1354,"source":"idebate","title":"Reduce the prominence of bad and fake drugs"},{"id":1356,"source":"idebate","title":"Dominance of generic drugs will reduce reinvestment and innovation in donating countries"},{"id":1357,"source":"idebate","title":"Cheaper drugs aren’t trusted by consumers"},{"id":1360,"source":"idebate","title":"No chance of an agreement with the USA"},{"id":1361,"source":"idebate","title":"Doing nothing makes Merkel and Germany look weak"},{"id":1362,"source":"idebate","title":"Damages US-German relations"},{"id":1365,"source":"idebate","title":"Animals shouldn’t be harmed"},{"id":1366,"source":"idebate","title":"Animal research causes severe harm to the animals involved"},{"id":1367,"source":"idebate","title":"It isn’t necessary"},{"id":1369,"source":"idebate","title":"It would send out a consistent message"},{"id":1370,"source":"idebate","title":"Animals don’t have human rights"},{"id":1371,"source":"idebate","title":"People will die if we don’t do animal testing"},{"id":1372,"source":"idebate","title":"Testing is needed for really new drugs"},{"id":1374,"source":"idebate","title":"Research animals are well treated "},{"id":1375,"source":"idebate","title":"Mobile phones make sure that we are safe"},{"id":1376,"source":"idebate","title":"Mobile phones enable us to keep in touch"},{"id":1377,"source":"idebate","title":"Mobile phones help us to learn"},{"id":1378,"source":"idebate","title":"Mobile phones lead to increased independence"},{"id":1379,"source":"idebate","title":"Mobile phones distracting"},{"id":1380,"source":"idebate","title":"We should not be encouraging interest in material things"},{"id":1381,"source":"idebate","title":"There are possible safety concerns"},{"id":1383,"source":"idebate","title":"It would be the first step in colonizing space – the moon is preferential to Earth as a base for investigating life elsewhere in the universe"},{"id":1384,"source":"idebate","title":"The technology required for colonizing ‘a second Earth’ would be easier to develop on the moon"},{"id":1385,"source":"idebate","title":"We are already losing the technology and knowledge necessary for manned extra-terrestrial travel – critically that required to land people, we owe it to future generations to retain it."},{"id":1389,"source":"idebate","title":"There are simply better things to be spending money on "},{"id":1390,"source":"idebate","title":"Cell Phones Are a Public Health Hazard"},{"id":1391,"source":"idebate","title":"Cell Phones are worse than other distractions"},{"id":1392,"source":"idebate","title":"Cell Phone Use is not necessary in vehicles."},{"id":1393,"source":"idebate","title":"The State Does Not Have the Authority To Limit Citizens in This Way"},{"id":1394,"source":"idebate","title":"The Ban is Unenforceable"},{"id":1395,"source":"idebate","title":"Hands Free Phones Are not Dangerous"},{"id":1397,"source":"idebate","title":"It is cruel to deny people the last hope"},{"id":1398,"source":"idebate","title":"It is unethical to force a ‘volunteer’ to take the chance of being randomised onto the placebo arm of a trial"},{"id":1399,"source":"idebate","title":"Disastrous impact on medical trials"},{"id":1400,"source":"idebate","title":"This gives people false hope"},{"id":1403,"source":"idebate","title":"As a matter of principle, every country, including the United States, has the right to defend itself to the best of its technological and economic ability"},{"id":1404,"source":"idebate","title":"A strategic missile defense shield will be an effective defense against ballistic missile attacks targeted at the United States and its allies"},{"id":1405,"source":"idebate","title":"A robust missile defense shield will provide the protection previously afforded by the doctrine of Mutually Assured Destruction, allowing the US to dismantle much of its dangerous nuclear arsenal"},{"id":1406,"source":"idebate","title":"Strategic missile defense technology is substantially more advanced and discriminating in application than nuclear weapons, making potential future wars less potentially devastating"},{"id":1407,"source":"idebate","title":"Mutually Assured Destruction breaks down when national missile defense systems are introduced, destabilizing world security:"},{"id":1408,"source":"idebate","title":"The political consequences of the system make the world less safe"},{"id":1409,"source":"idebate","title":"The system is an incredibly expensive venture that may not even work"},{"id":1412,"source":"idebate","title":"Musicians have to eat"},{"id":1414,"source":"idebate","title":"Downloading is morally right"},{"id":1415,"source":"idebate","title":"Downloaders spend more on music"},{"id":1416,"source":"idebate","title":"A teacher-student relationship is not one between friends or equals. "},{"id":1417,"source":"idebate","title":"Electronic communication facilitates sexual misconduct. "},{"id":1419,"source":"idebate","title":"Teacher’s personal life might undermine educational message. "},{"id":1420,"source":"idebate","title":"Social media can be powerful educational resources. "},{"id":1421,"source":"idebate","title":"The law would violate freedom of speech and association. "},{"id":1422,"source":"idebate","title":"Teachers can be essential in supervising cyberspace. "},{"id":1423,"source":"idebate","title":"The law would be hard to enforce."},{"id":1424,"source":"idebate","title":"Open source software is more adaptable to government needs. "},{"id":1425,"source":"idebate","title":"Government contracts can change the software industry for the better."},{"id":1426,"source":"idebate","title":"Governments can re-define industry standards by choosing open source software."},{"id":1427,"source":"idebate","title":"Open source software is more expensive for governments in the long run. "},{"id":1428,"source":"idebate","title":"Open source software undermines national security."},{"id":1429,"source":"idebate","title":"Closed source software is better at meeting consumer needs. "},{"id":1430,"source":"idebate","title":"Governments have a moral duty to protect its citizens from harmful sites."},{"id":1432,"source":"idebate","title":"Even sites that appeared innocent have had a devastating effect on society."},{"id":1433,"source":"idebate","title":"As an extensive form of media, the Internet should be subject to regulation just as other forms of media are."},{"id":1434,"source":"idebate","title":"Censorship is fundamentally incompatible with the notion of free speech."},{"id":1435,"source":"idebate","title":"The Internet is a free domain and cannot becontrolled by the government."},{"id":1436,"source":"idebate","title":"People often react poorly to being censored by their governments."},{"id":1437,"source":"idebate","title":"Humanity in many ways defines itself through exploration, and space is the next logical frontier"},{"id":1439,"source":"idebate","title":"Manned space flight excites the human imagination more than unmanned missions, allowing members of nations everywhere to see themselves as part of the same human race"},{"id":1440,"source":"idebate","title":"Manned space flight, and the new worlds it would serve to unlock, are essential to the long-term survival of humanity"},{"id":1441,"source":"idebate","title":"Manned space exploration is prohibitively expensive while providing limited spin-off benefits:"},{"id":1442,"source":"idebate","title":"Manned space flight is a technological dead end"},{"id":1443,"source":"idebate","title":"The focus of states and individuals should be on fixing the problems of this planet, not with exploring other ones"},{"id":1444,"source":"idebate","title":"Intellectual property slows the dissemination of essential information and products"},{"id":1445,"source":"idebate","title":"The complicated legal arrangements created by intellectual property raise costs of doing business:"},{"id":1447,"source":"idebate","title":"Costs of monitoring intellectual property rights by states and companies outweigh the benefits, and is often ineffective:"},{"id":1449,"source":"idebate","title":"Policing intellectual property rights is self-sustaining"},{"id":1450,"source":"idebate","title":"The product of an individual's intellectual endeavour is the property of that individual, who deserves to profit from it"},{"id":1451,"source":"idebate","title":"Intellectual property rights incentivize investment of time and money in developing new products"},{"id":1452,"source":"idebate","title":"The salable and conferrable nature of intellectual property allows for the efficient and just distribution of ideas"},{"id":1453,"source":"idebate","title":"Intellectual property rights allow individuals to release their inventions into the public domain"},{"id":1454,"source":"idebate","title":"Genetically modified food is too new and little researched to be allowed for public use. "},{"id":1455,"source":"idebate","title":"Genetically modified food is a danger to eco-systems. "},{"id":1456,"source":"idebate","title":"GMOs would create too much dependency on biotechnology companies"},{"id":1457,"source":"idebate","title":"Genetically modified food is no different from any other scientific advance, thus should be legal to use."},{"id":1458,"source":"idebate","title":"Genetically modified organisms can solve the problem of food supply in the developing world. "},{"id":1459,"source":"idebate","title":"Genetically modified organisms will prevent starvation due to global climate changes. "},{"id":1460,"source":"idebate","title":"The fossil evidence"},{"id":1463,"source":"idebate","title":"The Bible says God created the world"},{"id":1465,"source":"idebate","title":"Chance cannot produce complexity"},{"id":1466,"source":"idebate","title":"Evolution undermines meaning and morality"},{"id":1467,"source":"idebate","title":"Not censoring its search results is a victory for human rights"},{"id":1468,"source":"idebate","title":"Not censoring helps Google’s business proposition and corporate identity"},{"id":1469,"source":"idebate","title":"Not censoring puts global pressure on China to change its free speech policies"},{"id":1474,"source":"idebate","title":"Aid can ensure better treatment of migrants"},{"id":1475,"source":"idebate","title":"Migrants can benefit developing countries"},{"id":1477,"source":"idebate","title":"Large influxes of migrants will create conflict in unprepared countries"},{"id":1478,"source":"idebate","title":"Migrants will simply return to the countries they have been sent from"},{"id":1479,"source":"idebate","title":"The Gulf states are a convenient place to settle Syrian refugees"},{"id":1480,"source":"idebate","title":"The Gulf states have a moral responsibility to take in Syrian refugees "},{"id":1481,"source":"idebate","title":"European countries have taken in a huge number of refugees while gulf states have taken none"},{"id":1482,"source":"idebate","title":"Gulf countries could benefit from refugees"},{"id":1483,"source":"idebate","title":"The Gulf states are themselves not bastions of freedom"},{"id":1484,"source":"idebate","title":"ISIS could infiltrate to Gulf States"},{"id":1486,"source":"idebate","title":"Cyberbullying ruins lives just like any other bullying; age of the culprit does not matter"},{"id":1487,"source":"idebate","title":"Jail prevents continued harassment"},{"id":1489,"source":"idebate","title":"Children should not be sent to jail"},{"id":1490,"source":"idebate","title":"Should not damage a normal childhood with jail"},{"id":1491,"source":"idebate","title":"There are other options besides jail"},{"id":1492,"source":"idebate","title":"Some intellectual migrants already feel a certain degree of alienation towards their national culture before leaving their country "},{"id":1494,"source":"idebate","title":"Intellectual migrants are more impregnated by ideas of internationalism and universalism"},{"id":1496,"source":"idebate","title":"The inferiority complex within older generations in the developing countries affects intellectuals’ sense of belonging while in their countries  "},{"id":1497,"source":"idebate","title":"Developing countries have high unemployment rates and need to invest in job creation  "},{"id":1498,"source":"idebate","title":"Many migrants come from countries with strong sense of belonging"},{"id":1500,"source":"idebate","title":"Persecution of homosexuals is morally wrong "},{"id":1501,"source":"idebate","title":"Cutting aid could produce a change in policy direction "},{"id":1504,"source":"idebate","title":"The reduction of aid will cause innocent people to suffer"},{"id":1506,"source":"idebate","title":"Free movement will provide benefits for productivity."},{"id":1508,"source":"idebate","title":"Policies towards a free labour market will create unity. "},{"id":1509,"source":"idebate","title":"Implementing a free labour market will enable effective management of migration."},{"id":1510,"source":"idebate","title":"The freedom to move is a human right."},{"id":1513,"source":"idebate","title":"Who is left behind?"},{"id":1530,"source":"idebate","title":"Poverty means more crime"},{"id":1531,"source":"idebate","title":"Poverty creates a vicious circle"},{"id":1532,"source":"idebate","title":"Poor states have trouble providing security"},{"id":1533,"source":"idebate","title":"Ethno-religious divides are a bigger security threat"},{"id":1536,"source":"idebate","title":"Civil society’s involvement in political life is necessary to strengthen democratic accountability"},{"id":1537,"source":"idebate","title":"Civil society is good for economic development "},{"id":1538,"source":"idebate","title":"The involvement of CSOs promotes good governance practices"},{"id":1539,"source":"idebate","title":"Western European experiences do not demonstrate that civil society’s involvement in politics would be positive in the African context"},{"id":1540,"source":"idebate","title":"An excessively active civil society would increase political instability and paralyse African states"},{"id":1541,"source":"idebate","title":"The promotion of civil society is yet another form of the Western imperialism"},{"id":1542,"source":"idebate","title":"Land titles provide a voice in the legal system. "},{"id":1543,"source":"idebate","title":"Land titles mean single women can build decent homes."},{"id":1544,"source":"idebate","title":"Land titles will develop entrepreneurial women. "},{"id":1545,"source":"idebate","title":"Land titles will help end violence against women. "},{"id":1546,"source":"idebate","title":"Land titles for women today will provide inter-generational equalities for the future."},{"id":1547,"source":"idebate","title":"Land titles, and markets, in Africa remain corrupt."},{"id":1548,"source":"idebate","title":"Land titles are not affordable to poor women"},{"id":1549,"source":"idebate","title":"Land titling will increase female poverty. "},{"id":1550,"source":"idebate","title":"Land titles do not solve the main issue for women - rental markets. "},{"id":1551,"source":"idebate","title":"Land titles are being granted in high-risk areas."},{"id":1552,"source":"idebate","title":"A referendum will create a better political climate."},{"id":1553,"source":"idebate","title":"An in or out referendum would be legitimate."},{"id":1554,"source":"idebate","title":"The public have a right to a referendum."},{"id":1555,"source":"idebate","title":"The referendum is good PR for the UK."},{"id":1556,"source":"idebate","title":"The referendum is inconsistent with the UK's tradition of representative democracy  EU membersh"},{"id":1558,"source":"idebate","title":"The vote will be illegitimate."},{"id":1560,"source":"idebate","title":"Progress has been made."},{"id":1561,"source":"idebate","title":"Islamic parties have led governments before"},{"id":1562,"source":"idebate","title":"Factionalism is too strong"},{"id":1563,"source":"idebate","title":"The west only supports democracies that fit with its world view."},{"id":1564,"source":"idebate","title":"Outside powers want oil so support dictatorial regimes who can deliver it."},{"id":1565,"source":"idebate","title":"Rentier economies lead to dictatorships."},{"id":1566,"source":"idebate","title":"All countries have a right to defend themselves with nuclear weapons, even when they lack the capacity in conventional weapons"},{"id":1567,"source":"idebate","title":"Nuclear weapons give states valuable agenda-setting power on the international stage"},{"id":1568,"source":"idebate","title":"Nuclear weapons give states valuable agenda-setting power on the international stage"},{"id":1569,"source":"idebate","title":"Nuclear weapons serve to defuse international conflicts and force compromise"},{"id":1572,"source":"idebate","title":"The threat of nuclear weapons falling into the hands of rogue states and terrorists increases as more countries possess them"},{"id":1573,"source":"idebate","title":"Humanitarian intervention becomes impossible in states that possess nuclear weapons"},{"id":1574,"source":"idebate","title":"Possessing nuclear weapons will be counter to the peaceful interests of states"},{"id":1575,"source":"idebate","title":"The threat of a state developing nuclear weapons could instigate pre-emptive strikes from its neighbours and rivals to prevent the acquisition of such weapons"},{"id":1576,"source":"idebate","title":"The House of Lords is out of touch with the electorate."},{"id":1579,"source":"idebate","title":"The current House of Lords is undemocratic"},{"id":1581,"source":"idebate","title":"Reform would make the House of Lords simply a mirror of the House of Commons"},{"id":1582,"source":"idebate","title":"Democracy should not be the end-point aspiration of government."},{"id":1583,"source":"idebate","title":"The public is apathetic to reform."},{"id":1584,"source":"idebate","title":"PMCs are a valuable resource"},{"id":1585,"source":"idebate","title":"PMCs give value for money"},{"id":1586,"source":"idebate","title":"PMCs have an equally strong incentive to perform."},{"id":1587,"source":"idebate","title":"PMCs attract less attention and suspicion and can carry out their role more effectively."},{"id":1588,"source":"idebate","title":"PMCs provide a service that may be otherwise unavailable."},{"id":1590,"source":"idebate","title":"PMCs have an interest in conflict."},{"id":1591,"source":"idebate","title":"PMCs are untrustworthy"},{"id":1592,"source":"idebate","title":"PMCs violate human rights and International agreements in pursuit of profit or power. "},{"id":1593,"source":"idebate","title":"The role of PMCs has had a negative effect on traditional militaries and their operations. "},{"id":1594,"source":"idebate","title":"In the event of an imminent attack it is only reasonable to use force to find information "},{"id":1595,"source":"idebate","title":"Terrorist organisations such as Al Qaida do not respect the rights of individuals and the only way to fight fire is with fire"},{"id":1597,"source":"idebate","title":"Allowing torture under any circumstances will allow the prospect of its routine use "},{"id":1598,"source":"idebate","title":"Introducing the use of violence into the justice system means that liberties that have taken centuries to secure are lost "},{"id":1603,"source":"idebate","title":"Gun ownership increases the risk of suicide"},{"id":1604,"source":"idebate","title":"Gun ownership is an integral aspect of the right to self defence"},{"id":1605,"source":"idebate","title":"Gun ownership increases national security within democratic states"},{"id":1608,"source":"idebate","title":"Continued existence of NATO makes the world less safe"},{"id":1610,"source":"idebate","title":"NATO runs the unacceptable risk of accidental escalation"},{"id":1613,"source":"idebate","title":"NATO provides the UN with an effective joint military capability"},{"id":1619,"source":"idebate","title":"Reducing the size of government and, therefore, the amount it takes in tax frees up money which consumers can spend on goods or for companies to expand: Both create jobs"},{"id":1620,"source":"idebate","title":"Excessive regulation on the private sector puts burdens on free enterprise both in terms of administration and cost. By doing so it reduces consumer choice and acts as a drag on innovation and growth"},{"id":1623,"source":"idebate","title":"Turkey has precedents, such as Romania and Bulgaria, both of whom were accepted into the EU"},{"id":1627,"source":"idebate","title":"Turkey is a highly unstable democracy in an unstable part of the world"},{"id":1629,"source":"idebate","title":"Turkey would be an unstable Muslim state in a traditionally Christian union"},{"id":1639,"source":"idebate","title":"Faith schools perform better than ordinary schools."},{"id":1641,"source":"idebate","title":"Individuals Should Not Have the Right to Bear Arms in DC"},{"id":1643,"source":"idebate","title":"A handgun ban reduces crime and deaths"},{"id":1644,"source":"idebate","title":"Hand Guns Are Required For Self Defence."},{"id":1645,"source":"idebate","title":"Handguns are Required For Symbolic Reasons As A Defence Against the State Monopoly of Power"},{"id":1649,"source":"idebate","title":"UAVs allow more care and safeguards before shooting."},{"id":1650,"source":"idebate","title":"Using UAVs prevents soldiers from being killed."},{"id":1652,"source":"idebate","title":"The use of drones makes the use of force easier to sanction."},{"id":1655,"source":"idebate","title":"Elections should be controlled by the people not powerful interests"},{"id":1658,"source":"idebate","title":"There needs to be reform to campaign finance law. "},{"id":1662,"source":"idebate","title":"The War on Drugs has failed and there needs to be a new dialogue to decide on the course forward"},{"id":1664,"source":"idebate","title":"Allowing drug use is wrong – Prohibition must remain"},{"id":1666,"source":"idebate","title":"The aid budget has to increase to meet rising commitments"},{"id":1667,"source":"idebate","title":"Foreign aid benefits the United States"},{"id":1669,"source":"idebate","title":"Aid benefits National Security"},{"id":1670,"source":"idebate","title":"We should not be borrowing to fund foreign aid "},{"id":1671,"source":"idebate","title":"The focus should be on trade not on aid"},{"id":1672,"source":"idebate","title":"US spending should focus on defence rather than aid"},{"id":1673,"source":"idebate","title":"Personality politics is harmful to the democratic process"},{"id":1674,"source":"idebate","title":"This is an unjust use of unelected power"},{"id":1676,"source":"idebate","title":"Celebrity involvement can act as a ‘gateway’ to get more people engaged in politics"},{"id":1678,"source":"idebate","title":"Celebrity involvement can highlight minority interests"},{"id":1679,"source":"idebate","title":"An active, “big” federal government is best for the American people  "},{"id":1681,"source":"idebate","title":"A minimalist state enables a fairer and more competitive economy. "},{"id":1683,"source":"idebate","title":"Catalans clearly want self determination"},{"id":1686,"source":"idebate","title":"If a referendum is not allowed violence may be the result"},{"id":1687,"source":"idebate","title":"Spain is one indivisible nation"},{"id":1688,"source":"idebate","title":"Catalan independence would lead to further break up of the Spanish state"},{"id":1690,"source":"idebate","title":"Civic duty"},{"id":1693,"source":"idebate","title":"We don’t just vote for ourselves "},{"id":1694,"source":"idebate","title":"Have your say"},{"id":1695,"source":"idebate","title":"My vote does not count"},{"id":1696,"source":"idebate","title":"Politicians don’t engage with issues that are important to me"},{"id":1697,"source":"idebate","title":"Politicians will simply ignore how we vote"},{"id":1712,"source":"idebate","title":"The New START treaty will make for a safer world."},{"id":1713,"source":"idebate","title":"The New START treaty will help against Iran’s nuclear program. "},{"id":1715,"source":"idebate","title":"The New START treaty harms US nuclear capabilities   "},{"id":1716,"source":"idebate","title":"The New START treaty helps Russia more than the US"},{"id":1717,"source":"idebate","title":"The New START treaty sets a bad approach for a changing world"},{"id":1725,"source":"idebate","title":"Puerto Ricans deserve full political rights and citizenship"},{"id":1726,"source":"idebate","title":"Puerto Rico would benefit economically from statehood"},{"id":1729,"source":"idebate","title":"Puerto Rican statehood is not economical for the US"},{"id":1730,"source":"idebate","title":"Statehood would prevent Puerto Rican independence"},{"id":1731,"source":"idebate","title":"Electing a Mayor will revitalise local democracy"},{"id":1732,"source":"idebate","title":"Mayors would be more accountable than a council"},{"id":1733,"source":"idebate","title":"Elected Mayors would attract the best candidates to run for office."},{"id":1734,"source":"idebate","title":"Mayors would raise the profile of the city they represent"},{"id":1735,"source":"idebate","title":"Mayors would result in too much centralisation of power. "},{"id":1737,"source":"idebate","title":"Mayors will come at a cost"},{"id":1738,"source":"idebate","title":"Mayors could split economic regions"},{"id":1739,"source":"idebate","title":"One person, one vote is a basic principal of democracy when the vote of one person is worth 10,000 time as much as that of another is simply undemocratic"},{"id":1745,"source":"idebate","title":"Quebec needs to be independent to retain its distinct language and culture. "},{"id":1746,"source":"idebate","title":"Quebec has the right to self-determination."},{"id":1747,"source":"idebate","title":"International Law Mandates Quebec be allowed Independence"},{"id":1748,"source":"idebate","title":"Quebec would not be able to be economically viable on its own."},{"id":1750,"source":"idebate","title":": Opinion polls are harmful to the democratic process because they stifle debate"},{"id":1751,"source":"idebate","title":"Opinion polls are subject to bias and often produce faulty information on which decision are made."},{"id":1756,"source":"idebate","title":"Citizens should be respected for their opinions"},{"id":1759,"source":"idebate","title":"Opinion polls provide useful information to politicians.  "},{"id":1760,"source":"idebate","title":"The people of Kosovo are distinct from their neighbours"},{"id":1764,"source":"idebate","title":"An independent Kosovo is not a viable state"},{"id":1766,"source":"idebate","title":"The UN charter is against it."},{"id":1768,"source":"idebate","title":"The law prevents US and EU governments from funding terrorist groups. "},{"id":1769,"source":"idebate","title":"Withholding funds will prevent PNA terrorism and anti-Semitism. "},{"id":1770,"source":"idebate","title":"The outcome of the Palestinian elections should not be rewarded with aid. "},{"id":1771,"source":"idebate","title":"Withholding funds will cause Palestine to rely on anti-Israeli regimes. "},{"id":1775,"source":"idebate","title":"Individuals have a right to the experience of higher education"},{"id":1776,"source":"idebate","title":"The state benefits from the skills of a university educated populace "},{"id":1777,"source":"idebate","title":"Individuals have a right to equal opportunities that free university provides. "},{"id":1778,"source":"idebate","title":"The burden of fees and loans are too great to expect young people to shoulder "},{"id":1779,"source":"idebate","title":"The cost to the state is far too great to sustain universal free university education "},{"id":1780,"source":"idebate","title":"Maintaining a system of free university education leads to an inefficient allocation of state resources. "},{"id":1781,"source":"idebate","title":"The quality of education suffers when university education is free "},{"id":1782,"source":"idebate","title":"Free university education unjustly benefits one subset of society at the expense of everyone "},{"id":1784,"source":"idebate","title":"Giving politicians’ immunity from prosecution allows them to focus on performing their duties"},{"id":1786,"source":"idebate","title":"In the event of major abuses of power it should be the public that holds politicians to account.  "},{"id":1787,"source":"idebate","title":"Seeing a politician put on trial hurts the integrity of their office.  "},{"id":1793,"source":"idebate","title":"Immunity creates a perverse incentive to hang on to their office as long as possible.  "},{"id":1795,"source":"idebate","title":"Such a move is historically and morally justified"},{"id":1799,"source":"idebate","title":"Israel remembers past failures of the international community when it came to Jews and doubts the UN’s Impartiality"},{"id":1801,"source":"idebate","title":"Even a successful move for statehood would place the United States in a challenging position, and alienate American opinion which the Palestinians are dependent on"},{"id":1802,"source":"idebate","title":"Restricting Habeas Corpus is necessary in the face of the new and dangerous threat which modern terrorism poses. "},{"id":1805,"source":"idebate","title":"Suspending Habeas Corpus undermines the moral high ground of the US and its Allies, and strengthens the cause of the terrorists which these nations are fighting against. "},{"id":1806,"source":"idebate","title":"Disregarding Habeas Corpus protections sets a dangerous precedent for the treatment of the soldiers and citizens of the US and its Allies when captured by foreign forces. "},{"id":1810,"source":"idebate","title":"Keeping NATO troops in Afghanistan is necessary for creating a successful Afghan state"},{"id":1813,"source":"idebate","title":"Britain is morally obliged to permit the secession of northern Ireland"},{"id":1815,"source":"idebate","title":"It would be easier to protect the rights of religious minorities within a united Ireland"},{"id":1816,"source":"idebate","title":"Uniting Ireland would bring about an end to sectarian violence"},{"id":1819,"source":"idebate","title":"The majority of the inhabitants of Northern Ireland do not support unification"},{"id":1820,"source":"idebate","title":"Unification would reignite civil disorder and violent factionalism among Irish communities"},{"id":1821,"source":"idebate","title":"Collective bargaining is not a right"},{"id":1822,"source":"idebate","title":"Collective bargaining leades to pay crises in the public sector"},{"id":1823,"source":"idebate","title":"Collective bargaining undermines the democractic process"},{"id":1824,"source":"idebate","title":"Collective bargaining is a necessary aspect of democracy"},{"id":1825,"source":"idebate","title":"Collective bargaining is a counter to the creation of natural monopolies"},{"id":1827,"source":"idebate","title":"The reconciliation process provides access to justice in post conflict states"},{"id":1828,"source":"idebate","title":"Truth and reconciliation are more important than retribution following violent and long term conflicts"},{"id":1830,"source":"idebate","title":"Reconciliation can be used to conceal political corruption and patrimony"},{"id":1831,"source":"idebate","title":"The South African reconciliation commission has proven itself to be ineffective"},{"id":1832,"source":"idebate","title":"Negative campaigning creates voter apathy and prevents accurate reporting of candidates’ policies and ideologies."},{"id":1834,"source":"idebate","title":"Negative campaigning reduces the diversity and representativeness of government."},{"id":1835,"source":"idebate","title":"Negative campaigning leads to negative governance."},{"id":1841,"source":"idebate","title":"Reduces public apathy about, and disengagement from, politics. "},{"id":1842,"source":"idebate","title":"Ensures that all views are represented in political debate. "},{"id":1844,"source":"idebate","title":"Referendums can lend greater validity to political outcomes"},{"id":1858,"source":"idebate","title":"The current system disenfranchises minorities as Iowa and New Hampshire have disproportionately low Black and Latino populations"},{"id":1859,"source":"idebate","title":"The current system is hugely expensive; a national primary would control the scale of spending in campaigns "},{"id":1863,"source":"idebate","title":"The United States is not an appropriate agent for monitoring international security because it is only representative of one nation. "},{"id":1865,"source":"idebate","title":"Failure after failure has made it clear that the US military is not an effective actor for maintaining international stability. "},{"id":1867,"source":"idebate","title":"As long as the United States works unilaterally to quell violent conflict, progress is not being made towards a better, internationally coordinated system. "},{"id":1871,"source":"idebate","title":"There are currently no viable alternatives to US military dominance. "},{"id":1872,"source":"idebate","title":"The United States engaged in \"hostilities\" under War Powers"},{"id":1873,"source":"idebate","title":"US intervention is not consistent with other aspects of US law"},{"id":1874,"source":"idebate","title":"The Libya intervention lacks sufficient international authority"},{"id":1876,"source":"idebate","title":"Congress was appropriately and openly consulted"},{"id":1879,"source":"idebate","title":"Socialism was a twentieth century ideology which ran its course and ran out of steam when it became clear that Capitalism worked better"},{"id":1880,"source":"idebate","title":"Even the leaders of the Left have given up on Socialism as a creed and have now accepted the vast majority of modern Capitalist principles"},{"id":1881,"source":"idebate","title":"Socialism has changed historically to meet the challenges of the moment and is addressing those of the 21st century in new ways"},{"id":1882,"source":"idebate","title":"The idea that wealth should be more fairly and evenly distributed has never had so many supporters and the failure to do so has rarely been more keenly felt"},{"id":1886,"source":"idebate","title":"The use of atomic bombs was the only was to persuade Japan's rulers to surrender"},{"id":1887,"source":"idebate","title":"The continuation of a conventional war would have been much costlier than an atomic attack"},{"id":1888,"source":"idebate","title":"The United States need to maximise the effectiveness of its atomic weaponry program before it could be compromised"},{"id":1889,"source":"idebate","title":"It was not necessary to use atomic weapons on a population centre"},{"id":1890,"source":"idebate","title":"A negotiated peace would have been preferable to the dropping of the atomic bombs"},{"id":1891,"source":"idebate","title":"The bombing was immoral and illegal"},{"id":1894,"source":"idebate","title":"The Republican Party has been hijacked by the Tea Partiers who simply don’t have a coherent message or ideology"},{"id":1898,"source":"idebate","title":"Monarchies, no matter how vestigal, are undemocratic"},{"id":1899,"source":"idebate","title":"Supervising and protecting a monarchy is an unjustifiable public expense"},{"id":1900,"source":"idebate","title":"There is no divine right to leadership or privilege"},{"id":1902,"source":"idebate","title":"The head of state should be a position that is separate and distinct from politics"},{"id":1904,"source":"idebate","title":"The monarchy is an important preserver of a nation's cultural heritage"},{"id":1905,"source":"idebate","title":"The monarchy can serve as public role models."},{"id":1910,"source":"idebate","title":"The mandate is constitutional under the commerce clause"},{"id":1911,"source":"idebate","title":"Mandatory health insurance is analogous to constitutional mandates"},{"id":1912,"source":"idebate","title":"The electoral college violates the democratic principle of equality in voting"},{"id":1913,"source":"idebate","title":"The electoral college violates the democratic principle that the winner should be the candidate receiving the most votes.  "},{"id":1916,"source":"idebate","title":"The electoral college weakens incentives for voting and party building."},{"id":1923,"source":"idebate","title":"Devolution has demonstrated the ability of Scots to govern themselves not only as well as Westminster but with more civility"},{"id":1924,"source":"idebate","title":"An independent Scotland has enormous economic potential to join other small European nations, especially as a leader in technology and renewable energy "},{"id":1928,"source":"idebate","title":"Identity cards improve public safety"},{"id":1929,"source":"idebate","title":"Identity cards confer advantages on their users"},{"id":1930,"source":"idebate","title":"Identity cards can assist in the efficient monitoring of immigration"},{"id":1931,"source":"idebate","title":"Identity cards can be used  to locate individuals who are in danger"},{"id":1932,"source":"idebate","title":"Only those who are guilty have anything to fear from systems that monitor and confirm identities"},{"id":1933,"source":"idebate","title":"This motion represents an unacceptable intrusion into individual liberty"},{"id":1934,"source":"idebate","title":"An identity card scheme is open to subversion and abuse"},{"id":1935,"source":"idebate","title":"The scheme does not prevent forgery or identity theft"},{"id":1936,"source":"idebate","title":"The scheme would cause inconvenience and public discontent"},{"id":1937,"source":"idebate","title":"Saddam Hussein is gone and Iraq is now functioning as one of very few democracies in the Middle East"},{"id":1938,"source":"idebate","title":"Although there has been a huge cost in human life the alternatives may well have been worse Saddam had made quite clear his intention to hand over power to his sons "},{"id":1940,"source":"idebate","title":"The war was illegal and the removal of Saddam should have been left to the Iraqis Yet another puppet regime is not what the Middle East needs"},{"id":1942,"source":"idebate","title":"Even if the outcome is a stable democratic Iraq, the war was still a costly, illegal, ideologically-driven mistake "},{"id":1944,"source":"idebate","title":"Bribery is sometimes necessary for survival"},{"id":1945,"source":"idebate","title":"Bribery is sometimes the cost of doing business"},{"id":1946,"source":"idebate","title":"Bribery is only wrong under a Western-centric notion of corruption"},{"id":1947,"source":"idebate","title":"Bribery is morally wrong"},{"id":1950,"source":"idebate","title":"The people of Ukraine and Georgia want to join"},{"id":1951,"source":"idebate","title":"Expansion is in the interests of NATO"},{"id":1952,"source":"idebate","title":"There is a strong precedent for expansion"},{"id":1956,"source":"idebate","title":"North Korea represents a clear danger to its neighbours and their allies and that is unlikely to change"},{"id":1957,"source":"idebate","title":"Kim Jong Un is unlikely to consent to any form of unified government that does not include him and his family"},{"id":1960,"source":"idebate","title":"Forcible \"liberation\" is contrary to the principle of self determination"},{"id":1961,"source":"idebate","title":"There is little interest in unification among young people in South Korea"},{"id":1962,"source":"idebate","title":"Cluster Bombs Cause Unacceptable Harm to Civilians"},{"id":1963,"source":"idebate","title":"Cluster Bombs Are Inconsistent With International Law"},{"id":1965,"source":"idebate","title":"Cluster Bombs Have Significant Strategic Value"},{"id":1966,"source":"idebate","title":"The Ban is Unfeasible"},{"id":1967,"source":"idebate","title":"This House Believes That the U.S. Should Ban The Use of Cluster Bombs"},{"id":1968,"source":"idebate","title":"Banning Landmines is a step towards reducing the horror of war"},{"id":1970,"source":"idebate","title":"Landmines provide a false sense of security"},{"id":1971,"source":"idebate","title":"The US army does not need landmines"},{"id":1972,"source":"idebate","title":"Landmines are a useful military tool"},{"id":1975,"source":"idebate","title":"Landmines are necessary to protect South Korea"},{"id":1977,"source":"idebate","title":"A growing alliance that defies party lines and the definitions of the last century "},{"id":1979,"source":"idebate","title":"Libertarians would return society to a state of nature where ‘life is cruel, bloody and short’."},{"id":1980,"source":"idebate","title":"Libertarianism is really a coalition of the unwilling; the fringes of the left and right, happy to criticize but without a single policy on which they can agree "},{"id":1982,"source":"idebate","title":"The United States has an obligation to protect international stability due to its unique military strength."},{"id":1984,"source":"idebate","title":"Nuclear weapons can fall into the wrong hands."},{"id":1986,"source":"idebate","title":"[Iran specific] Iran has threatened to destroy Israel"},{"id":1987,"source":"idebate","title":"[Iran specific] Others, particularly Israel, would act if the United States did not"},{"id":1990,"source":"idebate","title":"The principle of Mutually Assured Destruction makes war less likely."},{"id":1992,"source":"idebate","title":"Increasing voter engagement"},{"id":1993,"source":"idebate","title":"Open primaries promote moderate, non-partisan politics"},{"id":1994,"source":"idebate","title":"Open primaries promote engagement with political minorities"},{"id":1995,"source":"idebate","title":"Open primaries prevent the centralisation of party power"},{"id":1996,"source":"idebate","title":"Open primaries allow the electorate to express nuanced polling choices"},{"id":1997,"source":"idebate","title":"Open primaries will distract and confuse the majority of the electorate"},{"id":1999,"source":"idebate","title":"Open primaries are open to manipulation"},{"id":2000,"source":"idebate","title":"Open primaries will lead to an intensification of lobbying activities"},{"id":2001,"source":"idebate","title":"Open primaries will lead to an increase in disputes internal to political parties"},{"id":2002,"source":"idebate","title":"Stability is more important than reform"},{"id":2003,"source":"idebate","title":"A strong leader has more benefits than harms"},{"id":2004,"source":"idebate","title":"A strong leader is working in the state’s best interest"},{"id":2005,"source":"idebate","title":"Russia as a state and Russians as a nation need strong leadership"},{"id":2009,"source":"idebate","title":"Corruption, an essential issue in Russia,  is due to the strong leadership"},{"id":2010,"source":"idebate","title":"Abolishing earmarks will save money"},{"id":2011,"source":"idebate","title":"Earmarks do not represent an efficient use of taxpayers' money"},{"id":2012,"source":"idebate","title":"Earmarks erode trust in the government"},{"id":2013,"source":"idebate","title":"Earmarks transfer too much power to political parties' central leadership"},{"id":2014,"source":"idebate","title":"Earmarks do not accord with democratic principles of equity, fairness and justice"},{"id":2017,"source":"idebate","title":"Congressional earmarks are a check on an excessively powerful executive branch"},{"id":2018,"source":"idebate","title":"Earmarks help to create congressional stability"},{"id":2019,"source":"idebate","title":"Imposing a ban on earmarking will destabilise congrerss"},{"id":2020,"source":"idebate","title":"Terrorists are engaged in war, which much remain subject to the Geneva Conventions lest it become unrestrained"},{"id":2021,"source":"idebate","title":"The moral duty to respect a basic level of humanity, which the Geneva Convention embodies, must be retained"},{"id":2022,"source":"idebate","title":"Poor treatment of terrorists affirms terrorist ideology and provides a recruitment tool, therefore the Geneva Conventions must be applied to prevent this."},{"id":2023,"source":"idebate","title":"Harsh interrogation is not necessarily an effective tool for extracting valuable information."},{"id":2024,"source":"idebate","title":"The United Nations can punish those states who refuse to subject its prisoners of war to the Geneva Conventions"},{"id":2025,"source":"idebate","title":"Terrorists are not lawful combatants, therefore they not do not acquire prisoner of war status"},{"id":2026,"source":"idebate","title":"With no hope of reciprocity, adherence to the Geneva Conventions would undermine the fight against terrorism"},{"id":2027,"source":"idebate","title":"Special interrogation methods are necessary in order to combat the terrorist threat"},{"id":2028,"source":"idebate","title":"There are other means by which to protect the rights of terrorists without needing to apply the Geneva Conventions"},{"id":2029,"source":"idebate","title":"The military operations were legitimate as Israeli self-defense: "},{"id":2030,"source":"idebate","title":"The military operations were necessary for long term peace: "},{"id":2031,"source":"idebate","title":"The military operations were proportionate to the threat: "},{"id":2032,"source":"idebate","title":"Israel's military operations were aggression, not self defense: "},{"id":2033,"source":"idebate","title":"Israel's military operations harmed the chances of peace in the long term: "},{"id":2034,"source":"idebate","title":"Israel's military operations were disproportionate and harmed too many civilians: "},{"id":2035,"source":"idebate","title":"The EU needs a dedicated defence force"},{"id":2036,"source":"idebate","title":"A single army would enhance the political integration of EU members states"},{"id":2038,"source":"idebate","title":"The economic strength of the EU enables the creation of a strong military"},{"id":2039,"source":"idebate","title":"Regional instability in certain areas of continental europe necessitates the creation of an EU defence force"},{"id":2042,"source":"idebate","title":"The creation of an EU army could harm diplomatic relations with the USA"},{"id":2043,"source":"idebate","title":"The creation of a standing army would be contrary to the spirit and purpose of the EU"},{"id":2044,"source":"idebate","title":"A large and diverse collective defence for would be impossible to command and develop"},{"id":2046,"source":"idebate","title":"Success depends on military intervention."},{"id":2047,"source":"idebate","title":"Invasion is not yet justified."},{"id":2048,"source":"idebate","title":"The nature of the opposition movements makes this an unwinnable war."},{"id":2055,"source":"idebate","title":"War is always unjust"},{"id":2056,"source":"idebate","title":"The just war doctrine encourages resort to war"},{"id":2057,"source":"idebate","title":"Just war doctrine is an anachronism"},{"id":2059,"source":"idebate","title":"Terrorism can lead to discussion"},{"id":2063,"source":"idebate","title":"Harm to others is never legitimate"},{"id":2064,"source":"idebate","title":"Terrorism creates a negative abusable portrayal"},{"id":2071,"source":"idebate","title":"If all member states held a referendum on all EU treaties nothing would get passed."},{"id":2074,"source":"idebate","title":"Countries need to design nuclear devices to adapt with changing defensive technology."},{"id":2075,"source":"idebate","title":"Designing and constructing tactical nuclear weapons allow a state's scientists to maintain a competitive position in nuclear technology."},{"id":2076,"source":"idebate","title":"Tactical nuclear warheads are more serviceable for use in intimidation and retaliation toward enemies, as they are considerably less catastrophically destructive than those of current nuclear arsenals."},{"id":2079,"source":"idebate","title":"Tactical nuclear weapons are very expensive to design and build, yet will likely have no new strategic value."},{"id":2083,"source":"idebate","title":"States should not possess such destructive, cataclysmic weapons"},{"id":2087,"source":"idebate","title":"Nuclear weapons can be abolished through the co-operation of nuclear powers and the establishment of an independent verification system"},{"id":2088,"source":"idebate","title":"Nuclear weapons are required for deterrence "},{"id":2089,"source":"idebate","title":"Abolishment is an unrealistic goal"},{"id":2090,"source":"idebate","title":"Abolishment would be counter-productive and only lead to greater barbarity in warfare"},{"id":2092,"source":"idebate","title":"Historically Democrats have presided over more economic stability whereas the GOP is the party of boom and Bust "},{"id":2093,"source":"idebate","title":"Democrats focus on increasing wages, creating better consumers."},{"id":2095,"source":"idebate","title":"Republicans are the best at stimulating economic growth"},{"id":2096,"source":"idebate","title":"Republicans more enthusiastically support market capitalism"},{"id":2100,"source":"idebate","title":"Amid all the Euroscepticism (sic) and xenophobic scaremongering so typical of the British tabloids, Britain forgets the advantage of cheaper goods would come with her entry into the European single currency."},{"id":2102,"source":"idebate","title":"For Britain to join the single currency is simply unthinkable; jobs will be lost"},{"id":2103,"source":"idebate","title":"In joining the single currency, Britain would have to surrender her sovereignty and allow Brussels (where the EU is based) to dictate her financial affairs."},{"id":2105,"source":"idebate","title":"Term limits restore a concept of rotation in public office, and reestablish the concept of the citizen legislature:"},{"id":2106,"source":"idebate","title":"Term limits create more competitive elections for public office that empower new leaders and ideas:"},{"id":2107,"source":"idebate","title":"The longer a politician remains in office, the more entrenched his grip becomes, and the more likely he is to use his office to his personal advantage:"},{"id":2109,"source":"idebate","title":"Term limits are undemocratic and suggest, falsely, that voters cannot make intelligent decisions about their representatives without guidance:"},{"id":2110,"source":"idebate","title":"The incentive for corruption and self-enrichment in office is increased by term limits:"},{"id":2111,"source":"idebate","title":"Experienced legislators who understand the workings of the legislative system are needed for their expertise and wisdom:"},{"id":2112,"source":"idebate","title":"Term limits tend to increase partisanship between political parties and factions:"},{"id":2113,"source":"idebate","title":"Voting is a civic duty"},{"id":2114,"source":"idebate","title":"Compulsory voting broadens representation of disadvantaged groups"},{"id":2116,"source":"idebate","title":"Compulsory voting has been implemented successfully."},{"id":2119,"source":"idebate","title":"Policing and financing the system is unmanageable"},{"id":2121,"source":"idebate","title":"Self-determination is necessary to protect minority cultures."},{"id":2123,"source":"idebate","title":"Self-determination embodies the fundamental right of peoples to decide their own futures."},{"id":2124,"source":"idebate","title":"Self-determination offers a way to resolve otherwise intractable disputes."},{"id":2125,"source":"idebate","title":"What matters are individual democratic rights, not necessarily collective self-determination."},{"id":2126,"source":"idebate","title":"The rise of universal human rights makes self-determination increasingly irrelevant."},{"id":2127,"source":"idebate","title":"Self-determination can destabilise nation states, sometimes with very destructive consequences."},{"id":2128,"source":"idebate","title":"Federal states are economically stronger"},{"id":2129,"source":"idebate","title":"Federal states are better able to protect their citizens."},{"id":2131,"source":"idebate","title":"Being a federal state helps large states deal with divergent economic performance"},{"id":2134,"source":"idebate","title":"Federal governments often extend their powers and usurp local authority, especially if one or more federal units are disproportionately powerful."},{"id":2135,"source":"idebate","title":"Federal States often have persistent losers."},{"id":2136,"source":"idebate","title":"A UN Standing Army would solve the problem of American military hegemony."},{"id":2137,"source":"idebate","title":"A UN standing army would be ideally suited to respond to contemporary crises."},{"id":2138,"source":"idebate","title":"A UN standing army would be more effective in operations themselves."},{"id":2139,"source":"idebate","title":"A UN standing army would not be cost-effective."},{"id":2140,"source":"idebate","title":"A UN standing army is simply impossible to form."},{"id":2143,"source":"idebate","title":"A UN standing army is unnecessary"},{"id":2144,"source":"idebate","title":"The executive branch of government, having no countervailing voices to the leader s’ within it, must be checked by limiting tenancy in office."},{"id":2145,"source":"idebate","title":"The longer a single leader remains in power, the more entrenched his grip becomes, and the more likely he is to use his office to his personal advantage."},{"id":2146,"source":"idebate","title":"Term limits check the power of incumbency as an election-winning tool and allow new and energetic leaders and ideas to flourish."},{"id":2148,"source":"idebate","title":"Term limits are undemocratic and suggest, falsely, that voters cannot make intelligent decisions about their leaders on their own."},{"id":2149,"source":"idebate","title":"Term limits on leaders unbalances power in favour of non-limited legislators and the judiciary."},{"id":2150,"source":"idebate","title":"A strong, consistent executive may be desirable in many cases."},{"id":2151,"source":"idebate","title":"The incentive for corruption and self-enrichment in office is increased by term limits."},{"id":2152,"source":"idebate","title":"Tribunals are adequate replacements that maintain respect for detainees' rights."},{"id":2153,"source":"idebate","title":"The protection of intelligence sources is more important than trying suspects."},{"id":2154,"source":"idebate","title":"Governments must have powers to protect citizens from harm."},{"id":2155,"source":"idebate","title":"Internment without trial encourages the bad behaviour of other states."},{"id":2156,"source":"idebate","title":"Internment without trial exacerbates the antagonism of enemies and subsequent risk to civilians."},{"id":2157,"source":"idebate","title":"The war on terror is not an armed conflict, and therefore internment without trial is illegal."},{"id":2158,"source":"idebate","title":"Internment without trial fails to make society safer."},{"id":2159,"source":"idebate","title":"Internment without trial undermines democratic values."},{"id":2161,"source":"idebate","title":"Providing attention simply encourages the regime"},{"id":2164,"source":"idebate","title":"North Korea is an unresolved conflict it can’t simply be ignored"},{"id":2165,"source":"idebate","title":"Ignoring North Korea wont resolve the situation"},{"id":2167,"source":"idebate","title":"It would help distinguish between levels of elections"},{"id":2168,"source":"idebate","title":"Youth are not represented in politics"},{"id":2171,"source":"idebate","title":"There should not be different voting ages for different elections"},{"id":2172,"source":"idebate","title":"A slippery slope to forcing all countries to allow the vote at sixteen for all votes"},{"id":2173,"source":"idebate","title":"Would complicate elections"},{"id":2174,"source":"idebate","title":"EU elections would put young people off voting"},{"id":2175,"source":"idebate","title":"Having no elections is honest"},{"id":2176,"source":"idebate","title":"Avoids the costs and uncertainty of elections"},{"id":2179,"source":"idebate","title":"Some kind of election is more likely to lead to real democracy than no election"},{"id":2180,"source":"idebate","title":"Elections of any sort force rulers to meet their people"},{"id":2181,"source":"idebate","title":"Even a sham election demonstrates what the people want"},{"id":2182,"source":"idebate","title":"Sham elections do not mean the elections have no influence or impact. "},{"id":2185,"source":"idebate","title":"There are few alternatives"},{"id":2186,"source":"idebate","title":"Increased global security"},{"id":2189,"source":"idebate","title":"Props up authoritarian regimes"},{"id":2190,"source":"idebate","title":"Disrupts international relations"},{"id":2191,"source":"idebate","title":"A long ruling and ruthless dictator was toppled."},{"id":2192,"source":"idebate","title":"Intervention prevented an impending bloodbath in Benghazi. "},{"id":2194,"source":"idebate","title":"The intervention backfired."},{"id":2195,"source":"idebate","title":"It increased conflict and instability in Libya and its neighbours. "},{"id":2196,"source":"idebate","title":"Created a large divide in the UN security council."},{"id":2197,"source":"idebate","title":"Annexation will allow the free movement of Basotho people, goods and services "},{"id":2199,"source":"idebate","title":"Lesotho is in a dire condition and needs help from its closest ally"},{"id":2200,"source":"idebate","title":"South Africa will gain influence, stability and a better image on the international stage"},{"id":2201,"source":"idebate","title":"Annexation is not needed where there is already extensive cooperation between the countries "},{"id":2202,"source":"idebate","title":"A local, decentralized authority can provide better opportunities and solutions for Lesotho "},{"id":2203,"source":"idebate","title":"It is not in the interest of South Africa to annex a poor, underdeveloped country "},{"id":2204,"source":"idebate","title":"Brings labour back to its core values"},{"id":2205,"source":"idebate","title":"Presents a bold new path"},{"id":2206,"source":"idebate","title":"Provides greater choice"},{"id":2210,"source":"idebate","title":"Going left is step back not a step forward"},{"id":2214,"source":"idebate","title":"There are other larger threats."},{"id":2215,"source":"idebate","title":"Daesh has little impact outside the Middle East"},{"id":2217,"source":"idebate","title":"It helps the victims' families achieve closure."},{"id":2218,"source":"idebate","title":"The death penalty deters crime."},{"id":2219,"source":"idebate","title":"Execution prevents the accused from committing further crimes."},{"id":2220,"source":"idebate","title":"The death penalty should apply as punishment for first-degree murder; an eye for an eye."},{"id":2221,"source":"idebate","title":"Execution helps alleviate the overcrowding of prisons."},{"id":2222,"source":"idebate","title":"State-sanctioned killing is wrong."},{"id":2223,"source":"idebate","title":"The death penalty is a financial burden on the state."},{"id":2224,"source":"idebate","title":"Wrongful convictions are irreversible."},{"id":2225,"source":"idebate","title":"The death penalty can produce irreversible miscarriages of justice."},{"id":2226,"source":"idebate","title":"There are practical problems with banning abortion"},{"id":2227,"source":"idebate","title":"Women have a right to choose"},{"id":2228,"source":"idebate","title":"Rape victims have no choice when it comes to getting pregnant, therefore they should have the right to terminate the pregnancy"},{"id":2229,"source":"idebate","title":"There can be medical reasons for terminating a pregnancy"},{"id":2231,"source":"idebate","title":"Legalizing abortions leads to irresponsible sexual behavior"},{"id":2232,"source":"idebate","title":"Legalizing abortion defies the principle of life affirmation"},{"id":2233,"source":"idebate","title":"A fetus is a life from conception, therefore abortion is murder"},{"id":2236,"source":"idebate","title":"It may be necessary in the interests of national security"},{"id":2238,"source":"idebate","title":"Free speech allows challenges to orthodox beliefs"},{"id":2239,"source":"idebate","title":"Individual Liberty outweighs any potential harms"},{"id":2240,"source":"idebate","title":"Participatory Democracy Preserves our Natural Liberty "},{"id":2241,"source":"idebate","title":"Representative Democracy Enables Rule by Elites"},{"id":2242,"source":"idebate","title":"Participatory forms of Democracy Can Restore Trust in Politics "},{"id":2243,"source":"idebate","title":"Participation Is Good In Itself"},{"id":2244,"source":"idebate","title":"Participatory Democracy Produces Better Decisions "},{"id":2248,"source":"idebate","title":"Representative Democracy Prevents Domination by Special Interests"},{"id":2249,"source":"idebate","title":"Suicide is a rational choice in many situations."},{"id":2250,"source":"idebate","title":"Medical science allows us to control death, suicide and euthanasia are sensible corollaries to that."},{"id":2251,"source":"idebate","title":"The decision to die is a deeply personal one - it is no business of the state."},{"id":2252,"source":"idebate","title":"It is impossible to frame a structure which respects the right to die for the individual but that cannot be abused by others."},{"id":2254,"source":"idebate","title":"There is a risk that even a free choice may have some coercion involved."},{"id":2256,"source":"idebate","title":"It is a natural thing to do"},{"id":2257,"source":"idebate","title":"The guilt may be too heavy a burden for the relative who could have saved a life "},{"id":2258,"source":"idebate","title":"The right to individual self determination is a fundamental human right, equal to that of life itself"},{"id":2259,"source":"idebate","title":"We should preserve the person with greater quality of life"},{"id":2260,"source":"idebate","title":"Greater awareness will increase donations"},{"id":2261,"source":"idebate","title":"Self-preservation is our primary moral duty"},{"id":2262,"source":"idebate","title":"The recipient is forced to receive the sacrifice of another"},{"id":2264,"source":"idebate","title":"The role of society is to save lives not to assist in suicide"},{"id":2265,"source":"idebate","title":"Doctors should not be asked to take the moral burden of people who want to commit suicide"},{"id":2270,"source":"idebate","title":"The burden of parental responsibility"},{"id":2272,"source":"idebate","title":"As humans we try to save as many people as possible"},{"id":2273,"source":"idebate","title":"More ‘good’ is produced by saving five lives than saving one"},{"id":2274,"source":"idebate","title":"Killing one person is the rational choice"},{"id":2276,"source":"idebate","title":"We cannot make any judgments about whose life is valuable and whose is not"},{"id":2279,"source":"idebate","title":"The act of killing is emotionally damaging"},{"id":2281,"source":"idebate","title":"Encourages a culture of respect for human rights"},{"id":2294,"source":"idebate","title":"The Founder of Neo-functionalism abandoned his own Theory (Haas)."},{"id":2297,"source":"idebate","title":"Universal human nature"},{"id":2299,"source":"idebate","title":"Universal benefits of human rights"},{"id":2303,"source":"idebate","title":"It is immoral to kill animals "},{"id":2304,"source":"idebate","title":"Being vegetarian helps the environment  "},{"id":2305,"source":"idebate","title":"Vegetarianism is healthier "},{"id":2306,"source":"idebate","title":"Being vegetarian reduces risks of food poisoning"},{"id":2308,"source":"idebate","title":"There are problems with being vegetarian"},{"id":2310,"source":"idebate","title":"Why a flat tax is fairer"},{"id":2311,"source":"idebate","title":"Why a flat tax is simpler: "},{"id":2312,"source":"idebate","title":"Why closing tax loopholes is good: "},{"id":2313,"source":"idebate","title":"Why a flat tax isn't 'fair': "},{"id":2316,"source":"idebate","title":"Suicide is a waste of life"},{"id":2317,"source":"idebate","title":"Suicide is a selfish act that causes suffering to others"},{"id":2318,"source":"idebate","title":"Prohibiting suicide sends the message that it is not an acceptable behaviour "},{"id":2319,"source":"idebate","title":"Suicide undermines the sanctity of the human body"},{"id":2320,"source":"idebate","title":"This is not the role of the criminal law"},{"id":2321,"source":"idebate","title":"The right to life means a right to death"},{"id":2323,"source":"idebate","title":"Removing Tax Cuts Would Reduce the Deficit"},{"id":2324,"source":"idebate","title":"The Tax Cuts Only Exist Due to An Unjust System"},{"id":2325,"source":"idebate","title":"Removing Tax Cuts for the Rich Promotes Equality."},{"id":2326,"source":"idebate","title":"Expiring Tax Cuts Would Cause a Double Dip Recession"},{"id":2327,"source":"idebate","title":"Expiring the Tax Cut Would Harm Small Business"},{"id":2328,"source":"idebate","title":"Expiring the Tax Cuts Would Cause Investor Movement Abroad"},{"id":2329,"source":"idebate","title":"The free market is the most efficient way to match supply and demand"},{"id":2330,"source":"idebate","title":"The free market best ensures innovation"},{"id":2331,"source":"idebate","title":"The free market is morally superior because it operates on liberty"},{"id":2332,"source":"idebate","title":"The free market naturally leads to concentration of power in the hands of corporations"},{"id":2333,"source":"idebate","title":"The free market fails in providing public and common goods"},{"id":2334,"source":"idebate","title":"The free market degrades human dignity"},{"id":2336,"source":"idebate","title":"Those who are in the late stages of a terminal disease have a horrific future agead of them"},{"id":2339,"source":"idebate","title":"If someone is threatening to kill themselves it is your moral duty to try to stop them"},{"id":2340,"source":"idebate","title":"Only God can give and take away life"},{"id":2341,"source":"idebate","title":"It would have a damaging effect on society"},{"id":2342,"source":"idebate","title":"National security is something that must be protected even at the cost of"},{"id":2343,"source":"idebate","title":"The apparent loss of liberty is overstated."},{"id":2348,"source":"idebate","title":"The loss of individual liberty is the start of a slippery slope."},{"id":2349,"source":"idebate","title":"It would be letting the terrorists win"},{"id":2352,"source":"idebate","title":"It may be necessary to limit trial by jury in terrorism cases, or other cases surrounding large national security issues."},{"id":2353,"source":"idebate","title":"It may be necessary to limit trial by jury in cases where there is a real danger of jury tampering or intimidation."},{"id":2354,"source":"idebate","title":"Judges are better at delivering justice than juries are."},{"id":2356,"source":"idebate","title":"It may be necessary to limit trial by jury in cases where it is impossible to recruit an impartial jury."},{"id":2360,"source":"idebate","title":"Limiting trial by jury in some cases sets the stage for limiting it in other, unjustified, cases."},{"id":2361,"source":"idebate","title":"The UK would have a completely independent foreign policy"},{"id":2362,"source":"idebate","title":"Britain will have greater ability to respond quickly"},{"id":2363,"source":"idebate","title":"EU economic preference will no longer bind Britain"},{"id":2364,"source":"idebate","title":"UK will be disentangled from EU affairs"},{"id":2365,"source":"idebate","title":"The UK needs to be part of a block to remain relevant"},{"id":2368,"source":"idebate","title":"Leaving the EU will mean the UK will have less regional influence"},{"id":2369,"source":"idebate","title":"A nation state can only rely on itself for security"},{"id":2370,"source":"idebate","title":"The EU causes instability"},{"id":2372,"source":"idebate","title":"British security is dependent upon NATO not the EU"},{"id":2373,"source":"idebate","title":"Security is better shared"},{"id":2374,"source":"idebate","title":"Leaving will mean less communication with other security services"},{"id":2377,"source":"idebate","title":"The referendum was only advisory"},{"id":2378,"source":"idebate","title":"Circumstances may change"},{"id":2379,"source":"idebate","title":"The leave campaign may have broken the rules meaning it was not a fair election"},{"id":2380,"source":"idebate","title":"Other countries have had second referendums "},{"id":2382,"source":"idebate","title":"A referendum could not provide the nuanced policy the UK needs"},{"id":2383,"source":"idebate","title":"Britain should honour the 2016 vote"},{"id":2384,"source":"idebate","title":"There is no time to hold a second referendum"},{"id":2385,"source":"idebate","title":"A second referendum does not just affect the UK but will impact on the negotiations"},{"id":2386,"source":"idebate","title":"Inspectors don’t solve the real problem"},{"id":2390,"source":"idebate","title":"Inspectors were the only way to avoid international conflict"},{"id":2391,"source":"idebate","title":"Inspectors are ending a chemical weapons threat"},{"id":2392,"source":"idebate","title":"Nobody can afford to have the weapons inspectors leave"},{"id":2394,"source":"idebate","title":"The head of state\/government must be accountable to the people"},{"id":2395,"source":"idebate","title":"The people are interested in the health of their leader"},{"id":2396,"source":"idebate","title":"Transparency allows citizens to choose for a healthy leader as to ensure proper functioning"},{"id":2397,"source":"idebate","title":"A lack of transparency can endanger the leader"},{"id":2398,"source":"idebate","title":"Denial of privacy to the leaders"},{"id":2401,"source":"idebate","title":"Damages diplomacy to be too open"},{"id":2402,"source":"idebate","title":"Necessary to restore peace to the country"},{"id":2407,"source":"idebate","title":"A coup makes it more difficult to trust in democracy"},{"id":2408,"source":"idebate","title":"The army is not the best institution to run a country"},{"id":2409,"source":"idebate","title":"Invited by the legitimate government"},{"id":2410,"source":"idebate","title":"Necessary response to an illegal coup"},{"id":2411,"source":"idebate","title":"Crimea should be Russian"},{"id":2412,"source":"idebate","title":"Need to protect Russian civilians"},{"id":2414,"source":"idebate","title":"It is an invasion without Security Council sanction"},{"id":2415,"source":"idebate","title":"Any cross border troop movements are a violation of sovereignty"},{"id":2418,"source":"idebate","title":"Damaging to Russia"},{"id":2419,"source":"idebate","title":"There needs to be a response to bad behaviour internationally"},{"id":2420,"source":"idebate","title":"Aggressive acts violate the meaning of the G8"},{"id":2421,"source":"idebate","title":"Russia should never have been a member  "},{"id":2422,"source":"idebate","title":"The biggest action the west can take without sanctions"},{"id":2423,"source":"idebate","title":"There needs to be a place to talk"},{"id":2425,"source":"idebate","title":"Will make no difference to Russia"},{"id":2426,"source":"idebate","title":"Simply narrows the G8 making it irrelevant"},{"id":2427,"source":"idebate","title":"A peaceful solution"},{"id":2429,"source":"idebate","title":"Helps Ukraine financially"},{"id":2431,"source":"idebate","title":"Rewards aggression"},{"id":2432,"source":"idebate","title":"Does not provide guarantees for the protection of other Russian minorities"},{"id":2433,"source":"idebate","title":"Why would Ukraine trust a lease when the previous one was violated?"},{"id":2434,"source":"idebate","title":"The crisis affects more than just Crimea"},{"id":2436,"source":"idebate","title":"Progress in ending conflict in Africa"},{"id":2437,"source":"idebate","title":"The increasing effectiveness of the African Union"},{"id":2438,"source":"idebate","title":"Not all conflict is war"},{"id":2439,"source":"idebate","title":"War is in human nature"},{"id":2440,"source":"idebate","title":"Africa is the most warlike continent"},{"id":2441,"source":"idebate","title":"Gains may be reversed; events can’t be foreseen"},{"id":2442,"source":"idebate","title":"No mechanism to prevent crises and war exists"},{"id":2444,"source":"idebate","title":"Would prevent further atrocities"},{"id":2446,"source":"idebate","title":"Necessary for an impartial peace. "},{"id":2447,"source":"idebate","title":"Prosecutions are an impediment to peace negotiations"},{"id":2448,"source":"idebate","title":"Was unlikely ever to happen anyway"},{"id":2450,"source":"idebate","title":"Took a key role in negotiations"},{"id":2451,"source":"idebate","title":"Eritrea started the 1998 war"},{"id":2452,"source":"idebate","title":"The government has supported terrorist organisations"},{"id":2454,"source":"idebate","title":"President Isaias Afewerki has sought self-reliance "},{"id":2455,"source":"idebate","title":"The US has unfairly supported Ethiopia "},{"id":2458,"source":"idebate","title":"Recognition when credit is due"},{"id":2459,"source":"idebate","title":"Focusing on the leaders of good governance "},{"id":2462,"source":"idebate","title":"Bribing good governance"},{"id":2465,"source":"idebate","title":"Morsi Undermined Democratic Principles"},{"id":2466,"source":"idebate","title":"Failed to gain control of the Egyptian crisis "},{"id":2467,"source":"idebate","title":"Morsi’s economic and social policies had been ineffective and unpopular"},{"id":2468,"source":"idebate","title":"Morsi was going to implement Islamic policies on a secular country"},{"id":2469,"source":"idebate","title":"Most Egyptians still supported Morsi "},{"id":2470,"source":"idebate","title":"Mohamed Morsi had been democratically elected"},{"id":2474,"source":"idebate","title":"Long term benefits"},{"id":2475,"source":"idebate","title":"Preventing Corruption"},{"id":2476,"source":"idebate","title":"For the people and accountable to the people"},{"id":2477,"source":"idebate","title":"An independent trust fund discourages investment."},{"id":2478,"source":"idebate","title":"Keeping funds from government has negative consequences for spending"},{"id":2480,"source":"idebate","title":"Legislation against mercenaries "},{"id":2481,"source":"idebate","title":"Decreased Conflict and the end of the mercenary age"},{"id":2482,"source":"idebate","title":"The expansion of democracy"},{"id":2484,"source":"idebate","title":"Mercenaries still have a presence in coups"},{"id":2485,"source":"idebate","title":"Mercenaries are still hired by NGOs "},{"id":2487,"source":"idebate","title":"Negotiation saves lives"},{"id":2488,"source":"idebate","title":"No negotiation encourages the hunt for a bigger lever"},{"id":2489,"source":"idebate","title":"Negotiation encourages moderation"},{"id":2490,"source":"idebate","title":"Negotiation is the only way to solve the underlying problem"},{"id":2491,"source":"idebate","title":"Negotiation isolates those who are only interested in violence"},{"id":2492,"source":"idebate","title":"Negotiations cannot take place while innocents are being threatened"},{"id":2493,"source":"idebate","title":"Negotiation encourages more terrorism"},{"id":2494,"source":"idebate","title":"Negotiation provides more resources to terrorists"},{"id":2495,"source":"idebate","title":"Terrorists can’t be trusted – better to crush them"},{"id":2496,"source":"idebate","title":"Even if negotiation with one group is successful others will take their place"},{"id":2497,"source":"idebate","title":"The ICC is there to prosecute war crimes – there has been evidence of a war crime"},{"id":2498,"source":"idebate","title":"The threat of investigation could deter future war crimes, including the use of chemical weapons"},{"id":2501,"source":"idebate","title":"ICC referal would fuel the conflict further"},{"id":2502,"source":"idebate","title":"Waste of time – won’t capture Assad or rebel war criminals."},{"id":2508,"source":"idebate","title":"Encourages Europe wide thinking"},{"id":2509,"source":"idebate","title":"Big countries will dominate"},{"id":2517,"source":"idebate","title":"Scottish independence might be a faster route out of the EU than a referendum. "},{"id":2525,"source":"idebate","title":"Turkey has elections, it is a democracy"},{"id":2529,"source":"idebate","title":"NATO has brought peace and security"},{"id":2530,"source":"idebate","title":"Negotiations to ensure lasting peace"},{"id":2531,"source":"idebate","title":"Democracy has been brought to Afghanistan"},{"id":2532,"source":"idebate","title":"Investment in Afghanistan; rebuilding the economy"},{"id":2533,"source":"idebate","title":"Afghanistan is still a dangerous place"},{"id":2534,"source":"idebate","title":"The Taliban will likely take over when the NATO forces leave"},{"id":2535,"source":"idebate","title":"NATO has failed to solve Afghanistan’s economic problems"},{"id":2536,"source":"idebate","title":"An Afghanistan dominated by warlords."},{"id":2537,"source":"idebate","title":"France was asked to intervene by Mali’s government"},{"id":2539,"source":"idebate","title":"It is a humanitarian intervention"},{"id":2541,"source":"idebate","title":"Western countries should not be interfering in African internal affairs"},{"id":2542,"source":"idebate","title":"African organisations should have lead the way"},{"id":2546,"source":"idebate","title":"No fly zones and bombing could eliminate the threat of chemical weapons"},{"id":2548,"source":"idebate","title":"The use of weapons may not change the diplomatic situation"},{"id":2550,"source":"idebate","title":"Neither individuals nor corporations should be permitted to make unlimited contributions"},{"id":2552,"source":"idebate","title":"Further reforms would create a level playing field"},{"id":2556,"source":"idebate","title":"Further campaign finance reform is simply unrealistic and too ambitious. "},{"id":2558,"source":"idebate","title":"16 year olds are mature enough to vote"},{"id":2560,"source":"idebate","title":"Voting at a lower age would increase participation"},{"id":2561,"source":"idebate","title":"Voting at 16 would help rebalance voting ages"},{"id":2562,"source":"idebate","title":"Parents are guardians and should be trusted to vote in their children’s interests"},{"id":2564,"source":"idebate","title":"Young people would be more likely to misuse their vote"},{"id":2566,"source":"idebate","title":"A DNA database would lead to more convictions, particularly in cases of violent crime"},{"id":2567,"source":"idebate","title":"DNA evidence would reduce the risk of wrongful conviction"},{"id":2568,"source":"idebate","title":"A DNA database would reduce the time spent tracking down suspects"},{"id":2569,"source":"idebate","title":"Retaining the DNA of unconvicted suspects is unlawful"},{"id":2570,"source":"idebate","title":"DNA testing is fallible, and therefore should not be used as the basis of convictions"},{"id":2577,"source":"idebate","title":"Double jeopardy protects the acquitted from the threat of constant harassment by the state"},{"id":2578,"source":"idebate","title":"Double jeopardy ensures defendants are not brought to trial on weak grounds"},{"id":2579,"source":"idebate","title":"People should be free to take drugs"},{"id":2581,"source":"idebate","title":"Drugs are safer when legal"},{"id":2582,"source":"idebate","title":"Legalisation reduces crime"},{"id":2583,"source":"idebate","title":"Drugs currently fund terrorism and regional instability "},{"id":2585,"source":"idebate","title":"Legal drugs would increase tax revenue"},{"id":2586,"source":"idebate","title":"Drugs are dangerous, and the governement should discourage its use"},{"id":2590,"source":"idebate","title":"Mandatory minimum sentences increase deterrence. "},{"id":2593,"source":"idebate","title":"Mandatory sentencing increases consistency in the justice system. "},{"id":2594,"source":"idebate","title":"Mandatory sentencing gives prosecutors undue power. "},{"id":2596,"source":"idebate","title":"Mandatory sentencing fills the system with “small fish.”"},{"id":2597,"source":"idebate","title":"Minimum mandatory sentences reduce the chance of rehabilitation. "},{"id":2598,"source":"idebate","title":"Minimum mandatory sentences are unjust. "},{"id":2599,"source":"idebate","title":"The law should always punish actions that inflict serious harm - whether physical or psychological"},{"id":2602,"source":"idebate","title":"The current legal regime is not able to prevent or adequately punish bullying"},{"id":2605,"source":"idebate","title":"It is difficult to make a direct, legally sound link between a bully's behaviour and a victim's suicide"},{"id":2606,"source":"idebate","title":"Making bullying a legal issues does not incentivise robust enforcement of anti bullying rules by schools"},{"id":2607,"source":"idebate","title":"Bullys are frequently as disturbed and victimised as those they target"},{"id":2610,"source":"idebate","title":"Incarceration is expensive, rehabilitation is not "},{"id":2612,"source":"idebate","title":"The false distinction between “violent” and “non-violent” crime "},{"id":2613,"source":"idebate","title":"Rehabilitation can only succeed in prison "},{"id":2614,"source":"idebate","title":"Incarceration has symbolic value "},{"id":2615,"source":"idebate","title":"Needle exchanges prevent the transmission of disease"},{"id":2616,"source":"idebate","title":"Needle exchanges protect the public"},{"id":2617,"source":"idebate","title":"Needle exchanges can help social services to locate addicts who are in need of treatment"},{"id":2618,"source":"idebate","title":"Creating needle exchange may normalise drug-taking behaviour"},{"id":2619,"source":"idebate","title":"Needle exchanges will increase the incidence of drug use"},{"id":2620,"source":"idebate","title":"Needle exchanges cause crime"},{"id":2621,"source":"idebate","title":"Argentina inherited Spain’s claim to sovereignty"},{"id":2622,"source":"idebate","title":"Argentina created a permanent settlement"},{"id":2631,"source":"idebate","title":"Rehabilitation Is A Better General Justifying Aim for Punishment"},{"id":2633,"source":"idebate","title":"Rehabilitation Does Not Serve The Needs of Society"},{"id":2634,"source":"idebate","title":"Rehabilitation Doesn’t Actually Work "},{"id":2636,"source":"idebate","title":"Rehabilitation Constitutes an Unjustifiable Further Expense"},{"id":2638,"source":"idebate","title":"Juries need to have all the information possible in order to reach a fair verdict."},{"id":2639,"source":"idebate","title":"Jurors are already aware of information which might ‘bias’ their verdict."},{"id":2641,"source":"idebate","title":"Occasional disclosure of convictions leads to an inconsistent justice system."},{"id":2642,"source":"idebate","title":"The motion completely undermines the assumption of innocence which accompanies a fair trial."},{"id":2644,"source":"idebate","title":"The disclosure of previous convictions could falsely characterize the defendant.  "},{"id":2645,"source":"idebate","title":"Allowing this motion would lead to a miscarriage of justice."},{"id":2649,"source":"idebate","title":"Making destroying cultural heritage a crime against humanity would create severe strategic disadvantages for our armed forces. "},{"id":2651,"source":"idebate","title":"The protection of cultural property is not within the scope of the ICC."},{"id":2662,"source":"idebate","title":"Just as much of a violation of sovereignty as the ICC "},{"id":2674,"source":"idebate","title":"Yanukovych committed crimes against humanity"},{"id":2683,"source":"idebate","title":"In the decade since its formation, the ICC has only one successful conviction"},{"id":2687,"source":"idebate","title":"The ICC’s widely endorsed authority extends its deterrent effects."},{"id":2688,"source":"idebate","title":"Africa is overtly prosecuted"},{"id":2695,"source":"idebate","title":"The ICC indictment undermines democracy"},{"id":2697,"source":"idebate","title":"Kenya can prosecute these crimes itself"},{"id":2703,"source":"idebate","title":"The only just method"},{"id":2713,"source":"idebate","title":"Justice can harm peace."},{"id":2715,"source":"idebate","title":"The ICC has an anti-African bias"},{"id":2721,"source":"idebate","title":"ICC necessary to provide fair trials"},{"id":2724,"source":"idebate","title":"Can be reserved for the worst of the worst"},{"id":2727,"source":"idebate","title":"Too many innocents killed"},{"id":2732,"source":"idebate","title":"Reducing trust in the state"},{"id":2735,"source":"idebate","title":"A safer country"},{"id":2739,"source":"idebate","title":"Helps avoid political stunt trials"},{"id":2745,"source":"idebate","title":"Witnesses might be identified and placed in danger"},{"id":2746,"source":"idebate","title":"Unruly defendants can play up to the cameras"},{"id":2748,"source":"idebate","title":"Open justice – crimes with large numbers of victims"},{"id":2749,"source":"idebate","title":"Broadcasting provides a public record"},{"id":2750,"source":"idebate","title":"A ban would save lives "},{"id":2751,"source":"idebate","title":"Assault weapons are not necessary for self defence or hunting."},{"id":2752,"source":"idebate","title":"Banning assault weapons increases liberty and security"},{"id":2753,"source":"idebate","title":"An assault weapons ban would stop the manufacture of many of the deadliest guns."},{"id":2754,"source":"idebate","title":"An assault weapons ban would violate the second amendment"},{"id":2755,"source":"idebate","title":"It is incoherent to ban some guns"},{"id":2756,"source":"idebate","title":"Assault weapons are not used in most crimes"},{"id":2757,"source":"idebate","title":"A ban on assault weapons would not work, it will simply encourage a black market"},{"id":2761,"source":"idebate","title":"Article 98 Agreements are a crucial tool in maintaining American national sovereignty"},{"id":2762,"source":"idebate","title":"Withdrawal from Article 98 agreements would hamper relations with the US"},{"id":2764,"source":"idebate","title":"An ICC enforcement is a necessity if there is to be international criminal justice"},{"id":2766,"source":"idebate","title":"An ICC Enforcement arm would bring in a higher proportion of defendants in to trial"},{"id":2767,"source":"idebate","title":"An ICC enforcement arm would make the ICC more credible as an organization"},{"id":2769,"source":"idebate","title":"An ICC enforcement arm would be unduly expensive"},{"id":2770,"source":"idebate","title":"An ICC enforcement arm would be highly detrimental to the relations between the ICC and state parties"},{"id":2771,"source":"idebate","title":"ICC enforcement would create resentment"},{"id":2772,"source":"idebate","title":"U.S. demand for drugs"},{"id":2773,"source":"idebate","title":"U.S. supplies the guns used by drugs cartels"},{"id":2775,"source":"idebate","title":"U.S. policies have helped create the cartels"},{"id":2776,"source":"idebate","title":"Weak Mexican government is to blame not the U.S."},{"id":2778,"source":"idebate","title":"Mexico is poor; it is the economic conditions that drive conflict not the U.S."},{"id":2780,"source":"idebate","title":"Reporting generates a constant iteration of fear in the public, and precipitates a ratchet effect toward crime"},{"id":2783,"source":"idebate","title":"It is necessary for people to understand the extent of criminal activity in order for them to coordinate an effective response"},{"id":2784,"source":"idebate","title":"To not promote the truth of events is contrary to the duty, and to the right of free speech, of a responsible media"},{"id":2785,"source":"idebate","title":"The media’s reporting and investigating acts as a check on the behavior of the justice system"},{"id":2786,"source":"idebate","title":"The mainstream media is essential for the accurate reporting of information; without it reporting on violent crimes, they would simply be reported by less accountable, less accurate freelance reporters and blogs"},{"id":2790,"source":"idebate","title":"A flat rate is more just"},{"id":2804,"source":"idebate","title":"The statistics about poverty and crime show correlation, not causation. "},{"id":2806,"source":"idebate","title":"A legal qualification is a gateway to a number of different career paths."},{"id":2816,"source":"idebate","title":"No harm to non-drug users"},{"id":2817,"source":"idebate","title":"Right to privacy"},{"id":2825,"source":"idebate","title":"The arms ban is still necessary "},{"id":2831,"source":"idebate","title":"Tobacco companies may use movies to circumvent bans on advertising cigarettes"},{"id":2834,"source":"idebate","title":"The state has no right to interfere in this particular form of free expression"},{"id":2836,"source":"idebate","title":"Film does not directly influence the actions and decisions of individuals"},{"id":2838,"source":"idebate","title":"Coca production can be justified on cultural grounds"},{"id":2844,"source":"idebate","title":"Beauty contests objectify women"},{"id":2849,"source":"idebate","title":"War criminals need to be prosecuted in order to provide justice."},{"id":2857,"source":"idebate","title":"As the Schengen area gets bigger, it becomes more difficult to police and this increases the risk of rogue elements being able to move freely between countries"},{"id":2859,"source":"idebate","title":"Schengen helps divide Europe as not all members take part."},{"id":2860,"source":"idebate","title":"Schengen tightens external borders, creating a ‘wall’ around Europe. "},{"id":2862,"source":"idebate","title":"The Schengen Agreement is both a symbol of and fundamental means of upholding the unity of the European Union"},{"id":2864,"source":"idebate","title":"Schengen has allowed cooperation in fighting global crime"},{"id":2871,"source":"idebate","title":"Intervention might destabilize the peace deal in the South"},{"id":2876,"source":"idebate","title":"Conditions at Guantanamo are unjust and unacceptable: "},{"id":2881,"source":"idebate","title":"Decriminalisation will protect practitioners of sadomasochism"},{"id":2886,"source":"idebate","title":"The state permits individuals to risk harming themselves only where such risks can be independently scrutinised and regulated"},{"id":2892,"source":"idebate","title":"The Settlements are justified based on the expulsion of Jews from Arab lands after 1967"},{"id":2896,"source":"idebate","title":"Tibet is a distinct nation with a distinct history that China illegally invaded"},{"id":2898,"source":"idebate","title":"An independent Tibet would serve as a buffer state between India and China, reducing the chances of a regional clash"},{"id":2900,"source":"idebate","title":"Tibet has made enormous strides under Chinese rule"},{"id":2902,"source":"idebate","title":"China has viewed the last century and a half as non-stop efforts by Westerners to divide China. This looks like another."},{"id":2903,"source":"idebate","title":"Tibet could never be a viable independent state and would either become a Chinese puppet or a launching pad for American and Indian power against China."},{"id":2908,"source":"idebate","title":"Poorly constructed laws are not an excuse to abandon the prison system"},{"id":2912,"source":"idebate","title":"It blocks a significant amount of evidence"},{"id":2921,"source":"idebate","title":"Policing is a dangerous job. Police officers should be allowed to arm themselves"},{"id":2922,"source":"idebate","title":"Arming the police makes communities feel safer"},{"id":2923,"source":"idebate","title":"Arming the police is a necessary step"},{"id":2925,"source":"idebate","title":"When the police are armed, mistakes will lead to innocent people getting shot"},{"id":2927,"source":"idebate","title":"Arming the police does not deal with the causes underlying violence"},{"id":2931,"source":"idebate","title":"This turns court cases into entertainment, rather than legitimate legal proceedings."},{"id":2935,"source":"idebate","title":"The United Nations has a responsibility to prevent genocide and mass atrocities."},{"id":2936,"source":"idebate","title":"A strong United Nations commitment to the Right to Protect will create an effective deterrent to future atrocities."},{"id":2937,"source":"idebate","title":"Countries and governments have an obligation to protect human rights and defend their citizens from harm"},{"id":2940,"source":"idebate","title":"Blanket commitment creates a slippery slope of when to intervene."},{"id":2943,"source":"idebate","title":"Sanctions have been an effective long term policy tool in the past."},{"id":2944,"source":"idebate","title":"Sanctions can block the weapons that are used to perpetrate human rights violations."},{"id":2945,"source":"idebate","title":"Sanctions make clear where a country stands."},{"id":2946,"source":"idebate","title":"Just the threat of sanctions can be an effective coercive tool."},{"id":2947,"source":"idebate","title":"Sanctions are ineffective because it is very difficult to unify an adequate number of countries to cripple an economy."},{"id":2948,"source":"idebate","title":"Sanctions are ineffective because they hurt ordinary people more than leadership."},{"id":2949,"source":"idebate","title":"Sanctions are the opposite of free trade and therefore should not be used because free trade has greater benefits."},{"id":2950,"source":"idebate","title":"Sanctions are ineffective because they can be counterproductive."},{"id":2951,"source":"idebate","title":"The veto power is a barrier to discourse, preventing the U.N. from acting where the majority of its member states want it to."},{"id":2952,"source":"idebate","title":"The veto is wielded as an ideological tool."},{"id":2953,"source":"idebate","title":"The veto power is an anachronism that does not suit the contemporary international society and it's power relations."},{"id":2956,"source":"idebate","title":"The veto power was granted legally to the P5 by the other participating states, and therefore the P5 have a right to those powers."},{"id":2957,"source":"idebate","title":"The veto power has proven a success in the maintenance of peace."},{"id":2959,"source":"idebate","title":"The veto power reduces the risk of nuclear escalation."},{"id":2960,"source":"idebate","title":"Russian and the US have many areas where they can cooperate."},{"id":2961,"source":"idebate","title":"Desire to stabilize Central Asia"},{"id":2962,"source":"idebate","title":"Shared experience of terrorism"},{"id":2963,"source":"idebate","title":"Economically compatible"},{"id":2964,"source":"idebate","title":"Missile defence shows Russia is still suspicious of U.S. motives."},{"id":2965,"source":"idebate","title":"Russian and US strategic interests conflict"},{"id":2967,"source":"idebate","title":"Russian and US economic interests conflict"},{"id":2968,"source":"idebate","title":"Russian and US economic interests conflict"},{"id":2969,"source":"idebate","title":" The campaign is unpopular among the majority of NATO countries citizens, so we should solve the Afghan problem in diplomatic way, specifically through a power-sharing deal with the Taliban. "},{"id":2970,"source":"idebate","title":"The war is too expensive, so a deal needs to be made to end it."},{"id":2972,"source":"idebate","title":"Afghan history shows failings of foreign invasion, so this campaign is also doomed to failure.  "},{"id":2973,"source":"idebate","title":"We have successful precedents in Iraq and Africa, proving that a power-sharing approach works. "},{"id":2974,"source":"idebate","title":"The Taliban is a cruel and undemocratic regime, and so it should not be given any power."},{"id":2975,"source":"idebate","title":"The Taliban supports terrorist organizations, so they are not to be trusted. "},{"id":2977,"source":"idebate","title":"The Taliban manipulates the drug trade according to its will, so it should not be included into the government.  "},{"id":2978,"source":"idebate","title":"States should not be isolated on political grounds"},{"id":2979,"source":"idebate","title":"Myanmar is no longer a military dictatorship"},{"id":2981,"source":"idebate","title":"Disengagement has done more harm than good in the region"},{"id":2982,"source":"idebate","title":"Regional factors favour re-engagement"},{"id":2983,"source":"idebate","title":"Liberal democracies have a moral obligation to denounce illegitimate regimes"},{"id":2985,"source":"idebate","title":"Re-engagement will weaken the reform movement"},{"id":2987,"source":"idebate","title":"Doing away with ‘US arrogance’. "},{"id":2988,"source":"idebate","title":"Preconditions are like granting a veto to the extremists. "},{"id":2989,"source":"idebate","title":"Preconditions can damage a country’s negotiating position. "},{"id":2990,"source":"idebate","title":"Agreeing to preconditions can damage a leader’s position at home. "},{"id":2991,"source":"idebate","title":"The more the US waits, the stronger its opponents become. "},{"id":2992,"source":"idebate","title":"Preconditions are an essential gesture of good will. "},{"id":2993,"source":"idebate","title":"Rogue leaders can exploit such meetings to bolster their legitimacy"},{"id":2994,"source":"idebate","title":"Rogue regimes can use such meetings as a dilatory tactic to stall sanctions against them. "},{"id":2995,"source":"idebate","title":"Meeting with these leaders today might jeopardize America’s interests tomorrow. "},{"id":2996,"source":"idebate","title":"A federal Europe will benefit the citizens of its member states"},{"id":2997,"source":"idebate","title":"A federal Europe will protect the cultural diversity of its member states"},{"id":2998,"source":"idebate","title":"A federal Europe will be a stronger international actor"},{"id":2999,"source":"idebate","title":"The federal model has proved to be a success previously"},{"id":3000,"source":"idebate","title":"A federal Europe will ensure that large, multinational businesses remain accountable for their actions"},{"id":3001,"source":"idebate","title":"Moves toward federalism will endanger the stability of the EU"},{"id":3002,"source":"idebate","title":"Existing contributive inequalities within the Union would be amplified by a formal federal system"},{"id":3003,"source":"idebate","title":"The concept of federalism lacks political support"},{"id":3005,"source":"idebate","title":"Unbalanced decision making"},{"id":3006,"source":"idebate","title":"Under representation of emerging economies"},{"id":3013,"source":"idebate","title":"Free trade is good for development and growth. "},{"id":3015,"source":"idebate","title":"Trade is good for democracy. "},{"id":3016,"source":"idebate","title":"The FTAA is bad for industries in developing nations. "},{"id":3017,"source":"idebate","title":"The FTAA is bad for South American Agriculture. "},{"id":3018,"source":"idebate","title":"FTAA is bad for the environment. "},{"id":3019,"source":"idebate","title":"FTAA is bad for labour in developed countries. "},{"id":3020,"source":"idebate","title":"Palestine has its own infrastructure and government and is, in all meaningful ways a state "},{"id":3021,"source":"idebate","title":"Palestine is a legal entity and deserves to have its voice heard on an equal footing with Israel "},{"id":3024,"source":"idebate","title":"The Palestinian cause has no shortage of advocates in the UN this would add nothing to the discussion "},{"id":3025,"source":"idebate","title":"The UN has historically recognised statehood when nations achieve it, not when they ask for it or wish it "},{"id":3026,"source":"idebate","title":"The AU can bring peace to the continent"},{"id":3027,"source":"idebate","title":"There is already some African integration that can be built on."},{"id":3028,"source":"idebate","title":"Integration will fix the problem of borders"},{"id":3030,"source":"idebate","title":"African international organisations do not have a history of effectiveness"},{"id":3031,"source":"idebate","title":"The AU faces immense challenges that did not affect Europe"},{"id":3032,"source":"idebate","title":"The role of leaders will prevent success"},{"id":3033,"source":"idebate","title":"Giving money to the poor is the fairest way of eliminating poverty"},{"id":3035,"source":"idebate","title":"Providing money directly is efficient and eliminates corruption"},{"id":3036,"source":"idebate","title":"Providing money directly works."},{"id":3037,"source":"idebate","title":"Giving out money does not encourage people to take responsibility"},{"id":3038,"source":"idebate","title":"Money cannot be targeted to meet specific needs"},{"id":3039,"source":"idebate","title":"It is wrong to assume that the individual always knows best"},{"id":3040,"source":"idebate","title":"Every nation should be allowed to respect its war dead"},{"id":3043,"source":"idebate","title":"Honouring war criminals is wrong"},{"id":3045,"source":"idebate","title":"Makes Japan look militaristic"},{"id":3047,"source":"idebate","title":"Dictatorships are more effective than democracies at mobilizing resources for investment."},{"id":3048,"source":"idebate","title":"Dictatorships assure low cost political stability"},{"id":3049,"source":"idebate","title":"Dictatorships can prevent social unrest"},{"id":3050,"source":"idebate","title":"Democracy acts in the interest of the general population, which is good for development"},{"id":3053,"source":"idebate","title":"Democratic rule of law is the best ground for political stability and growth"},{"id":3054,"source":"idebate","title":"The dam would power Africa"},{"id":3055,"source":"idebate","title":"An immense boost to DRC’s economy"},{"id":3057,"source":"idebate","title":"A dam could make the Congo more usable"},{"id":3058,"source":"idebate","title":"Such a big project is beyond DRC’s capacity"},{"id":3059,"source":"idebate","title":"A dam would damage the environment"},{"id":3060,"source":"idebate","title":"Dams displace communities"},{"id":3063,"source":"idebate","title":"African forces will be trusted by Africans"},{"id":3065,"source":"idebate","title":"There is no need for an AU force"},{"id":3068,"source":"idebate","title":"The dam is predicted to provide energy for all of Ethiopia "},{"id":3069,"source":"idebate","title":"Economic benefits of the dam for Ethiopia"},{"id":3072,"source":"idebate","title":"Ethiopia does not need another hydroelectric dam "},{"id":3090,"source":"idebate","title":"Domestic courts are often incapable of providing a fair trial, when they fail the ICC fills the void."},{"id":3097,"source":"idebate","title":"It is unfair to new members of EU"},{"id":3110,"source":"idebate","title":"A European political union intrudes on its members’ sovereignty"},{"id":3114,"source":"idebate","title":"Political union lends international credibility to a trade bloc"},{"id":3118,"source":"idebate","title":"Too many strings"},{"id":3121,"source":"idebate","title":"India still has the most people in poverty"},{"id":3122,"source":"idebate","title":"India cannot end poverty on its own"},{"id":3123,"source":"idebate","title":"Development aid still makes a difference"},{"id":3125,"source":"idebate","title":"The money makes no difference"},{"id":3126,"source":"idebate","title":"Syria clearly meets the standards for intervention"},{"id":3127,"source":"idebate","title":"It is in the national interest for democracies to support those seeking to oust dictators"},{"id":3128,"source":"idebate","title":"The Free Syrian Army is outgunned"},{"id":3131,"source":"idebate","title":"Sovereignty and non intervention in internal affairs"},{"id":3132,"source":"idebate","title":"Arming the rebels would be unpopular"},{"id":3136,"source":"idebate","title":"Broadcasters almost never show scenes of torture or torment because they know this will cause offence, the same principle should apply here."},{"id":3137,"source":"idebate","title":"On issues such as gay marriage, human rights activists have taken the line that the right to marry is nobody else’s business. That principle of privacy should work both ways."},{"id":3138,"source":"idebate","title":"Where there is a clear objection to discussing a certain subject, insisting on doing so is not news, it’s propaganda."},{"id":3139,"source":"idebate","title":"The job of a journalist is to report the world and events as they see them. Cultural sensibilities do not alter the fact that these events have happened."},{"id":3140,"source":"idebate","title":"Citizens deserve the right to know what is happening in their name. "},{"id":3141,"source":"idebate","title":"Journalism should report the experiences of the vulnerable and oppressed just as much as those of the elite and powerful. "},{"id":3142,"source":"idebate","title":"The admission of Turkey will help the economy of the EU develop more dynamically."},{"id":3143,"source":"idebate","title":"Turkey is actually part of the European continent both geographically and historically."},{"id":3145,"source":"idebate","title":"Turkey is not enough economically developed to join the EU."},{"id":3146,"source":"idebate","title":"Turkey is not yet up to European standards of human rights."},{"id":3148,"source":"idebate","title":"EU expansion is right."},{"id":3149,"source":"idebate","title":"EU expansion is good for current members politically. "},{"id":3150,"source":"idebate","title":"EU expansion is good for current members economically. "},{"id":3151,"source":"idebate","title":"Expansion furthers EU ideals."},{"id":3152,"source":"idebate","title":"Expansion will create conflicts of interest between members."},{"id":3153,"source":"idebate","title":"The European Union is no longer in a financial position to be taking in new members."},{"id":3154,"source":"idebate","title":"There will be an even greater brain drain from poorer countries to richer."},{"id":3155,"source":"idebate","title":"Expansion would be unpopular."},{"id":3156,"source":"idebate","title":"Israel has no right to the occupied territories. "},{"id":3157,"source":"idebate","title":"Failure to withdraw blocks legitimate Palestinian aspirations to statehood. "},{"id":3158,"source":"idebate","title":"Returning to the 1967 borders would bring peace to Israel. "},{"id":3159,"source":"idebate","title":"Israel has the right to claim minimal territory to ensure security"},{"id":3160,"source":"idebate","title":"Returning to the 1967 borders would make war more likely. "},{"id":3161,"source":"idebate","title":"Many Israelis now live in the occupied territories. "},{"id":3162,"source":"idebate","title":"States should act to help civilians in failing states to prevent humanitarian crises"},{"id":3163,"source":"idebate","title":"Failing states can infect a whole region"},{"id":3164,"source":"idebate","title":"Failed states are havens for drug-smugglers and terrorists"},{"id":3165,"source":"idebate","title":"The United Nations has the constitutional power and capability to intervene to prevent failed states"},{"id":3166,"source":"idebate","title":"Interventions can fail and eventually cause more harm than good"},{"id":3167,"source":"idebate","title":"Failing states should not be provided a safety net"},{"id":3168,"source":"idebate","title":"The cost of intervention is too high"},{"id":3169,"source":"idebate","title":"International development is a more effective method of preventing failed states."},{"id":3170,"source":"idebate","title":"Intervention in fragile states is simply a new form of imperialism"},{"id":3171,"source":"idebate","title":":  Main purpose of UN, to prevent war, has clearly not been achieved. "},{"id":3172,"source":"idebate","title":"UN ignores or enables human rights abuses. "},{"id":3173,"source":"idebate","title":"UN decision-making procedures are very inefficient. "},{"id":3174,"source":"idebate","title":"Many UN bodies are corrupt or compromised. "},{"id":3175,"source":"idebate","title":"Most international co-operation can takes place outside UN framework. "},{"id":3176,"source":"idebate","title":"The UN has performed a valuable service in preventing wars and in peacekeeping. "},{"id":3177,"source":"idebate","title":"The UN has been at the forefront of promoting respect for international law and human rights. "},{"id":3178,"source":"idebate","title":"Many UN organs carry out valuable work around the world. "},{"id":3182,"source":"idebate","title":"Reparations would be a step towards closing colonial scars."},{"id":3183,"source":"idebate","title":"There is already a precedent for paying reparations to such states."},{"id":3184,"source":"idebate","title":"Reparations would effectively right the economic imbalance caused by colonialism."},{"id":3185,"source":"idebate","title":"Reparations demonstrate a true concern for the developing world."},{"id":3186,"source":"idebate","title":"Time has removed the opportunity to truly make reparations to those who may have deserved it."},{"id":3187,"source":"idebate","title":"Such reparations would do little to actually improve the developing countries."},{"id":3188,"source":"idebate","title":"Reparations unfairly target the taxpayers of former colonial powers who had nothing to do with the deeds committed under colonisation."},{"id":3190,"source":"idebate","title":"NATO expansion would benefit eastern European and post Soviet states"},{"id":3191,"source":"idebate","title":"NATO expansion was, and is, necessary for international stability"},{"id":3192,"source":"idebate","title":"NATO is a fundamental part of the international architecture used to further peace and prosperity in Europe"},{"id":3195,"source":"idebate","title":"Expanding NATO will overstretch the resources of its core members"},{"id":3196,"source":"idebate","title":"The cost of expansion is prohibitive"},{"id":3198,"source":"idebate","title":"The current treaty-basis for the European Union is enormous, ambiguous and extremely complicated"},{"id":3199,"source":"idebate","title":"A EU constitution will foster a “European identity”"},{"id":3201,"source":"idebate","title":"There already are constitutional documents"},{"id":3203,"source":"idebate","title":"A EU Constitution will lead to a superstate, which is undesirable at the moment"},{"id":3204,"source":"idebate","title":"A world government would reduce the probability of a catastrophic nuclear world war"},{"id":3205,"source":"idebate","title":"Economic globalization suggests the need for political globalization"},{"id":3206,"source":"idebate","title":"A world government would enhance the probability of mitigating global environmental problems"},{"id":3207,"source":"idebate","title":"A world government would foster a constructive cosmopolitanism"},{"id":3208,"source":"idebate","title":"There are successful precedents for supra-national bodies"},{"id":3209,"source":"idebate","title":"There is  no popular support for such a body"},{"id":3210,"source":"idebate","title":"A world government would be ineffective in practice"},{"id":3211,"source":"idebate","title":"A world government would add another, laborious level of bureaucracy"},{"id":3212,"source":"idebate","title":"The forces of nationalism are too strong to permit the loosening of state sovereignty any further"},{"id":3213,"source":"idebate","title":"There is no feasible transition path to a world government model"},{"id":3214,"source":"idebate","title":"Sharing Jerusalem is necessary for peace"},{"id":3215,"source":"idebate","title":"Palestine has as valid a claim to Jerusalem as Israel does: "},{"id":3217,"source":"idebate","title":"Jerusalem cannot be neatly or peacefully divided"},{"id":3218,"source":"idebate","title":"Jerusalem belongs to Israel"},{"id":3219,"source":"idebate","title":"Dividing Jerusalem would harm Israeli society: "},{"id":3220,"source":"idebate","title":"Offshore outsourcing is consistent with existing labour distribution patterns."},{"id":3221,"source":"idebate","title":"Offshore outsourcing accelerates the development of poorer states citizens."},{"id":3222,"source":"idebate","title":"Offshore outsourcing accelerates the development of poorer states’ infrastructure."},{"id":3223,"source":"idebate","title":"Offshore outsourcing reduces living standards and limits social mobility."},{"id":3224,"source":"idebate","title":"Outsourcing reduces businesses’ control over their supply chains. Offshoring firms are difficult to manage and cannot easily be held to account for failings and errors."},{"id":3225,"source":"idebate","title":"Offshoring exploits both individual workers and under developed states."},{"id":3226,"source":"idebate","title":"The pipeline will reduce American dependence on Middle Eastern and Latin American oil"},{"id":3228,"source":"idebate","title":"Rejecting the pipeline bid would worsen US relations with Canada"},{"id":3230,"source":"idebate","title":"America should not become more dependent on oil"},{"id":3231,"source":"idebate","title":"Sanctions harm the Cuban people. "},{"id":3232,"source":"idebate","title":"Sanctions are not working"},{"id":3233,"source":"idebate","title":"Sanctions are illegal"},{"id":3234,"source":"idebate","title":"Economic benefits of ending sanctions"},{"id":3236,"source":"idebate","title":"Cuba deserves sanctions"},{"id":3238,"source":"idebate","title":"Sanctions provide leverage"},{"id":3239,"source":"idebate","title":"Sanctions are necessary for national security"},{"id":3240,"source":"idebate","title":"The Rebate is not justified"},{"id":3242,"source":"idebate","title":"The rebate should go in exchange for CAP reform"},{"id":3243,"source":"idebate","title":"Giving up the rebate would mean better relations with the Europe Union"},{"id":3246,"source":"idebate","title":"The Rebate makes membership acceptable to the British people"},{"id":3247,"source":"idebate","title":"The rebate could never be regained"},{"id":3249,"source":"idebate","title":"There is little room for small states in a globalizing world "},{"id":3251,"source":"idebate","title":"Norway and Switzerland already implement many EU policies"},{"id":3252,"source":"idebate","title":"The EU shares the same values as Norway and Switzerland"},{"id":3253,"source":"idebate","title":"It would be easy to assimilate into the EU"},{"id":3255,"source":"idebate","title":"CAP and Fisheries policies would damage traditional industr"},{"id":3257,"source":"idebate","title":"The EU ought to make English its working language in order to be a more transparent democracy for the rest of the world."},{"id":3259,"source":"idebate","title":"It is more practical to work through one language that all Member States understand in order to ensure the effectiveness of communication."},{"id":3260,"source":"idebate","title":"One working language understood by all Member States is a more practical way of communicating often untranslatable yet vital EU-specific vocabulary."},{"id":3261,"source":"idebate","title":"There already exists a pan-European identity across all EU Member States, and a single working language would help to strengthen that identity."},{"id":3262,"source":"idebate","title":"Working through many languages in the European Union costs money that could be spent on EU’s projects rather than unnecessary conversation."},{"id":3263,"source":"idebate","title":"Britain is the country of Euroscepticism, and its official language is English. For English to be the medium, the mouthpiece for the EU communications is wholly wrong."},{"id":3264,"source":"idebate","title":"Translation is an intercultural activity that the EU must embrace if it continues to hold “United in diversity” as its motto."},{"id":3266,"source":"idebate","title":"If the EU ‘elects’ a single working language, it will be deliberately contributing to the narrow-minded, anglicising of the entire world, despite being a union of diverse cultures with the power to fight it."},{"id":3273,"source":"idebate","title":"A two-state solution is best for peace"},{"id":3274,"source":"idebate","title":"A one-state solution mean Israel would cease to be either democratic or Jewish"},{"id":3275,"source":"idebate","title":"Only a two-state solution can satisfy both sides "},{"id":3276,"source":"idebate","title":"Only a one-state solution can end the conflict "},{"id":3277,"source":"idebate","title":"Israelis and Palestinians are too intermingled for a two-state solution "},{"id":3278,"source":"idebate","title":"Only a one-state solution can guarantee equal rights for all"},{"id":3284,"source":"idebate","title":"The US used its power to establish a set of open global institutions which have been broadly beneficial."},{"id":3285,"source":"idebate","title":"The US had led the world through consent rather than coercion. "},{"id":3286,"source":"idebate","title":"The US has provided global leadership in tackling important issues such as terrorism."},{"id":3287,"source":"idebate","title":"Where the US has used military force, it has largely done it to uphold human rights and international peace, security and prosperity."},{"id":3288,"source":"idebate","title":"The US has used its power to promote democracy, human rights and international law"},{"id":3289,"source":"idebate","title":"The US is not a hegemon at all, but an imperialist power-an empire. "},{"id":3290,"source":"idebate","title":"The US has used its power to undermine the sovereignty of other nations, often through coercion and violence. "},{"id":3291,"source":"idebate","title":"The US has arrogantly (and dangerously) sought to reshape the world in its own image."},{"id":3292,"source":"idebate","title":"The US eschews multilateralism and prefers unilateralism."},{"id":3293,"source":"idebate","title":"The US has established an unjust system of unequal relationships in order to exploit developing countries."},{"id":3297,"source":"idebate","title":"No-growth funding policy results in better operation of the finances and will improve financial discipline."},{"id":3298,"source":"idebate","title":"A no-growth budget for the UN lacks flexibility"},{"id":3299,"source":"idebate","title":"The current global problems constantly require more funding."},{"id":3302,"source":"idebate","title":"Only a more representative United Nations Security Council is legitimate."},{"id":3304,"source":"idebate","title":"The European Union is meant to prevent war being on the UNSC would allow it to actively promote peace."},{"id":3306,"source":"idebate","title":"France and Britain should be willing to give up their seats for the European Union."},{"id":3307,"source":"idebate","title":"The United Nations is meant to be a body of nation states."},{"id":3308,"source":"idebate","title":"The only way the United Nations Security Council can be reformed is through expansion."},{"id":3313,"source":"idebate","title":"Africa does not have the resources to protect itself from climate change"},{"id":3314,"source":"idebate","title":"The developed world has the responsibility to help others"},{"id":3317,"source":"idebate","title":"Each country should tackle its own problems"},{"id":3319,"source":"idebate","title":"There are other more urgent things to be spending money on"},{"id":3322,"source":"idebate","title":"Improving health care for mother and child"},{"id":3328,"source":"idebate","title":"Small is beautiful: community empowerment"},{"id":3329,"source":"idebate","title":"Ending poverty through entrepreneurialism  "},{"id":3338,"source":"idebate","title":"Peace may finally be at hand"},{"id":3339,"source":"idebate","title":"An ongoing humanitarian crisis"},{"id":3340,"source":"idebate","title":"Resources still flow out of the country"},{"id":3342,"source":"idebate","title":"Allegations of misconduct by peacekeepers"},{"id":3345,"source":"idebate","title":"Involving men is the best way to ensure family planning works"},{"id":3346,"source":"idebate","title":"Family planning is wrong: controlling sexuality"},{"id":3349,"source":"idebate","title":"A competitive airline industry"},{"id":3357,"source":"idebate","title":"Reduce smoking"},{"id":3358,"source":"idebate","title":"Easy to introduce"},{"id":3360,"source":"idebate","title":"Nip the problem in the bud"},{"id":3363,"source":"idebate","title":"Ban would harm the wider economy"},{"id":3366,"source":"idebate","title":"Only an international treaty can create penalties for non-compliance"},{"id":3368,"source":"idebate","title":"Sovereign states should be allowed to set their own targets and be trusted to meet them"},{"id":3372,"source":"idebate","title":"Prioritizing donors creates an incentive to become a donor"},{"id":3373,"source":"idebate","title":"Organ donors are more deserving of organs"},{"id":3376,"source":"idebate","title":"This system will punish people for a past decision they cannot now undo"},{"id":3377,"source":"idebate","title":"Denying organs to non-donors is unduly coercive.  "},{"id":3378,"source":"idebate","title":"People may have valid religious reasons not to donate organs"},{"id":3379,"source":"idebate","title":"Ignorance about sex is the primary cause of the spread of sexually transmitted diseases (STDs)"},{"id":3380,"source":"idebate","title":"Abstinence is an outdated view, based on religious teaching, which may be a personal choice but is not to be expected as the norm for everyone"},{"id":3381,"source":"idebate","title":"The information age makes attempting to hide information on sex impossible"},{"id":3383,"source":"idebate","title":"Sex education leads to experimentation and early intercourse, and indirectly encourages promiscuity"},{"id":3385,"source":"idebate","title":"Responsibility for children's moral and sexual upbringing is not the responsibility of schools"},{"id":3386,"source":"idebate","title":"Sex education for underage children undermines  the law"},{"id":3387,"source":"idebate","title":"Cannabis has many medical properties, notably the alleviation of suffering in chronic diseases. It should therefore be freely available"},{"id":3388,"source":"idebate","title":"All drugs can be used for a variety of purposes some appropriate some inappropriate that’s a matter of choice, treatment should be based on medical reality"},{"id":3389,"source":"idebate","title":"For governments to refuse treatment on the basis of an unreasonable assertion is cruel and blindly ideological "},{"id":3390,"source":"idebate","title":"In most countries where there is an acceptance of the medical value of cannabis it is fairly easily available, this would simply condone its recreational use"},{"id":3391,"source":"idebate","title":"By expanding the legal use of the drug, it simply makes the illegal, recreational use easier as there’s a greater supply "},{"id":3392,"source":"idebate","title":"By promoting the use of soft drugs in any context, encourages young people down a slippery slope toward harder drugs "},{"id":3393,"source":"idebate","title":"Food labeling is an important form of consumer protection"},{"id":3394,"source":"idebate","title":"Food labeling helps people make better choices regarding their food"},{"id":3395,"source":"idebate","title":"Food labeling encourages food companies to provide food more in tune with consumer values"},{"id":3396,"source":"idebate","title":"Food labeling does not change consumer behavior"},{"id":3397,"source":"idebate","title":"Food labeling allows companies to deceive consumers"},{"id":3398,"source":"idebate","title":"Food labeling introduces unfair prejudice against certain products"},{"id":3403,"source":"idebate","title":"Such a tax would not work"},{"id":3404,"source":"idebate","title":"Costs more to those who can’t afford to pay"},{"id":3405,"source":"idebate","title":"A school breakfast gives all students an equal start to the day"},{"id":3406,"source":"idebate","title":"Schools are best places to ensure good nutrition"},{"id":3407,"source":"idebate","title":"A healthy breakfast improves students concentration"},{"id":3409,"source":"idebate","title":"Nutrition is the parents responsibility"},{"id":3410,"source":"idebate","title":"Government should focus on the most needy"},{"id":3411,"source":"idebate","title":"A school breakfast for all is a greater cost on schools"},{"id":3412,"source":"idebate","title":"Can we be sure a school meal will be healthy?"},{"id":3416,"source":"idebate","title":"Banning would help create a beneficial cultural shift"},{"id":3418,"source":"idebate","title":"Almost impossible to achieve; images will just come from elsewhere"},{"id":3421,"source":"idebate","title":"A ban may make the problem worse"},{"id":3423,"source":"idebate","title":"The ban is necessary to confront the growing problem of obesity in NYC."},{"id":3424,"source":"idebate","title":"The City has the obligation to protect its citizenry"},{"id":3425,"source":"idebate","title":"The Soda Ban is an infringement upon the personal right to choose"},{"id":3426,"source":"idebate","title":"The Ban Would Be a Barrier to Free Enterprise "},{"id":3427,"source":"idebate","title":"It is undemocratic to have the law pass through the board of health."},{"id":3431,"source":"idebate","title":"It's my body and I'll starve if I want to"},{"id":3432,"source":"idebate","title":"Banning advertising won't work"},{"id":3434,"source":"idebate","title":"Many alternative remedies, such as homeopathy, offer nothing but a false hope and can discourage patients from consulting a doctor with what may be serious symptoms"},{"id":3437,"source":"idebate","title":"A huge number of fully accepted medical practices started being seen as something a bit off the wall, it’s wrong to deny sick people access to a treatment that may be mainstream in 20 years"},{"id":3438,"source":"idebate","title":"The pharmaceutical and medical industries are worth billions of dollars annually. They have an interest in ignoring the efficacy of remedies that are, for the most part, free or considerably cheaper"},{"id":3440,"source":"idebate","title":"Health care would substantially reduce overall costs"},{"id":3441,"source":"idebate","title":"Current health care systems are not sustainable"},{"id":3443,"source":"idebate","title":"Healthcare has been recognised as a right"},{"id":3444,"source":"idebate","title":"Universal healthcare systems are inefficient"},{"id":3445,"source":"idebate","title":"Universal healthcare is not affordable"},{"id":3446,"source":"idebate","title":"Universal healthcare stifles innovation"},{"id":3447,"source":"idebate","title":"Trans fats are uniquely unhealthy"},{"id":3449,"source":"idebate","title":"The state should ban trans fats to protect the public"},{"id":3450,"source":"idebate","title":"Trans fats are not uniquely unhealthy"},{"id":3451,"source":"idebate","title":"The government should provide information to consumers, not restrict choice"},{"id":3452,"source":"idebate","title":"Banning trans fats in uneconomical"},{"id":3454,"source":"idebate","title":"Patients will be better informed than under the status quo"},{"id":3455,"source":"idebate","title":"Advertising will enable patients to get better treatment earlier in their illnesses"},{"id":3456,"source":"idebate","title":"Adverts generate profit. Profit funds research into improved drugs"},{"id":3457,"source":"idebate","title":"Creating a mentality of illness"},{"id":3458,"source":"idebate","title":"Advertising puts pressure on doctors to prescribe inappropriate drugs to their patients"},{"id":3459,"source":"idebate","title":"The costs and effects of advertising will place an additional burden on the healthcare system"},{"id":3461,"source":"idebate","title":"It’s in the interests of employees"},{"id":3462,"source":"idebate","title":"It’s in the interests of co-workers"},{"id":3463,"source":"idebate","title":"Tackling HIV requires a responsible and active position by everyone"},{"id":3464,"source":"idebate","title":"Employers have no right to private medical information"},{"id":3465,"source":"idebate","title":"The risks of ignorance and prejudice are too high"},{"id":3466,"source":"idebate","title":"It is a disincentive to get tested in the first place"},{"id":3468,"source":"idebate","title":"Multiple vaccines cause no harm "},{"id":3469,"source":"idebate","title":"Multiple vaccines do not cause autism"},{"id":3470,"source":"idebate","title":"All vaccinations are tested rigorously before they are approved, and tracked afterwards "},{"id":3471,"source":"idebate","title":"More vaccines together destroy the immune system "},{"id":3472,"source":"idebate","title":"Cases prove that vaccines have bad consequences for children’s health"},{"id":3474,"source":"idebate","title":"Governments have the obligation to protect citizens from harmful substances"},{"id":3475,"source":"idebate","title":"Banning alcohol protects third parties (family members) from harm.  "},{"id":3476,"source":"idebate","title":"Banning alcohol would lead to healthier individuals. "},{"id":3477,"source":"idebate","title":"The state should keep alcohol legal in order to maximize citizens’ rights.  "},{"id":3478,"source":"idebate","title":"Prohibition would be impractical and serve only to create an enormous black market"},{"id":3480,"source":"idebate","title":"Banning alcohol harms the economy.  "},{"id":3483,"source":"idebate","title":"A fat tax levels out the playing field for healthier food"},{"id":3484,"source":"idebate","title":"A fat tax infringes on individual choice"},{"id":3485,"source":"idebate","title":"A tax is not an effective instrument to fight obesity"},{"id":3486,"source":"idebate","title":"It hits the most vulnerable part of society hardest"},{"id":3488,"source":"idebate","title":"Schools are the best place to create lasting lifestyle changes."},{"id":3489,"source":"idebate","title":"Better nutrition leads to better students."},{"id":3490,"source":"idebate","title":"Schools should educate about healthy choices, not make them on the students’ behalf."},{"id":3491,"source":"idebate","title":"Targeting schools will be an ineffective strategy."},{"id":3492,"source":"idebate","title":"“Junk food” sales are an important source of funding for schools. "},{"id":3493,"source":"idebate","title":"Pupils will bring unhealthy food with them to schools. "},{"id":3500,"source":"idebate","title":"Prototypes have seen success"},{"id":3501,"source":"idebate","title":"These products are dangerous"},{"id":3502,"source":"idebate","title":"They fuel colourism in society"},{"id":3505,"source":"idebate","title":"Prohibition is counterproductive"},{"id":3506,"source":"idebate","title":"Banning these is papering over the issue"},{"id":3507,"source":"idebate","title":"Run education campaigns instead"},{"id":3508,"source":"idebate","title":"Women are the backbone of Africa’s agriculture"},{"id":3509,"source":"idebate","title":"Women provide a platform for economic development"},{"id":3510,"source":"idebate","title":"There is greater potential for African women"},{"id":3512,"source":"idebate","title":"Women are not the future for Africa’s economy "},{"id":3516,"source":"idebate","title":"EU membership is good for tourism "},{"id":3517,"source":"idebate","title":"Joining Europe is unrealistic"},{"id":3518,"source":"idebate","title":"Cape Verde should be a beacon for Africa"},{"id":3519,"source":"idebate","title":"Geographical stretch too far"},{"id":3520,"source":"idebate","title":"Moving is an imperative"},{"id":3523,"source":"idebate","title":"Other nations have an obligation to help"},{"id":3524,"source":"idebate","title":"Other states would not want to waste resources on a refugee state"},{"id":3533,"source":"idebate","title":"PRC is clearly the China that matters"},{"id":3534,"source":"idebate","title":"Economically beneficial"},{"id":3535,"source":"idebate","title":"Should not ignore the will of 1.3billion"},{"id":3539,"source":"idebate","title":"Receive much greater interest from Taiwan"},{"id":3540,"source":"idebate","title":"Economic Development will be boosted in the entire region."},{"id":3541,"source":"idebate","title":"Conflicts and insecurity in the region will be resolved."},{"id":3542,"source":"idebate","title":"Education standards will be improved across the region"},{"id":3543,"source":"idebate","title":"It will serve an example of Pan-Africanism and encourage many to join the movement. "},{"id":3544,"source":"idebate","title":"The EAC is not yet a strong bloc to be widened"},{"id":3545,"source":"idebate","title":"The potential entrants are still weak and pose a threat to the growing EAC"},{"id":3546,"source":"idebate","title":"The EAC is not different from the AU which aims at integrating all African states."},{"id":3547,"source":"idebate","title":"The dispute damages Morocco-Spain relations "},{"id":3549,"source":"idebate","title":"Spain is being hypocritical "},{"id":3550,"source":"idebate","title":"The citizens do not want to be ceded"},{"id":3551,"source":"idebate","title":"The cities are a source of revenue for Spain "},{"id":3552,"source":"idebate","title":"They have been Spanish possessions for centuries"},{"id":3554,"source":"idebate","title":"The network approach: promoting learning"},{"id":3557,"source":"idebate","title":"Taking healthcare beyond basic needs"},{"id":3559,"source":"idebate","title":"Resolving the health service crisis?"},{"id":3560,"source":"idebate","title":"A dangerous reliance on technology?"},{"id":3562,"source":"idebate","title":"Vulnerable to unrest  "},{"id":3563,"source":"idebate","title":"Profit margins are too small "},{"id":3565,"source":"idebate","title":"Tourism causes pollution"},{"id":3566,"source":"idebate","title":"Produces Employment"},{"id":3568,"source":"idebate","title":"Other industries are less reliable"},{"id":3571,"source":"idebate","title":"Self determination"},{"id":3574,"source":"idebate","title":"Chagos islanders don’t all want to belong to Mauritius"},{"id":3576,"source":"idebate","title":"Social Policy: encouraging teaching careers "},{"id":3578,"source":"idebate","title":"Incentivising movement so there are teachers where they are needed"},{"id":3579,"source":"idebate","title":"Social Policy for satisfied teachers"},{"id":3584,"source":"idebate","title":"Development from within"},{"id":3585,"source":"idebate","title":"A new perspective, raising topical issues"},{"id":3586,"source":"idebate","title":"Encouraging film entrepreneurs"},{"id":3590,"source":"idebate","title":"Short term hype"},{"id":3591,"source":"idebate","title":"Natural habitats being are destroyed"},{"id":3592,"source":"idebate","title":"Poaching is becoming more advanced"},{"id":3593,"source":"idebate","title":"Endangered animals are a source of pride for African countries"},{"id":3594,"source":"idebate","title":"Poaching is linked to terrorism "},{"id":3595,"source":"idebate","title":"The justice system does not currently work"},{"id":3596,"source":"idebate","title":"African countries have little money to spare"},{"id":3598,"source":"idebate","title":"Legalising the trade of horns, ivory, furs and pelts would be more effective"},{"id":3599,"source":"idebate","title":"Heavy handed approaches do not solve the motivations for poaching"},{"id":3600,"source":"idebate","title":"Resource abundance has led to poor governance"},{"id":3602,"source":"idebate","title":"Foreign companies gain most of the profits"},{"id":3603,"source":"idebate","title":"Resources are a source of conflict"},{"id":3604,"source":"idebate","title":"Source of trade"},{"id":3606,"source":"idebate","title":"Natural resources create employment"},{"id":3607,"source":"idebate","title":"Ethnic borders erase a wrong of history"},{"id":3609,"source":"idebate","title":"Preventing conflict"},{"id":3610,"source":"idebate","title":"Encouraging development"},{"id":3611,"source":"idebate","title":"Redrawing could be democratic"},{"id":3612,"source":"idebate","title":"Violates current states sovereignty"},{"id":3613,"source":"idebate","title":"Encourages Secessionism"},{"id":3614,"source":"idebate","title":"Would create odd borders."},{"id":3615,"source":"idebate","title":"Damages dreams of African unity"},{"id":3616,"source":"idebate","title":"An African voice would change priorities for the better"},{"id":3617,"source":"idebate","title":"The UNSC mostly deals with Africa"},{"id":3618,"source":"idebate","title":"The current UNSC Membership is outdated"},{"id":3619,"source":"idebate","title":"More vetoes mean less action"},{"id":3623,"source":"idebate","title":"Decriminalising increses sex workers’ rights."},{"id":3624,"source":"idebate","title":"Sex work is legitimate work. "},{"id":3625,"source":"idebate","title":"Legalising ensures health care and safe sex."},{"id":3626,"source":"idebate","title":"Monitoring who enters the sex trade."},{"id":3628,"source":"idebate","title":"The market framework: sex work is an industry."},{"id":3630,"source":"idebate","title":"Legalization leaves ‘risk’ in the hands of the worker."},{"id":3631,"source":"idebate","title":"The concept of what is a journalist needs to be clarified to deal with the reality of new forms of mass communication. Assange gathers, collates and disseminates information, ergo, he is a journalist."},{"id":3632,"source":"idebate","title":"Governments have always struggled with the idea of press investigation and freedom of information, claiming Assange is not a journalist is simply a stunt. "},{"id":3633,"source":"idebate","title":"There is a difference between actual journalists and those who like having their names published in newspapers. Assange has far more claim to the description than many of them."},{"id":3634,"source":"idebate","title":"Assange is mostly interested in self-promotion, not being a serious journalist."},{"id":3636,"source":"idebate","title":"Wikileaks is not a news organisation, it exists exclusively to disseminate classified information, no genuine news organisation has such an agenda."},{"id":3640,"source":"idebate","title":"Why cause offence to no purpose?"},{"id":3645,"source":"idebate","title":"Predicting and protecting the future nation"},{"id":3649,"source":"idebate","title":"Money is intrinsic to political speech."},{"id":3653,"source":"idebate","title":"Unlimited political contributions undermine fair democratic representation."},{"id":3654,"source":"idebate","title":"Money stifles, it does not advance debate. "},{"id":3655,"source":"idebate","title":"Underground Nuclear Storage is Necessary"},{"id":3656,"source":"idebate","title":"Underground Nuclear Storage is Safe"},{"id":3657,"source":"idebate","title":"Underground Nuclear Storage is Expensive."},{"id":3658,"source":"idebate","title":"There Are Better Alternatives to Underground Nuclear Waste Storage"},{"id":3660,"source":"idebate","title":"Cap and Trade is Better at reducing carbon emissions than a carbon tax."},{"id":3661,"source":"idebate","title":"Cap and Trade is More Economical Than a Carbon Tax"},{"id":3662,"source":"idebate","title":"A Cap and Trade system is fairer to producers"},{"id":3663,"source":"idebate","title":"Cap and Trade is Less Feasible Than a Carbon Tax"},{"id":3665,"source":"idebate","title":"Cap and Trade will Harm Energy Consumers"},{"id":3666,"source":"idebate","title":"Nuclear energy is non-renewable source"},{"id":3667,"source":"idebate","title":"Nuclear energy goes against Green World"},{"id":3671,"source":"idebate","title":"Phasing nuclear out would be too expensive"},{"id":3675,"source":"idebate","title":"Some of the required adaptations are impossible"},{"id":3678,"source":"idebate","title":"Adaptation is likely to hurt poorer nations"},{"id":3681,"source":"idebate","title":"School uniforms are often impractical or uncomfortable"},{"id":3684,"source":"idebate","title":"School uniforms create a sense of equality"},{"id":3689,"source":"idebate","title":"It is morally acceptable to make welfare conditional."},{"id":3690,"source":"idebate","title":"Requiring school attendance allows welfare to be the hand-up that it is meant to be, and keep children out of crime."},{"id":3692,"source":"idebate","title":"Connecting welfare to failure of parents is unfair."},{"id":3694,"source":"idebate","title":"It is unjust to make welfare conditional"},{"id":3697,"source":"idebate","title":"Compulsory vaccines are a financial relief on the health system  "},{"id":3698,"source":"idebate","title":"Compulsory vaccination violates the individuals’ right to bodily integrity"},{"id":3699,"source":"idebate","title":"It is a parental right to decide about vaccinations for a child"},{"id":3700,"source":"idebate","title":"Vaccines have severe side effects "},{"id":3701,"source":"idebate","title":"Improves student achievement. "},{"id":3702,"source":"idebate","title":"Reduce “summer learning loss”. "},{"id":3703,"source":"idebate","title":"Reduce social problems from disaffected, bored youth. "},{"id":3704,"source":"idebate","title":"Year-round learning can help reduce the burden on parents."},{"id":3707,"source":"idebate","title":"More efficient use of school resources and premises. "},{"id":3708,"source":"idebate","title":"Places unfair burden on students. "},{"id":3710,"source":"idebate","title":"Damaging to extra-curricular activities. "},{"id":3711,"source":"idebate","title":"Standardized tests are arbitrary"},{"id":3718,"source":"idebate","title":"Creative arts graduates are rarely well rewarded"},{"id":3719,"source":"idebate","title":"The Arts should be learnt on the job – it’s a craft "},{"id":3725,"source":"idebate","title":"Raising the school-leaving age is a crucial investment in society’s future"},{"id":3726,"source":"idebate","title":"Raising the school leaving age promotes equal opportunities"},{"id":3728,"source":"idebate","title":"Not All Skills are Best Learnt in a Classroom Environment"},{"id":3730,"source":"idebate","title":"Students are forcing themselves through university even when it is not right for them"},{"id":3731,"source":"idebate","title":"Vocational courses produce better employees"},{"id":3732,"source":"idebate","title":"Universities don’t have unlimited places available"},{"id":3734,"source":"idebate","title":"University education gives people something to aim for"},{"id":3736,"source":"idebate","title":"Universities cut across class and social divides in a unique way"},{"id":3739,"source":"idebate","title":"Some people find maths hard"},{"id":3740,"source":"idebate","title":"If we don’t teach maths we can teach other things instead"},{"id":3742,"source":"idebate","title":"Maths teaches a kind of logic which is useful for other things"},{"id":3743,"source":"idebate","title":"Children should not be the arbiters of the education system"},{"id":3745,"source":"idebate","title":"Homework takes up class time"},{"id":3755,"source":"idebate","title":"Poetry is cross-curricular"},{"id":3759,"source":"idebate","title":"Delivering funding via a graduate tax is the best way to encourage more students to enter higher education"},{"id":3760,"source":"idebate","title":"A graduate tax would make university funding more sustainable"},{"id":3761,"source":"idebate","title":"A graduate tax would make access to higher education fairer and more equitable"},{"id":3762,"source":"idebate","title":"Setting up a graduate tax system would be damagingly expensive"},{"id":3763,"source":"idebate","title":"Alternative- and more efficient- methods of funding universities are available"},{"id":3765,"source":"idebate","title":"Graduates may move abroad to avoid tax payments"},{"id":3767,"source":"idebate","title":"Improving the quality of state managed education"},{"id":3768,"source":"idebate","title":"Increasing parents' freedom of choice"},{"id":3769,"source":"idebate","title":"The most vulnerable children would be left behind by the scheme"},{"id":3770,"source":"idebate","title":"Only well-off families will benefit from increased freedom of choice"},{"id":3771,"source":"idebate","title":"The state retain control of schools - freedom, in this context, is illusory"},{"id":3772,"source":"idebate","title":"Parental Incentives"},{"id":3777,"source":"idebate","title":"Unjust"},{"id":3779,"source":"idebate","title":"Authority Aversion"},{"id":3782,"source":"idebate","title":"Learning a language is a sign of good diplomacy."},{"id":3783,"source":"idebate","title":"The solution is more teaching of languages not less."},{"id":3784,"source":"idebate","title":"Learning languages promotes understanding of other cultures"},{"id":3785,"source":"idebate","title":"Students should be free to choose to play to their strengths. "},{"id":3787,"source":"idebate","title":"Not everyone will succeed in learning languages even if compulsory."},{"id":3789,"source":"idebate","title":"There is much less need to learn foreign languages for countries where English is the first language."},{"id":3791,"source":"idebate","title":"Private schools are financially beneficial for state schools"},{"id":3792,"source":"idebate","title":"Private schools provide a better education than state schools"},{"id":3794,"source":"idebate","title":"Private schools lack diversity"},{"id":3796,"source":"idebate","title":"More education brings more opportunities"},{"id":3797,"source":"idebate","title":"Raising the school-leaving age is a crucial investment in society's future"},{"id":3799,"source":"idebate","title":"Forced education achieves little"},{"id":3800,"source":"idebate","title":"Not all skills are best learnt in a classroom environment."},{"id":3801,"source":"idebate","title":"There are cases where leaving school early is necessary"},{"id":3802,"source":"idebate","title":"Sex education provides “Immunization” against  sexually transmitted diseases and prevents unwanted pregnancy "},{"id":3803,"source":"idebate","title":"A safe framework for understanding sexuality and sexual identity are essential to human existence"},{"id":3805,"source":"idebate","title":"Even religious and conservative communities will benefit from mandatory sex education"},{"id":3806,"source":"idebate","title":"Parents should have the final choice in sex education for their children "},{"id":3807,"source":"idebate","title":"Sex education damages the education system"},{"id":3808,"source":"idebate","title":"Sexual development is a process of gradual discovery and cannot be effectively taught in a classroom"},{"id":3809,"source":"idebate","title":"The state has had no historical role in sex education to no ill effect, so should it develop one now."},{"id":3810,"source":"idebate","title":"Homework has little educational worth, and therefore is a waste of students' time"},{"id":3811,"source":"idebate","title":"Marking homework reduces the amount of time teachers have to prepare good lessons"},{"id":3812,"source":"idebate","title":"Homework reduces the amount of time for students to do other activities"},{"id":3813,"source":"idebate","title":"Homework puts students off learning"},{"id":3814,"source":"idebate","title":"Homework is about 'winning' on tests, not learning"},{"id":3816,"source":"idebate","title":"Homework encourages students to work more independently (by themselves)"},{"id":3817,"source":"idebate","title":"Homework ensures that students practise what they are taught at school"},{"id":3818,"source":"idebate","title":"Homework provides a link between child, school and the home"},{"id":3819,"source":"idebate","title":"Homework is an essential part of education, allowing students to learn information beyond that which they are taught at school."},{"id":3820,"source":"idebate","title":"Heathrow is full; it must expand"},{"id":3821,"source":"idebate","title":"The expansion of Heathrow is vital for the economy"},{"id":3823,"source":"idebate","title":"The third run-way would cause noise and pollution problems"},{"id":3824,"source":"idebate","title":"Expanding Heathrow would be at the expense of the environment"},{"id":3825,"source":"idebate","title":"The economic case for expansion does not add up"},{"id":3826,"source":"idebate","title":"Slaughter without stunning is painful for the animal"},{"id":3827,"source":"idebate","title":"We should treat animals well"},{"id":3831,"source":"idebate","title":"When done properly, religious slaughter is as good as any other "},{"id":3832,"source":"idebate","title":"Most stunning methods are not reliable"},{"id":3833,"source":"idebate","title":"Attacking religious practices makes religious groups uncomfortable "},{"id":3834,"source":"idebate","title":"The problem is not a significant one"},{"id":3835,"source":"idebate","title":"The Arctic should be saved for future generations"},{"id":3836,"source":"idebate","title":"The Arctic is a diverse but fragile ecosystem"},{"id":3838,"source":"idebate","title":"There is a growing demand for mineral resources "},{"id":3839,"source":"idebate","title":"Creating jobs and opportunities "},{"id":3841,"source":"idebate","title":"The use of animals in sport demeans humans"},{"id":3842,"source":"idebate","title":"Blood sports cannot be justified by reference to their role in pest control or conservation"},{"id":3843,"source":"idebate","title":"Treating animals as property prevents them from being perceived as part of the moral community"},{"id":3844,"source":"idebate","title":"Animals are harmed when used as objects of entertainment, no matter how innocent that entertainment is"},{"id":3845,"source":"idebate","title":"Fighting bulls have a better quality of life than meat-producing bulls"},{"id":3847,"source":"idebate","title":"Hydro electric dams reduce carbon dioxide emissions"},{"id":3848,"source":"idebate","title":"Hydroelectric dams provide cheap access to renewable energy"},{"id":3849,"source":"idebate","title":"Hydroelectric dams can be used to provide flood control and irrigation"},{"id":3850,"source":"idebate","title":"Hydroelectric dams increase methane emissions"},{"id":3851,"source":"idebate","title":"Hydro electric dams destroy existing ecosystems"},{"id":3852,"source":"idebate","title":"Hydroelectric dams destroy communities"},{"id":3853,"source":"idebate","title":"Wind energy is an economic form of energy generation reducing both running costs and environmental harm"},{"id":3854,"source":"idebate","title":"Wind energy provides a sustainable alternative to fossil fuels and nuclear power"},{"id":3855,"source":"idebate","title":"Wind energy provides for price stability in the long-term, wind will be with us for the duration"},{"id":3856,"source":"idebate","title":"Wind energy is unreliable and provides only an irregular source of supply – and even then only in some countries "},{"id":3857,"source":"idebate","title":"Wind turbines represent a threat to the local wildlife habitat "},{"id":3858,"source":"idebate","title":"The financial support required to further develop wind technology would be better deployed in more consistent  processes such as geo-thermal and nuclear "},{"id":3859,"source":"idebate","title":"Storing nuclear waste underground is necessary - there are no better option available"},{"id":3860,"source":"idebate","title":"Underground nuclear storage is safer than any available alternative"},{"id":3861,"source":"idebate","title":"Underground nuclear storage is excessively expensive"},{"id":3862,"source":"idebate","title":"Nuclear waste can be put to beneficial uses"},{"id":3863,"source":"idebate","title":"Nuclear waste can be used in other forms of power generation"},{"id":3864,"source":"idebate","title":"The nuclear industry has constantly required government bailouts and has never been commercially viable in an open market"},{"id":3865,"source":"idebate","title":"The nuclear industry is constantly judged on criteria that do not take its externalities into account "},{"id":3866,"source":"idebate","title":"It is simply unethical to invest in an industry that will leave the problems it creates to be dealt with for thousands of years into the future "},{"id":3867,"source":"idebate","title":"There is no instance in which renewable energy has been able to provide a major share in the energy market "},{"id":3868,"source":"idebate","title":"Renewables are mostly unproven, experimental technologies being developed on a small-scale basis that is not ready to take up the gap to move away from fossil fuels under climate change agreements"},{"id":3869,"source":"idebate","title":"Nuclear power has a proven track record in France, Canada and Russia and an increasing role in new energy markets"},{"id":3870,"source":"idebate","title":"Protecting endangered species protects the interests of humans"},{"id":3871,"source":"idebate","title":"Aesthetics"},{"id":3872,"source":"idebate","title":"Humanity bears a moral responsibility to other species"},{"id":3873,"source":"idebate","title":"Humanity owes a moral responsibility to future generations"},{"id":3874,"source":"idebate","title":"Protecting endangered species can harm human communities"},{"id":3875,"source":"idebate","title":"The term \"endangered\" is inconsistently applied"},{"id":3877,"source":"idebate","title":"Human rights trump those of lower animals"},{"id":3878,"source":"idebate","title":"Community radio gives voices to the people rather than imposing those of the powerful."},{"id":3879,"source":"idebate","title":"Radio is cheap to produce and easily accessible."},{"id":3880,"source":"idebate","title":"Community radio evens the playing field against state and corporate broadcasters."},{"id":3881,"source":"idebate","title":"Community radio just gives a megaphone to extremists."},{"id":3882,"source":"idebate","title":"Radio is yesterday’s technology. "},{"id":3883,"source":"idebate","title":"Community radio is just a platform, there is nothing innately democratic about it."},{"id":3884,"source":"idebate","title":"Artistic Freedom"},{"id":3885,"source":"idebate","title":"Pluralism and Political Interference"},{"id":3888,"source":"idebate","title":"Infantilisation and Prejudice"},{"id":3889,"source":"idebate","title":"Public Decency"},{"id":3892,"source":"idebate","title":"Teaching creationism as well as evolution gives students freedom to choose"},{"id":3893,"source":"idebate","title":"The bill does not exclude evolution just allows room for other theories"},{"id":3894,"source":"idebate","title":"Teachers should not have freedom to teach whatever they wish as fact"},{"id":3896,"source":"idebate","title":"Tennessee is not seeking to protect freedom of speech"},{"id":3898,"source":"idebate","title":"Freedom of Speech"},{"id":3900,"source":"idebate","title":"The goal is to encourage students to think"},{"id":3901,"source":"idebate","title":"Nations should be allowed an ‘official story’"},{"id":3906,"source":"idebate","title":"Countries must be willing to accept the darker sides to their past"},{"id":3912,"source":"idebate","title":"Countries are entitled to make what they will of their past."},{"id":3915,"source":"idebate","title":"Alcoholism is a disease, if the story was that the president had measles, it wouldn’t have got a mention. "},{"id":3916,"source":"idebate","title":"The protest by the opposition was a news story in its own right. "},{"id":3917,"source":"idebate","title":"The job of the reporter is to report the news not to decide what is news and what isn’t."},{"id":3918,"source":"idebate","title":"Even accusations affects reputations and therefore ability to do the job"},{"id":3919,"source":"idebate","title":"The blasphemy charge looks suspiciously convenient for Putin"},{"id":3922,"source":"idebate","title":"If it was a purely political statement, then why stage it in a church?"},{"id":3923,"source":"idebate","title":"Intention"},{"id":3924,"source":"idebate","title":"Why use the form of a prayer and mention the Virgin in a political protest?"},{"id":3925,"source":"idebate","title":"Corporates that attempt to address social issues damage political discourse."},{"id":3930,"source":"idebate","title":"A bargaining chip "},{"id":3932,"source":"idebate","title":"Argument One: Contact leads to the dissemination of values "},{"id":3933,"source":"idebate","title":"‘Separation of town and gown’"},{"id":3936,"source":"idebate","title":"Banning the book would have simply increased its role as an iconic symbol. "},{"id":3937,"source":"idebate","title":"The ban achieved no practical impact in the Internet age as it was not global. "},{"id":3941,"source":"idebate","title":"Free speech is as much about being able to receive the ideas of others as it is about expressing one’s own."},{"id":3942,"source":"idebate","title":"Braille should be offered the same protection as minority languages."},{"id":3944,"source":"idebate","title":"It is not a case of insisting that there are other or better options; there are other or better options. Equally, there is no need to ‘predict’ the death of the physical book; it is dying. Increasingly specialist publishers, such as Dorchester Publishing "},{"id":3945,"source":"idebate","title":"If the information is accessible in another format, it is wrong to claim that this is an issue of free speech. "},{"id":3946,"source":"idebate","title":"Readers of all kinds are adapting to books being produced in new formats, publishers need to respond to this decline."},{"id":3948,"source":"idebate","title":"Because religion promotes certainty of belief, divinely inspired hatred is easy to use to justify and promote violent actions and discriminatory practices."},{"id":3950,"source":"idebate","title":"Regardless of the views expressed, freedom of speech means that all opinions should be heard. "},{"id":3952,"source":"idebate","title":"Silencing views that are considered offensive is self-defeating and would be detrimental to those attempting to advance gay rights. "},{"id":3953,"source":"idebate","title":"A right to privacy – even if you are famous"},{"id":3956,"source":"idebate","title":"It simply won’t work in an internet age"},{"id":3959,"source":"idebate","title":"It sets a very dangerous precedent for controlling the output of the media – who is a celebrity?"},{"id":3960,"source":"idebate","title":"One man’s freedom fighter is another’s terrorist. "},{"id":3967,"source":"idebate","title":"There is a sense of natural justice that corrections should come in this form rather than a tiny note."},{"id":3968,"source":"idebate","title":"In an age of declining journalistic standards, forcing editors to get their facts right is a good start."},{"id":3970,"source":"idebate","title":"This undermines actual parity by creating a false sense of the right to reply."},{"id":3971,"source":"idebate","title":"This solution – if it is one - is now out of date."},{"id":3977,"source":"idebate","title":"If the courts did not handle these issues, the mob likely would."},{"id":3978,"source":"idebate","title":"Declaration of the faith is a key part of Christianity and that should be respected."},{"id":3979,"source":"idebate","title":"Other religions have the right to wear prescribed clothing enshrined in British law, it is hypocritical not to offer Christianity the same protection. "},{"id":3982,"source":"idebate","title":"Employers impose rules relating to conduct in the workplace, it’s one of the things that everyone accepts when they take and continue in a job."},{"id":3984,"source":"idebate","title":"If this were about wearing a badge with a political slogan or something similar, everyone would agree that it was inappropriate. The same principle should apply to iconography."},{"id":3986,"source":"idebate","title":"The state benefits from the skills of a university educated populace "},{"id":3992,"source":"idebate","title":"Free university education unjustly benefits one subset of society at the expense of everyone "},{"id":3998,"source":"idebate","title":"The government has no right to tell business what it should charge for its goods."},{"id":4002,"source":"idebate","title":"It is fair to reward teachers on the actual results they achieve."},{"id":4003,"source":"idebate","title":"It will give teachers an incentive to improve their teaching."},{"id":4005,"source":"idebate","title":"Competition improves the overall quality of education."},{"id":4006,"source":"idebate","title":"It is unfair to reward teachers for results they can’t influence"},{"id":4014,"source":"idebate","title":"A recession is not the point at whcih debts should be paid back. The state should focus on job creation strategies"},{"id":4016,"source":"idebate","title":"Dismantling gerontocracies"},{"id":4021,"source":"idebate","title":"Collective Bargaining is Not a Right"},{"id":4022,"source":"idebate","title":"Collective Bargaining Leads to an Overpaid Public Sector"},{"id":4023,"source":"idebate","title":"Collective Bargaining Hurts the Democratic Process"},{"id":4024,"source":"idebate","title":"Collective Bargaining is Needed to Voice Opinion"},{"id":4027,"source":"idebate","title":"Collective Bargaining is Especially Necessary in the Case of Natural Monopolies"},{"id":4028,"source":"idebate","title":"Collective Bargaining is a Right."},{"id":4030,"source":"idebate","title":"Provides autonomy for developing countries"},{"id":4031,"source":"idebate","title":"Remittances reduce poverty"},{"id":4036,"source":"idebate","title":"This policy is necessary to avoid a lost generation"},{"id":4037,"source":"idebate","title":"Increased workforce diversity"},{"id":4040,"source":"idebate","title":"This policy would only serve to discriminate against unemployed people older than 25"},{"id":4043,"source":"idebate","title":"We need to unshackle the economy"},{"id":4044,"source":"idebate","title":"There will be £350 million more to spend a week"},{"id":4048,"source":"idebate","title":"Leaving will cause a shock to the British economy"},{"id":4050,"source":"idebate","title":"Labour standards are necessary to protect basic human rights"},{"id":4052,"source":"idebate","title":"Increasing a standard, even if not as high as the donor would want, increases the standard of the present situation"},{"id":4054,"source":"idebate","title":"When developing countries employ poor labour standards, other countries follow the example in order to be competitive"},{"id":4055,"source":"idebate","title":"Universal standards of labour and business are not suited to the race for development"},{"id":4059,"source":"idebate","title":"Fastest possible transportation over a short distance"},{"id":4060,"source":"idebate","title":"The Hyperloop is comparatively cheap"},{"id":4061,"source":"idebate","title":"The Hyperloop will be a low cost system for the user"},{"id":4062,"source":"idebate","title":"It will never work"},{"id":4066,"source":"idebate","title":"Subsidies are the most efficient way for a state to redistribute wealth within its borders."},{"id":4069,"source":"idebate","title":"Substandard living conditions have a broad environmental impact"},{"id":4070,"source":"idebate","title":"Government supervised redistribution of wealth is inefficient"},{"id":4071,"source":"idebate","title":"The risk of creating dependence"},{"id":4072,"source":"idebate","title":"Social change"},{"id":4074,"source":"idebate","title":"The minimum wage aids in the propagation of social justice and the fair treatment of workers"},{"id":4075,"source":"idebate","title":"The minimum wage provides a baseline minimum allowing people to embark freely in the pursuit of happiness"},{"id":4076,"source":"idebate","title":"Higher wages boost economic growth"},{"id":4077,"source":"idebate","title":"The minimum wage encourages people to join the workforce rather than pursuing income through illegal channels"},{"id":4078,"source":"idebate","title":"The minimum wage restricts an individual’s fundamental right to work"},{"id":4080,"source":"idebate","title":"The minimum wage is little more than a political tool that ultimately harms the overall economy by raising the unemployment rate and driving businesses elsewhere"},{"id":4082,"source":"idebate","title":"The American Jobs Act Will Help the Long Term Unemployed"},{"id":4083,"source":"idebate","title":"The Jobs Act Redresses the Balance Between the Wealthy and the Middle Class"},{"id":4084,"source":"idebate","title":"The American Jobs Act Helps Small Business and Creates Jobs"},{"id":4086,"source":"idebate","title":"The American Jobs Act Encourages Risk Without Infrastructure or Results in Inaction By "},{"id":4088,"source":"idebate","title":"High Speed Rail is Better Than Air Travel"},{"id":4089,"source":"idebate","title":"Highspeed Rail is Better than Upgrading Old Infrastructure"},{"id":4090,"source":"idebate","title":"High Speed Rail is environmentally friendly"},{"id":4091,"source":"idebate","title":"High Speed Rail is Dangerous"},{"id":4092,"source":"idebate","title":"High Speed Rail is Not Currently Economically Viable"},{"id":4093,"source":"idebate","title":"High Speed Rail will not be a successful long term business investment."},{"id":4103,"source":"idebate","title":"Those able to pay more should pay more into the tax system "},{"id":4104,"source":"idebate","title":"Those who have more owe more to the state"},{"id":4106,"source":"idebate","title":"Progressive taxation promotes a more equal, more harmonious society"},{"id":4107,"source":"idebate","title":"A well-implemented progressive taxation scheme serve to promote economic growth"},{"id":4109,"source":"idebate","title":"Progressive taxes place an unfair and disproportionate burden on the wealthy"},{"id":4110,"source":"idebate","title":"The ability to orchestrate a progressive taxation regime gives undue and dangerous power to the state"},{"id":4113,"source":"idebate","title":"Buyers benefit from grey imports, in the form of greater consumer choice."},{"id":4114,"source":"idebate","title":"Allowing grey goods breaks down monopolies and passes on lower prices to consumers."},{"id":4116,"source":"idebate","title":"The free movement of goods is consistent with the basic principles of free trade"},{"id":4117,"source":"idebate","title":"Grey goods come into the country, but money goes out, weakening the economy."},{"id":4119,"source":"idebate","title":"Grey imports limit a company's control over its own products."},{"id":4120,"source":"idebate","title":"Society has a moral responsibility to educate all its young people"},{"id":4123,"source":"idebate","title":"The economy of the future requires more education"},{"id":4125,"source":"idebate","title":"Young people should have the choice to decide for themselves"},{"id":4127,"source":"idebate","title":"Not everyone is good at studying"},{"id":4128,"source":"idebate","title":"The economy can’t absorb a greatly upskilled workforce."},{"id":4129,"source":"idebate","title":"Compulsory studying would be taking young people out of the workforce"},{"id":4132,"source":"idebate","title":"Compensation is important to give the communities credit they deserve. "},{"id":4133,"source":"idebate","title":"Compensation has the potential to reverse damaged caused by Cultural Appropriation."}]